{"docid":1,"title":"FYY Leather Case with Mirror for Samsung Galaxy S8 Plus, Leather Wallet Flip Folio Case with Mirror and Wrist Strap for Samsung Galaxy S8 Plus Black","text":"Product Description Premium PU Leather Top quality. Made with Premium PU Leather. Receiver design. Accurate cut-out for receiver. Convenient to Answer the phone without open the case. Hand strap makes it easy to carry around. RFID Technique RFID Technique: Radio Frequency Identification technology, through radio signals to identify specific targets and to read and copy electronic data. Most Credit Cards, Debit Cards, ID Cards are set-in the RFID chip, the RFID reader can easily read the cards information within 10 feet(about 3m) without touching them. This case is designed to protect your cards information from stealing with blocking material of RFID shielding technology. 100% Handmade 100% Handmade. Perfect craftmanship and reinforced stitching makes it even more durable. Sleek, practical and elegant with a variety of dashing colors. Multiple Functions Card slots are designed for you to put your photo, debit card, credit card or ID card while on the go. Unique design. Cosmetic Mirror inside made for your makeup and beauty. Perfect Viewing Angle. Kickstand function is convenient for movie-watching or video-chatting. Space amplification, convenient to unlock. Kickstand function is convenient for movie-watching or video-chatting. ","features":"{\"product_summary\": \"Leather Case\", \"category\": \"mobile\", \"material\": \"Leather\", \"functions\": {\"main_function\": \"Protection\", \"additional_function_1\": \"Mirror\", \"additional_function_2\": \"CardSlots\"}, \"compatibility\": \"Samsung Galaxy S8 Plus\", \"price\": 25, \"other_details\": \"RFID Blocking\"}"}
{"docid":2,"title":"Playtex Women's 18 Hour Easy On, Easy Off Front & Back Close Post Surgery Bra US400C","text":"Product Description Introducing Playtex 18 hour front & back close wireless bra designed for dressing ease and versatility. Our newest wire free bra is designed in a soft, seamless cotton comfort blend for a smooth look under clothing and incredible comfort against your skin. Designed to offer the convenience of front close bra and a back close bra for easy fastening and removal. Wide comfort straps are soft against the skin. Product Description Introducing Playtex 18 hour front & back close wireless bra designed for dressing ease and versatility. Our newest wire free bra is designed in a soft, seamless cotton comfort blend for a smooth look under clothing and incredible comfort against your skin. Designed to offer the convenience of front close bra and a back close bra for easy fastening and removal. Wide comfort straps are soft against the skin.","features":"{\"product_summary\": \"Playtex Bra\", \"category\": \"lingerie\", \"material\": \"cotton\", \"functions\": {\"main_function\": \"support\", \"additional_function_1\": \"comfort\", \"additional_function_2\": \"ease\"}, \"compatibility\": \"women\", \"price\": 30, \"other_details\": \"wireless\"}"}
{"docid":4,"title":"YUEPIN U-Tube Clamp 304 Stainless Steel Hose Pipe Cable Strap Clips With Rubber Cushioned (1-21\/32\"(42mm)-10pcs)","text":"Product Description Specification: Material: 304 Stainless Steel,100% New Rubber Color: Silver Shape: U Shape Quantity: 10 Pieces Note: Note: Since the size above is measured by hand, the size of the actual item you received could be slightly different from the size above. Product Description Specification: Material: 304 Stainless Steel,100% New Rubber Color: Silver Shape: U Shape Quantity: 10 Pieces Note: Note: Since the size above is measured by hand, the size of the actual item you received could be slightly different from the size above.","features":"{\"product_summary\": \"U-Tube Clamp\", \"category\": \"hardware\", \"material\": \"stainless\", \"functions\": {\"main_function\": \"clamping\", \"additional_function_1\": \"strapping\", \"additional_function_2\": \"cushioning\"}, \"compatibility\": \"pipes\", \"price\": 15, \"other_details\": \"rubber\"}"}
{"docid":6,"title":"DJI Shoulder Neck Strap Belt Sling Lanyard Necklaces for Dji Phantom 3 Inspire 1 Remote","text":"Product Description Specifications: Item Conditon : Brand New Item name : Remote Controller Strap Color : Black Model : DJI Inspire 1 DJI &DJI phantom 3 professional With beautiful and adjustable design Package Includes: 1 x original neck strap for DJI phantom 3 and inspire 1 (The transmitter is not included) Product Description Specifications: Item Conditon : Brand New Item name : Remote Controller Strap Color : Black Model : DJI Inspire 1 DJI &DJI phantom 3 professional With beautiful and adjustable design Package Includes: 1 x original neck strap for DJI phantom 3 and inspire 1 (The transmitter is not included)","features":"{\"product_summary\": \"Neck Strap\", \"category\": \"accessory\", \"material\": \"fabric\", \"functions\": {\"main_function\": \"support\", \"additional_function_1\": \"adjustable\", \"additional_function_2\": \"durable\"}, \"compatibility\": \"DJI Phantom 3, Inspire 1\", \"price\": 15, \"other_details\": \"Black\"}"}
{"docid":7,"title":"Crocs Jibbitz 5-Pack Alien Shoe Charms | Jibbitz for Crocs","text":"From the brand Previous page Shop Crocs Collections Visit the Store What makes our products unique? We design unparalleled comfort for everywhere you go while innovating for personalization, so you hold the power to make your Crocs uniquely you. What problem are we solving? Comfort at every level, for the body and soul. We want you to stay true to who you are, what you want, and be able to celebrate your uniqueness. Because when you’re comfortable, you can do anything. How did we get our start? We made our debut in 2002 as a boating shoe and became the shoe of choice for those looking for comfort and style. Today, our shoes are also a blank canvas for artists, partners, and customers so we can create something authentic together. Crocs Clogs Crocs Sandals Crocs at Work Crocs Jibbitz Crocs Kids Crocs is a brand of the people, for the people and we believe that everyone should be comfortable in their own shoes. We embrace and celebrate the uniqueness in everyone, inviting the world to Come As You Are. Next page From the manufacturer Read more Read more Great for everyone Fun Styling Personalization Read more Read more Jibbitz Everything Nice Pack Jibbitz Peace, Love and Outdoors Pack Jibbitz Letters Crocs with Charms Classic Clog Explore Similar Products Pop some unicorns into your shoes with Jibbitz shoe charms. Pop some peace, love and outdoors charms into your shoes with Jibbitz shoe charms. Pop some letters into your shoes with Jibbitz shoe charms. This set includes a pair of Classic Clogs and a pack of Jibbitz shoe charms. It’s the iconic clog that started a comfort revolution around the world! Key Features Jibbitz are the perfect addition to your favorite pairs of clogs, slides, and more. Not a toy. Not intended for children under 3 years of age. Jibbitz are the perfect addition to your favorite pairs of clogs, slides, and more. Not a toy. Not intended for children under 3 years of age. Jibbitz are the perfect addition to your favorite pairs of clogs, slides, and more. Not a toy. Not intended for children under 3 years of age. Jibbitz are the perfect addition to your favorite pairs of clogs, slides, and more. Not a toy. Not intended for children under 3 years of age. Incredibly light and fun to wear. Water-friendly. Easy to clean and quick to dry. Pivoting heel straps for a more secure fit. Customizable with Jibbitz charms. Iconic Crocs Comfort: Lightweight. Flexible. 360-degree comfort. Fit N\/A N\/A N\/A Roomy fit Roomy fit Size Up or Down N\/A N\/A N\/A Size down to the next largest whole size Size down to the next largest whole size ","features":"{\"product_summary\": \"Alien Shoe Charms\", \"category\": \"footwear\", \"material\": \"plastic\", \"functions\": {\"main_function\": \"personalization\", \"additional_function_1\": \"comfort\", \"additional_function_2\": \"style\"}, \"compatibility\": \"Crocs shoes\", \"price\": 15, \"other_details\": \"lightweight\"}"}
{"docid":11,"title":"Zeagoo Women's Open Front Cardigan 3\/4 Sleeve Draped Ruffles Soft Knit Sweaters","text":"From the brand Lightweight Cardigan Previous page Best choice Black cardigan for women Most Wished Navy cardigan women Wardrobe Essentials Grey cardigan women New Color You will like--- Next page Product Description NOTE Lightweight and skin friendly fabric, a little thinner than a t-shirt, so that does cause it to wrinkle. When you receive it you can wash it in cold and hung on a hanger to dry and the wrinkles will decrease. Just the right thickness for Summer evenings or Spring\/Fall.The light color, like white, may be a little see through. Note: Do remind to check the size chart before ordering. This cardigan is in normal size, if you are more like a loose sense, then ordered up a size and the sleeve is slim fit! Tip: Color may vary slightly from image. Colors may vary from different viewing devices.. For the color of the product, please refer to the actual received. DESIGN&OCCASION Great for jeans, leggings, or little dresses,completes an out fit for a wedding! Perfect sweater for just about any event - I bought it for a chamber music performance, and also wear it to teach and for church. It is very comfortable, soft, and flattering! I bought 2 colors Gray and brown . They are fantastic the material very soft and very light excellent for office . I wear all the time at work. The fitting was so perfect . I highly recommend this product to my co workers and to all woman who loves to wear light blazer! I ordered this to go over a sleeveless dress. I love it! The cut is flattering, not boxy. I’m 5’ 4” and weigh about 185. I ordered an XL and it fits great. The length covers my bubble butt. Sleeves are 3\/4 length and easily push up and STAY! Not tight on upper arms. It is made of cotton and spandex, not sheer so it covers what needs to be covered without being bulky. Highly recommended! HIGH QUANLITY MATERIAL Does this wrinkle easily? Is this hard to iron? The material is super soft,does not wrinkle and washes great!! If you dry on low, take out of dryer quickly and hang u, it does not need ironing. It doesn't wrinkle easily. Once it fell off the chair I had it on and was on the floor overnight, and it only wrinkled a bit. I lightly steamed it, and it was fine. When I took it out of the package, it smelled bad. Always wash before putting on clothes. After washing, there will be no smell and no wrinkles. I LOVE LOVE LOVE this little cardi!!! The material is soft, its really good quality, not thin, not thick, 3\/4 sleeves looks just like the picture the seller posted & it’s perfect, it lays nicely & I absolutely love it I wish they had it in every color ! For reference, I am 5’3” & I weigh 134lbs, I purchased a small & it’s fits me perfectly! Great for jeans, leggings, or little dresses, I’m sooooo happy I bought this. I do not put most of my clothes from Amazon in the dryer, esp if I’m unsure of quality, so idk if it would shrink, I wash everything on normal then hang to dry & my clothes, I lightly sprayed this cardi with some water in a spray bottle after hanging to dry & it looked like I ironed it. About Size: Depending on her type of body on the top, I'm 5'2, small torso, 36C (it doesn't matter because it is open). I think the small will fit. It is beautiful I think it runs true to size. I’m 5’1” and weigh 147 . I got a medium and am very happy with the way it hangs...hope this helps! It’s really cute and the fabric is very soft. I ordered this to go over a sleeveless dress. I love it! The cut is flattering, not boxy. I’m 5’ 4” and weigh about 185 . I ordered an XL and it fits great. The length covers my bubble butt. Sleeves are 3\/4 length and easily push up and STAY! Not tight on upper arms. This is the perfect light weight sweater cardigan . I am 5ft 4inches and 165 pounds . I bought black xxl . I am a 40 c . The sleeves go two tge elbow not past . The sleeve has a nice fit . I just returned from the pool . I had a black cover up and put this light cardigan on . It is perfect . I realize that black on black on black is difficult to see . I bought 2 more . I will do a color reveiw and let you know how they hold up . I must say this is the perfect spring and summer light sweater \/jacket. SIZE&COLOR Material : 95% Rayon, 5%Spandex Sleeve : Three-quarter sleeves Pattern : Classic solid color, tie-dye series, leopard print series Feature : Flounce Hem Garment Care : Washing max 40°C Package Content : 1 x Women Cardigan Our Model Information : Height 175cm, Bust 90cm, Waist 60cm, Hip 90cm Size : There are 5 sizes (S, M, L, XL, XXL) available for the following listing. please allow 1-2cm differs due to manual measurement, thanks (All measurement in cm and please note 1cm=0.3937inch) Tip : There may be slight differences between the picture and the actual product. For the color of the product, please refer to the actual received. Sleeveless Vest Long Sleeve Cardigan Floral Tank Tops Flowy Tunic Tops Lace Dress Extender Full Slip Women's Sweater Vests Women's Cardigans Women's Tanks & Camis Women's Tanks & Camis Women's Full Slips Women's Sleepwear ","features":"{\"product_summary\": \"Cardigan\", \"category\": \"Apparel\", \"material\": \"Rayon\", \"functions\": {\"main_function\": \"Layering\", \"additional_function_1\": \"Comfort\", \"additional_function_2\": \"Versatile\"}, \"compatibility\": \"Women\", \"price\": 30, \"other_details\": \"Soft\"}"}
{"docid":12,"title":"Rekayla Open Toe Tie Up Ankle Wrap Flat Sandals for Women","text":"From the brand Previous page REKAYLA is a fresh new brand that wants to provide a top quality product to women all over the world. Its about being comfortable, and beautiful, feeling at home in your own shoes. We want to allow women to be empowered to reach their goals. Rekayla Women Flat Sandals Next page Product Description Read more OUR STORY ： REKAYLA is a fresh new brand that wants to provide a top quality product to women all over the world, everyone is able to reach. Its about being comfortable, and beautiful, feeling at home in your own shoes. We want to allow women to be empowered to reach their goals. WHAT'S YOUR COLOR? Find your favorite color, and take these tie up sandals to enjoy a casual summer trip PREFECT FOR SUMMER The sandal is a must-have item for the summer season.Anti-sliding, easy to carry. Ease foot pain, more suitable for long time walking. Elastic sandals Thong sandals Ankle strap sandals FEATURE Elastic strap、Open toe、V-shape T-strap、Buckle closure Ankle strap、Buckle closure、Open toe COLOR Black、Inky Navy、Khaki Green、Beige、Brown、Gold、Red Black、White、Navy Blue、Brown、Gold、Silver Brown-black、Black、Brown、White、Gold-nude、Nude、Red ","features":"{\"product_summary\": \"Tie-Up Sandals\", \"category\": \"footwear\", \"material\": \"leather\", \"functions\": {\"main_function\": \"comfort\", \"additional_function_1\": \"style\", \"additional_function_2\": \"support\"}, \"compatibility\": \"women\", \"price\": 40, \"other_details\": \"summer\"}"}
{"docid":14,"title":"DIY 5D Diamond Painting by Number Kit for Adult, Full Drill Crystal Rhinestone Embroidery Cross Stitch Diamond Embroidery Dotz Kit Home Wall Decor 15.8×11.8 Inch (Wolf)","text":"Product Description 5D DIY Diamond Painting is the new popular product Can be used in the Bedroom, Dinning Room, Bathroom, Washroom, Kitchen, Study, Home, Office Hotel, Restaurant and Bar,shining in the light , is currently most popular DIY decorations,Wealth and Good Fortune Diamond Painting Embroidery Home Decoration.very shining and bling.Make your house looks more pretty. DIY Diamond painting instruction steps 1.Take out the diamond painting kits 2.Please only need to lift a small part of the release paper, in order to avoid other regional sticky dust affect. 3.Find the corresponding diamond bag according to the numbers or letters, put the diamonds into the tray and shake. 4.Use the penpoint to adsorb the painting muds and diamond, press it to the canvas's corresponding position. 5.Press diamonds on the canvas with book or hand to make them more fixed. then 5d diamond paintings is done. Package Included 1 x Canvas 1 x set Resin Diamonds 1 x Diamond painting pen 1 x Diamond tray 1×Painting Muds SPECIFICATION Diamond Size: 0.1inch Diamond part: Full drill Pattern: Home Letter Cavas Size: 15.8×11.8 inch\/ 40*30cm Pasting Area: Full Drill Diamond Shape: Round Use: Entertainment,Gifts,Decoration Note:Normally the diamonds is add 30%, if the diamonds is not enough,pls contact us we will send the diamonds for you Product Description 5D DIY Diamond Painting is the new popular product Can be used in the Bedroom, Dinning Room, Bathroom, Washroom, Kitchen, Study, Home, Office Hotel, Restaurant and Bar,shining in the light , is currently most popular DIY decorations,Wealth and Good Fortune Diamond Painting Embroidery Home Decoration.very shining and bling.Make your house looks more pretty. DIY Diamond painting instruction steps 1.Take out the diamond painting kits 2.Please only need to lift a small part of the release paper, in order to avoid other regional sticky dust affect. 3.Find the corresponding diamond bag according to the numbers or letters, put the diamonds into the tray and shake. 4.Use the penpoint to adsorb the painting muds and diamond, press it to the canvas's corresponding position. 5.Press diamonds on the canvas with book or hand to make them more fixed. then 5d diamond paintings is done. Package Included 1 x Canvas 1 x set Resin Diamonds 1 x Diamond painting pen 1 x Diamond tray 1×Painting Muds SPECIFICATION Diamond Size: 0.1inch Diamond part: Full drill Pattern: Home Letter Cavas Size: 15.8×11.8 inch\/ 40*30cm Pasting Area: Full Drill Diamond Shape: Round Use: Entertainment,Gifts,Decoration Note:Normally the diamonds is add 30%, if the diamonds is not enough,pls contact us we will send the diamonds for you","features":"{\"product_summary\": \"Diamond Painting\", \"category\": \"Craft\", \"material\": \"Resin\", \"functions\": {\"main_function\": \"Decor\", \"additional_function_1\": \"Entertainment\", \"additional_function_2\": \"Gifts\"}, \"compatibility\": \"Adult\", \"price\": 25, \"other_details\": \"DIY\"}"}
{"docid":19,"title":"Under Armour Men's Micro G Pursuit-Wide Sneaker, 15","text":"Product Description Lightweight, breathable mesh upper delivers increased ventilation with bonded taping at midfoot. TPU heel overlay for added durability. Enhanced cushioning around ankle collar for superior comfort. Full-length EVA sock liner for added comfort & a custom fit. Cushioned EVA midsole delivers a lightweight & responsive ride. Aggressive outsole traction pattern with slightly raised rubber knobs for added grip. Strategically placed rubber pods beneath the heel & forefoot for greater durability with less weight. Product Description Lightweight, breathable mesh upper delivers increased ventilation with bonded taping at midfoot. TPU heel overlay for added durability. Enhanced cushioning around ankle collar for superior comfort. Full-length EVA sock liner for added comfort & a custom fit. Cushioned EVA midsole delivers a lightweight & responsive ride. Aggressive outsole traction pattern with slightly raised rubber knobs for added grip. Strategically placed rubber pods beneath the heel & forefoot for greater durability with less weight.","features":"{\"product_summary\": \"Sneaker\", \"category\": \"footwear\", \"material\": \"mesh\", \"functions\": {\"main_function\": \"comfort\", \"additional_function_1\": \"ventilation\", \"additional_function_2\": \"traction\"}, \"compatibility\": \"men\", \"price\": 80, \"other_details\": \"lightweight\"}"}
{"docid":22,"title":"Spider-Man: Homecoming Spider Sight Mask","text":"Product Description Set your sights on suiting up like Spider-Man! With the Spider Sight mask, kids can pretend to be one of their favorite web-slinging, wall-crawling Super Heroes. This mask features moving eyes that are activated when the wearer opens their mouth. Each mask includes a flexible band to fit most kids and adults, and features a movie like appearance to Spider-Man Homecoming. Copyright 2016 Marvel. Hasbro and all related terms are trademarks of Hasbro. Product Description Set your sights on suiting up like Spider-Man! With the Spider Sight mask, kids can pretend to be one of their favorite web-slinging, wall-crawling Super Heroes. This mask features moving eyes that are activated when the wearer opens their mouth. Each mask includes a flexible band to fit most kids and adults, and features a movie like appearance to Spider-Man Homecoming. Copyright 2016 Marvel. Hasbro and all related terms are trademarks of Hasbro.From the manufacturer Copyright 2016 Marvel. Hasbro and all related terms are trad Hasbro is committed to being an ethical and responsible company and is a recognized toy industry leader in the areas of product safety, environmental sustainability, ethical sourcing and philanthropy. Spider-Man Homecoming Spider Sight Mask Imagine channeling Spider Senses like Spider-Man with the Spider Sight Mask! With the Spider Sight mask, kids can pretend to be one of their favorite web-slinging, wall-crawling Super Heroes. This mask features moving eyes that are activated when the wearer opens their mouth. Each mask includes a flexible band to fit most kids and adults, and features movie-inspired detail from Spider-Man: Homecoming. Spider Sight mask features movie-inspired detail from Spider-Man: Homecoming Wear mask and open mouth to make eyes move! Flexible band to fit most kid and adult head sizes Suit up like the web-slinging wall-crawler, Spider-Man Read more Suit up like Spider-Man! Suit up like Spider-Man with the Spider-Man Spider Sight Mask, inspired by the upcoming film, Spider-Man: Homecoming! Imagine swinging into battle like the web-slinger with a mask that features signature red, white, and black design. When the wearer moves their mouth while wearing the mask, Spider-Man’s eyes move! Includes flexible band to fit most kid and adult head sizes. Eyes move when wearer moves mouth The Spider-Man Spider Sight Mask features movable eyes that get set into motion when kids wear the mask and open their mouths! Kids can disguise themselves like the web-slinging wall-crawler, then open their mouths to make their eyes move up and down like Spidey’s! Spider-Man sets his sights on justice! Peter Parker uses his Spider Senses to detect danger and fight off the bad guys! Kids can disguise themselves like Peter Parker does when he suits up with the Spider-Man Spider Sight Mask! Now young heroes-in-training can imagine that they are the friendly neighborhood Spider-Man, swinging into action and saving the day! Read more Includes Includes mask and instructions. Read more ","features":"{\"product_summary\": \"Spider Sight Mask\", \"category\": \"toy\", \"material\": \"plastic\", \"functions\": {\"main_function\": \"disguise\", \"additional_function_1\": \"movable\", \"additional_function_2\": \"flexible\"}, \"compatibility\": \"kids and adults\", \"price\": 20, \"other_details\": \"movie-inspired\"}"}
{"docid":23,"title":"Tee Luv ICEE Polar Bear Logo T-Shirt","text":"Product Description Read more Un-brrr-lieveably Good! With a delicious selection of flavors ranging from Blue Raspberry to Cherry and Lemonade - it's easy to see why ICEE has held the top spot as America's favorite frozen refreshment since 1967! To help our fellow nostalgic fans show off their love for the \"Coldest Drink in Town\", we've created a fun 90s inspired graphic tee featuring the instantly recognizable ICEE Polar Bear logo. To complete the retro look and feel on this ICEE shirt, we've distressed the graphic, and printed it on a soft poly-cotton light blue heather tee. Available in Adult Men's sizes: S, M, L, XL, XXL, and 3XL. Easily The Most Comfortable T-Shirt You'll Own Made from ultra soft poly-cotton, so it already feels like your favorite tee - right out of the box. Easy care, machine wash and dry. Don't worry about your new retro polar bear shirt fading, shrinking or losing its shape - Tee Luv graphic tees are designed to last. This vintage logo shirt also features a printed Tee Luv neck label for added comfort. Brought To You Exclusively By Tee Luv With licenses for America’s favorite brands, talented designers, and state-of-the-art operations, Tee Luv apparel provides great fitting and feeling t-shirts with designs or logos you can wear on your sleeve, pun intended. Order Your New Vintage ICEE Polar Bear Shirt Today! Tee Luv ICEE Polar Bear Logo T-Shirt Tee Luv Hawaiian ICEE Polar Bear T-Shirt Tee Luv Faded ICEE Logo Shirt Tee Luv ICEE Polar Bear Blue and Purple Tie Dye T-Shirt Tee Luv Men's Faded ICEE Polar Bear Chillaxin' Shirt Print Style Distressed Non-Distressed Distressed Non-Distressed Distressed Color Light Blue Heather Pool Blue Graphite Heather Blue and Purple Tie Dye Denim Heather Fabric 50% Cotton\/50% Polyester 100% Cotton 50% Cotton\/50% Polyester 100% Cotton 52% Cotton\/48% Polyester Printed Tag ✓ ✓ ✓ ✓ ✓ Available Sizes Small to 3X-Large Small to 3X-Large Small to 3X-Large Small to 3X-Large Small to 3X-Large Read more ","features":"{\"product_summary\": \"ICEE Tee\", \"category\": \"apparel\", \"material\": \"poly-cotton\", \"functions\": {\"main_function\": \"graphic\", \"additional_function_1\": \"nostalgic\", \"additional_function_2\": \"comfortable\"}, \"compatibility\": \"adult men's sizes\", \"price\": 25, \"other_details\": \"retro\"}"}
{"docid":26,"title":"GADIEMKENSD Unisex Baseball Cap Breathable Sport Hat","text":"Product Description PROFESSIONAL HAT MANUFACTURER GADIEMKENSD has been focusing on the production of hats and peripheral products. With rich experience and advanced technology, the products are well sold in many countries around the world. Our company’s outdoor functional caps, running caps, sports caps, classic baseball caps, fashionable dad hats, sun hats, UV protection beach hats, etc. are well received by consumers. GADIEMKENSD has brand store in the United States, Canada,Britain, Germany, France, Italy, Spain, Japan and other countries. GADIEMKENSD UNSTRUCTURED UV PROTECTION OUTDOOR CAP Perfect for everyday use and hot weather, GADIEMKENSD outdoor hat is made of UV resistant fabric. Built in sweatband removes sweat from eyes and face. Two-side mesh vent keeps your head cool and comfortable. Material: 100% Nylon, UPF 50+ UV Protection (mesh vents Not rated) Overall Unstructured, Ventilation Design on Both Sides, Wicking Sweatband, Binding On Peak Two Sizes are Available M Size 6 7\/8-7 1\/4, 2.75\" Brim, 2.2oz (63g) L Size 7-7 1\/2, 2.95\" Brim, 2.3oz (66g) Target Audience: Unisex Colors: Black, white, pink, blue, navy, gray, dark gray, red, khaki, army green, denim blue, etc. Hand wash only, shape it immediately and then air dry Read more UPF 50+ SUN PROTECTION Made of soft and durable nylon fabric which has passed UPF 50+ test (mesh vents not rated), UPF 50+ for ultimate sun protection, blocks 98%+ of damaging UVA\/UVB sun rays BREATHABLE MESH DESIGN The two-side mesh design allows for moisture and heat to easily escape these caps, which not only keeps your noggin cool, but you’ll also stay dry QUICK-DRYING Light and soft quick drying fabric, even if the hat is wet with sweat or light rain, it will dry quickly. LIGHTWEIGHT LIGHTWEIGHT: About 2.3 ounces (66g). It's light and comfortable to wear all day (The weight of different colors and sizes will be slightly different) GADIEMKENSD outdoor cap is perfect for hiking, tennis and other outdoor activities, and is the perfect outdoors companion in warm weather. It has adjustable buckles to fit various head sizes Foldable Sun Hat Reflective Running Cap 2Pack Folding Cap Tripper Hat Cotton Baseball Cap Washed Canvas Cap Material Nylon Polyester Polyester Nylon+Spandex Cotton Cotton Head Circumference 6 7\/8-7 3\/8 6 5\/8-7 1\/2 6 3\/4-7 1\/2 6 3\/4-7 1\/2 6 7\/8-7 3\/4 6 3\/4-7 1\/2 Unstructural ✓ ✓ ✓ ✓ ✓ ✓ Product Features Foldable, Removable Reflective, Stretch, Quick dry Foldable, Quick dry Stretch Soft Soft ","features":"{\"product_summary\": \"Baseball Cap\", \"category\": \"headwear\", \"material\": \"nylon\", \"functions\": {\"main_function\": \"UV Protection\", \"additional_function_1\": \"Breathable\", \"additional_function_2\": \"Quick-drying\"}, \"compatibility\": \"Unisex\", \"price\": 20, \"other_details\": \"Lightweight\"}"}
{"docid":27,"title":"dbest products Trolley Dolly Red Foldable Shopping cart for Groceries with Wheels and Removable Bag and Rolling Personal Handtruck Standard","text":"Product Description The Trolley Dolly is great to transport items around while on-the-go, downtown or the business. Large comfortable handle with rubberized grip reduces the shock when it is being pulled. Oversized, beefy wheels allow smooth rolling on any surface, even uneven paths. Removable shopping bag features seven compartments and pockets including a beverage holder. It is made of strong, weatherproof material. Remove the shopping bag, and the Trolley transforms into a Dolly for amazing weight capacity of 110 lb. The Trolley Dolly is the ideal solution to move a wide variety of items with ease. It folds in half the size of traditional trolleys for compact storage anywhere when not in use. The frame is made of durable aluminum. Product Description The Trolley Dolly is great to transport items around while on-the-go, downtown or the business. Large comfortable handle with rubberized grip reduces the shock when it is being pulled. Oversized, beefy wheels allow smooth rolling on any surface, even uneven paths. Removable shopping bag features seven compartments and pockets including a beverage holder. It is made of strong, weatherproof material. Remove the shopping bag, and the Trolley transforms into a Dolly for amazing weight capacity of 110 lb. The Trolley Dolly is the ideal solution to move a wide variety of items with ease. It folds in half the size of traditional trolleys for compact storage anywhere when not in use. The frame is made of durable aluminum.From the manufacturer Read more Read more Read more Read more Trolley Dolly Bigger Trolley Dolly Trolley Dolly With Seat Stair Climber Trolley Dolly Stair Climber Bigger Trolley Dolly Weight Capacity 110 lbs. 150 lbs. 110 lbs. 110 lbs. 150 lbs. Item Weight 5 lbs. 6 lbs. 8 lbs. 6 lbs. 7 lbs. Toe Plates (Inches) 9 x 13 inches 11 x 16 inches 9 x 13 inches 9 x 13 inches 11 x 16 inches Height (Inches) 38 inches 40 inches 44 inches 38 inches 44 inches Stair Climbing Weight Capacity 40 lbs. 60 lbs. Seat ✓ ","features":"{\"product_summary\": \"Trolley Dolly\", \"category\": \"shopping\", \"material\": \"aluminum\", \"functions\": {\"main_function\": \"transport\", \"additional_function_1\": \"foldable\", \"additional_function_2\": \"removable\"}, \"compatibility\": \"groceries\", \"price\": 50, \"other_details\": \"weatherproof\"}"}
{"docid":29,"title":"Pure Daily Care Luma - 4 in 1 Skin Therapy Wand - Ion Therapy LED Light Machine - Wave Stimulation- Massage - Anti Aging - Lift & Firm Tighten Skin Wrinkles","text":"From the brand Pure Daily Care Professional Grade Skincare & Wellness Devices Previous page Pure Daily Care is a USA based brand that creates cutting-edge skincare & wellness devices. From skin-transforming technology to mood-enhancing aromatherapy, our advanced tools have helped over 1 million customers address concerns like wrinkles, breakouts, and stress with professional grade treatments at home. Pure Daily Care is the perfect gift for the Holiday season for yourself or a loved one! Skin Transforming Technology Innovative Treatments from LED Light Therapy to NuDerma High Frequency. Our Skin Devices Will Get You Fast, Affordable Results. Mood Enhancing Aromatherapy Transform Your Space into an Oasis with Top Quality Oil Diffusers and Pure Essential Oils. Shop Best Sellers Next page Product Description With Luma Wand, harness the power of 4 skin therapy modes for a curated wellness experience: · LED Photonic Light Therapy: red, blue and green light modes, to address aging, blemish, and pigmentation concerns · Bio-Wave Mode: Stimulate skin for a firmer and lifted appearance · Ionic Channeling: Clean+ mode to deep clean the skin by attracting oil, dirt and debris; Nutri- mode to apply serums and creams to deeper layers of the skin · Massage Mode: Stimulate facial muscles to promote microcirculation and lymphatic drainage What is LED light therapy, and why is it so beneficial? - LED light therapy is a non-invasive treatment where skin is exposed to one or more wavelengths (colors) of light. The light enters the skin’s layers to help improve the skin. - Different light colors penetrate the skin at different depths, addressing skin concerns that arise at various layers. Read more Red Light penetrates the deeper layers of the skin, where it helps stimulate the production of collagen, for a plumper and younger appearance Green Light penetrates the dermis, reducing the look of skin discoloration and an uneven complexion Blue Light penetrates the uppermost layers of the skin, targeting the root cause of blemishes and breakouts, and addressing inflammation Read more Combine modalities to tailor your skin care regimen: Anti-aging combination: - Bio-wave - Nutri- - Massage - Photon red light - 10 minutes Cleansing combination: - Bio-wave - Clean- - Photon green light - 15 minutes Blemish-Inflammation combination: - Photon blue light - 8 minutes Read more ","features":"{\"product_summary\": \"Luma Skin Therapy Wand\", \"category\": \"skincare\", \"material\": \"plastic\", \"functions\": {\"main_function\": \"therapy\", \"additional_function_1\": \"massage\", \"additional_function_2\": \"anti-aging\"}, \"compatibility\": \"all skin types\", \"price\": 150, \"other_details\": \"professional grade\"}"}
{"docid":31,"title":"Engraved Desk Name Plate for Home Office - Beautiful Custom Desk Name Plate for Business Professional & Office Staff","text":"Product Description Our Polished Finish Desk Wedge a is stylish, memorable way to introduce yourself to visitors. Our custom rosewood desk wedges also make a practical, yet sophisticated gift for any office professional or manager. Product Description Our Polished Finish Desk Wedge a is stylish, memorable way to introduce yourself to visitors. Our custom rosewood desk wedges also make a practical, yet sophisticated gift for any office professional or manager.","features":"{\"product_summary\": \"Desk Name Plate\", \"category\": \"office\", \"material\": \"rosewood\", \"functions\": {\"main_function\": \"identify\", \"additional_function_1\": \"gift\", \"additional_function_2\": \"decorate\"}, \"compatibility\": \"office professionals\", \"price\": 30, \"other_details\": \"polished finish\"}"}
{"docid":32,"title":"H2H Mens Casual Slim Fit Turtleneck Pullover Knit Lightweight Sweaters Shirts","text":"From the brand Previous page H2H Lightweight Sweater List H2H Pullover Sweater List H2H Cardigan Sweater List H2H Crew neck Sweater List H2H Turtleneck Sweater List Next page Product Description H2H is a Korean brand designed for men and women offering slim fit style with highest qualities. We bring customers to a different outlook on life of fashion. ** Other Note : 1. Please refer to the size chart listed below. 2. Colors may be slightly different from on screen display and in person. Fabric Detail - Heather Color KMTTL028 \/ KMTTL0412 \/ CMOSWL072 All the styles on this page are made of the same fabric POLYESTER95% SPANDEX5% Since all styles made of two different colors of yarn, not one color but two colors are mixed in the clothes. These fabric has excellent warmth and elasticity. It is suitable for spring, fall, and winter and is soft. Read more Casual Slim Fit Pullover Sweaters - HEATHER Color and LIGHTWEIGHT Pullover Thermal Sweaters. Model Height - 73.2 inch \/ Weight - 169.8 lb \/ Model Outfit Size - US L It is a pullover sweater with a variety of colors and light and basic designs, suitable for casual daily wear. It is good for layering such as shirts and outerwear, and can create various styles. Mock neck style slightly covers the neck, giving a different feeling from turtleneck. It is good for layering such as shirts and outerwear, and can create various styles. CMOSWL045 CMOSWL068 CMOSWL073 CMOSWL076 CMOSWL087 CMTTL099 Weight Heavy A Little Heavy A Little Heavy Heavy Lightweight Lightweight Feature Twisted Patterned Solid Patterned Solid Patterned and shirring Neckline Unique Twisted Patterned Rib Knitted Fabric Pointed Patch on shoulder and spandex blended ","features":"{\"product_summary\": \"Slim Sweater\", \"category\": \"Apparel\", \"material\": \"Polyester\", \"functions\": {\"main_function\": \"Warmth\", \"additional_function_1\": \"Elasticity\", \"additional_function_2\": \"Layering\"}, \"compatibility\": \"Men and Women\", \"price\": 35, \"other_details\": \"Lightweight\"}"}
{"docid":33,"title":"Senston Tennis Rackets for Adults 27 inch Tennis Racquets - 2 Player Tennis Racket Set with 3balls,2 Grips, 2 Vibration Dampers","text":"From the brand Senston Senston has been making and selling better sporting goods for years. And hope our sports products will bring you more happiness! Previous page The best tennis gear. Adult tennis racket 27 inch kids tennis racket19\"\/ 23\"\/25\" Ideal tennis racket for kids Starting a new tennis game? Featured for you Next page Product Description Package for the racket 2 TENNIS RACKET 3 TENNIS BALL 2 VIBRATION DAMPER(random color; reduce vibration of tennis string) 2 OVERGRIP(random color; keep your hands dry, ensures less rub and improve comfort.) 1 RACKET COVER(Protect the racket, easy to carry with a shoulder strap) With the introduction of a one-piece molded technology, the tennis racquet has the feature of high intensity and durability. Not only does it combine a good hit acceleration, it also provides sufficient stroke control. FEATURES: Lightweight, impact resistance and strong Hit well, little vibration, do not hurt your wrist Good shock absorption effect and bring a better batting feel Read more Read more Tennis Racket 19\" Tennis Racket 23\" Tennis Racket 27\" Tennis Racket 27\" Tennis Racket 23\" Material Aluminium Aluminium Carbon Alloy Crabon Fiber Aluminium Color Blue\/ Pink Blue\/ Pink Blue\/ White\/ Red White\/Orange Blue\/ Pink Weight unstrung 180g 210g 260-280g 250-260g 210g Length 19\" \/48.2-48.8cm 23\" \/58.2-58.8cm 27\" \/68.5-69cm 27\" \/68.5-69cm 23\" \/58.2-58.8cm Head size 81sq inch 92sq inch 96-100 sq inch 96-100 sq inch 92sq inch Grip size 4 4 1\/4 4 1\/4 4 1\/2 4 1\/4 Stringing Advice 45-55 lbs 45-55 lbs 50-55 lbs 50-55 lbs 45-55 lbs Suitable Kids 2 - 5 years old Children 8 and 12 years old Teenager and Adults Teenager and Adults Children 8 and 12 years old ","features":"{\"product_summary\": \"Tennis Racket Set\", \"category\": \"sports\", \"material\": \"Carbon\", \"functions\": {\"main_function\": \"hit\", \"additional_function_1\": \"control\", \"additional_function_2\": \"absorption\"}, \"compatibility\": \"Adults\", \"price\": 80, \"other_details\": \"Lightweight\"}"}
{"docid":34,"title":"Veken French Press Coffee Maker (34 oz), 304 Stainless Steel Coffee Press with 4 Filter Screens, Durable Easy Clean Heat Resistant Borosilicate Glass - 100% BPA Free, Black","text":"Product Description Veken is dedicated to bringing our customers premium, high-quality, and functional household products, fun toys, pet supplies and travel accessories at reasonable prices. Our vision is to continuously innovate and improve our products based on customer needs as well as current industry trends. Our customer centric approach means that customers always come first. Notes: In the transportation of the Veken French Press, we have had a 1% breakage rate. If you receive a damaged package, please take a photo and then we will send you a NEW Veken French Press, and you will not have to return the broken item. What Will You Get -1 French Press Coffee Maker -1 Wooden Spoon -1 Measuring Spoon -1 Milk Frother -1 Sponge Cleaning Brush -4 Filter Screens -1 Instruction Manual Safety Reminder 1. Keep away from children when hot to avoid burns! 2. Using excessive force can cause scalding liquid to shoot out of the pot. 3. Do not use on an induction cooker. Reading - Relax yourself Working - Keep awake Gathering - Share delicious Read more Read more Food Grade Safety Material All our metal parts are made of 304 stainless steel, protecting the coffee press from rust. The large carafe is made of heat-resistant borosilicate glass, which can withstand boiling water! Powerful Filtration Technique Double mesh filter & 2 Extra filter screens Powerful filtration Technique - The double mesh filter is a significant improvement over other presses - helping to minimize residual grounds and allowing you to make that perfect cup - just as pure and tasty as one made by professionals. Free Wooden Spoon*1 Free Measuring Spoon *1 Free Milk Frother*1 Free Sponge Cleaning Brush*1 Read more Purchase now! Purchase now! Purchase now! Purchase now! Purchase now! Cup 34oz 34oz 34oz 22oz 22oz+16oz+1.1oz Nice Gift ✓ ✓ ✓ ✓ ✓ For coffee lovers, the process of making the morning’s coffee is a ritual to start the day. In fact, many enjoy the process of making the coffee almost as they enjoy drinking that first cup. The Veken French Press is the perfect piece of equipment for coffee lovers and enthusiasts. All in all, the user-friendly and elegant design of the Veken French Press makes it the ideal choice for any coffee-loving household. Its affordability factor allows budget-minded coffee lovers the chance to appreciate a bargain and still make excellent coffee at home. The stainless steel screen filter minimizes the amount of residual coffee grounds in your coffee. The borosilicate glass of the press reduces noise generated by traditional metal presses. Its glass beaker allows for you to monitor and fully enjoy the entire coffee-making experience, which is exactly what life with the Veken French Press is like — an experience. The Veken allows for the coffee’s natural aroma to fill your kitchen each morning. That sensory experience, in turn, makes what might ordinarily be a chore an enjoyable start to each day. ","features":"{\"product_summary\": \"French Press\", \"category\": \"kitchen\", \"material\": \"stainless steel\", \"functions\": {\"main_function\": \"brewing\", \"additional_function_1\": \"filtering\", \"additional_function_2\": \"monitoring\"}, \"compatibility\": \"coffee lovers\", \"price\": 30, \"other_details\": \"durable\"}"}
{"docid":36,"title":"Uinkit Hot Thermal Laminating Pouches 5Mil Thick for Extra Protection 11.5x17.5 inches Laminating Sheets for Sealed 11x17inches Document and Photo 50 Pack A3 Menu Taloid Size","text":"From the brand Uinkit Brand Professional Printing Media Supplier Previous page Who Are We? At Uinkit, we truly believe everyone deserves better products. So we've made it our goal to serve each and every person by offering professional office and media products. UINKIT products range from laminating sheets, photo paper, OHP transparency film etc. Since 2013, we've served millions of consumers, and have become one of the most popular online sellers of office products. UINKIT's Best Sellers Next page Product Description 5mil 2.3\"x3.7\" laminating pouches 5mil 4x6 laminating pouches 5mil 9x14.5 laminating pouches 5mil 8.5x11.5 laminating pouches 3.5mil 11x17 laminating pouches 5mil 11x17laminating pouches Pouches Dimension 2.3\"x3.7\" 4.3\"x6.3\" 9\"x14.5\" 9x11.5 11.5\"x17.5\" 11.5x17.5 Thickness 5mil 5mil 5mil 5mil 3.5mil 5mil Quantity 120Pack 300Pack 100Pack 100Pack 100Pack 100Pack Rounded Corner ✓ ✓ ✓ ✓ ✓ ✓ Recommended Use Business cards, Library cards, Insurance cards,Reusable coupons Photo,Flashcards,instruction cards Legal documents,Leases ,Agreements,Manuals Kid's artwork,Labeling, Certificates,Documents Menus, Certificates, Kid's Artwork,Labeling, Everyday laminating Menus, Certificates, Kid's Artwork,Labeling, Long Lasting Laminating Here Are Some Important Tips For You: Insert sealed end first to avoid trapping air and potential jamming. Insert pouch with the document straight in the machine to avoid crinkled sides. Always do a test lamination prior to laminating unique and important documents to make sure results areas desired. Trouble Shooting: Curling Pouches ? Oil Slick ?Air Bubble? Solution:Use a cover sheet & Use a carrier Pouch & Reduce lamniator Temperature. Cloudy ？ Air Pockets ？Not Sealing ？ Solution:Ensure laminator is fully preheated & Allow laminator to reheat between pouches & Run pouch a second time & Increase laminator temperature.  ","features":"{\"product_summary\": \"Laminating Pouches\", \"category\": \"office\", \"material\": \"plastic\", \"functions\": {\"main_function\": \"protect\", \"additional_function_1\": \"seal\", \"additional_function_2\": \"laminate\"}, \"compatibility\": \"documents\", \"price\": 25, \"other_details\": \"thermal\"}"}
{"docid":37,"title":"ADOME Crop Top for Women Mesh Tee Shirt Plus Size Sheer Blouse Long\/Short Sleeve Black XX-Large","text":"From the brand Previous page Plus Size Swimsuits &Coverup Plus Size High Waist Bikini Set Next page Product Description ADOME Mesh Crop Top Long Sleeve Women Sheer Mesh Shirt Shirt Cropped Tee Top ADOME Women's Sheer See-Through Crop Tops Long Sleeve T-Shirt Mesh Tee Blouse ADOME See Through Shirt Long Sleeve Mesh Cropped Top for Women ADOME Women's Sheer See-Through Crop Tops Short Sleeve T-Shirt Mesh Crop Tee Blouse Crop Top for Women Mesh Tee Shirt Plus Size Sheer Blouse Short Sleeve Crop Top for Women Mesh Tee Shirt Plus Size Sheer Blouse Long Sleeve Clearance Clearance Clearance Clearance Clearance Clearance Color Wine Red Purple Red Dark Green White Black Size S-2XL S-2XL S-2XL S-2XL S-2XL S-2XL ","features":"{\"product_summary\": \"Crop Top\", \"category\": \"Clothing\", \"material\": \"Mesh\", \"functions\": {\"main_function\": \"Sheer\", \"additional_function_1\": \"Long\/Short Sleeve\", \"additional_function_2\": \"Plus Size\"}, \"compatibility\": \"Women\", \"price\": 25, \"other_details\": \"Various Colors Available\"}"}
{"docid":38,"title":"LB World Map Tapestry Wall Hanging Various Cartoon Animals Tapestrise World Distribution Map Wall Decor Blanket for Kids Bedroom Living Room Dorm Decor, 60Wx40H inches","text":"Product Description This modern tapestry will make complete makeover of your wall or ceiling or your bed,or home decoration for any space, Change Now! Dress up your family life and give you a colorful living surrounding. SPECIFICATION: Material : Made of 100% lightweight polyester fabric with hand-sewn finished edges; Size : 60 W x 40 H inches(150x100cm); Package : 1 x Wall tapestry ,6 x Non- trace nails. Applicable People : Applies to everyone,kids baby boys girls teen women men adult and old. Personalized : We can customize,different size and picture,if you need,please feel free to contact me. FEATURES: 1. High resolution pictures bring 3D like realistic experience to your life. 2. Featuring vivid colors and crisp lines, these highly unique and versatile tapestries are durable enough for both indoor and outdoor use. 3. It is durable and will last for many years to come. CARE INSTRUCTIONS: 1. Hand\/Machine Wash,Cold Water,Do NOT use bleach. 2.Dry flat or hang to dry in a shaded area,Never use a drying machine,DO NOT hang in direct sunlight for long time. 3.Ironing: low temperature within 100°C NOTICE: 1.Because of the unique and handmade nature the measurements above may differ a small bit from the real one. 2.Actual colors may vary from those shown due to the nature of photographing and monitor color settings. Product Description This modern tapestry will make complete makeover of your wall or ceiling or your bed,or home decoration for any space, Change Now! Dress up your family life and give you a colorful living surrounding. SPECIFICATION: Material : Made of 100% lightweight polyester fabric with hand-sewn finished edges; Size : 60 W x 40 H inches(150x100cm); Package : 1 x Wall tapestry ,6 x Non- trace nails. Applicable People : Applies to everyone,kids baby boys girls teen women men adult and old. Personalized : We can customize,different size and picture,if you need,please feel free to contact me. FEATURES: 1. High resolution pictures bring 3D like realistic experience to your life. 2. Featuring vivid colors and crisp lines, these highly unique and versatile tapestries are durable enough for both indoor and outdoor use. 3. It is durable and will last for many years to come. CARE INSTRUCTIONS: 1. Hand\/Machine Wash,Cold Water,Do NOT use bleach. 2.Dry flat or hang to dry in a shaded area,Never use a drying machine,DO NOT hang in direct sunlight for long time. 3.Ironing: low temperature within 100°C NOTICE: 1.Because of the unique and handmade nature the measurements above may differ a small bit from the real one. 2.Actual colors may vary from those shown due to the nature of photographing and monitor color settings.","features":"{\"product_summary\": \"World Map Tapestry\", \"category\": \"Home\", \"material\": \"Polyester\", \"functions\": {\"main_function\": \"Decoration\", \"additional_function_1\": \"Customization\", \"additional_function_2\": \"Indoor\/Outdoor Use\"}, \"compatibility\": \"Everyone\", \"price\": 30, \"other_details\": \"Vivid Colors\"}"}
{"docid":40,"title":"Pool RX 101001 6 Month Algaecide Blue Treats 7.5k-20k gallons, Single, Unit","text":"Product Description PoolRx Pool Unit #101001 6 Month Algaecide Blue Treats 7.5k-20k gallons, Single Product Description PoolRx Pool Unit #101001 6 Month Algaecide Blue Treats 7.5k-20k gallons, SingleFrom the manufacturer PoolRx Pool Unit #101001 6 Month Algaecide Treats 7.5k - 20k gallons The blue Pool Rx pool unit is an EPA Registered, NSF\/ANSI 50 Certified, swimming pool algaecide supporting 7.5k-20K gallons of water. The Pool Rx pool unit contains a proprietary blend of minerals that continuously and effectively eliminate algae. The specially treated alloy cylinder is packed with Pool Rx granular formulation. These minerals immediately dissolve out of the cylinder and form a stable residual throughout the pool water. The minerals eliminate the algae while freeing up low levels of chlorine to be more active and productive in the water. During the pool's filtration process the minerals are rejuvenated every time they return and pass through the cylinder. The granular minerals are lost from algae kill, backwashing, splash out and filter cleaning. The harder the minerals work and the tougher the conditions, the shorter their lifespan. PoolRx works synergistically with a constant low level of chlorine. Residential (0.5 - 1.0 ppm) Commercial (1.0 - 5.0 ppm). Replace the Pool Rx pool unit at the beginning of each season for best results. Pool Rx is ideal for use with Chlorine, Salt, UV or Ozone systems. Supporting any size body of water, Pool Rx+ is perfect for both Residential and Commercial pools. PoolRx Products Now NSF 50 Certified PoolRx products are EPA Registered and now NSF\/ANSI\/CAN 50 certified ","features":"{\"product_summary\": \"PoolRx Algaecide\", \"category\": \"pool\", \"material\": \"alloy\", \"functions\": {\"main_function\": \"algaecide\", \"additional_function_1\": \"mineral\", \"additional_function_2\": \"chlorine\"}, \"compatibility\": \"chlorine, salt, UV, ozone\", \"price\": 50, \"other_details\": \"6 month treatment\"}"}
{"docid":41,"title":"Thermos The Rock Vacuum Insulated 1 Liter Beverage Bottle, stainless steel\/black, 1.1 quart (2510TRI2)","text":"Product Description Perfect for hikers, campers and others in need of an efficient method of transporting large quantities of water, the THERMOS 1.1 quart Stainless Steel Beverage Bottle is here. Made of high quality, durable stainless steel, this beverage bottles is tough. It also utilizes THERMOS patented vacuum insulation technology to maximize temperature retention, meaning your cold drinks will stay colder longer. The durable stainless steel cap doubles as a container for drinking and there is a rigid, ergonomic handle for optimal portability. Product Description Perfect for hikers, campers and others in need of an efficient method of transporting large quantities of water, the THERMOS 1.1 quart Stainless Steel Beverage Bottle is here. Made of high quality, durable stainless steel, this beverage bottles is tough. It also utilizes THERMOS patented vacuum insulation technology to maximize temperature retention, meaning your cold drinks will stay colder longer. The durable stainless steel cap doubles as a container for drinking and there is a rigid, ergonomic handle for optimal portability.","features":"{\"product_summary\": \"Thermos Bottle\", \"category\": \"outdoor\", \"material\": \"stainless steel\", \"functions\": {\"main_function\": \"insulation\", \"additional_function_1\": \"portability\", \"additional_function_2\": \"storage\"}, \"compatibility\": \"water\", \"price\": 30, \"other_details\": \"durable\"}"}
{"docid":43,"title":"Easton DELUXE Baseball Pant | Youth Sizes | Solid","text":"Product Description Swing for the fences in the Easton Deluxe men's pant. It's crafted using the moisture-wicking Bio-Dri performance technology that draws sweat away from the skin to keep you cool and dry. The UV-protective fabric shields your skin from harmful sun damage. Product Description Swing for the fences in the Easton Deluxe men's pant. It's crafted using the moisture-wicking Bio-Dri performance technology that draws sweat away from the skin to keep you cool and dry. The UV-protective fabric shields your skin from harmful sun damage.From the manufacturer Read more Read more ","features":"{\"product_summary\": \"Baseball Pant\", \"category\": \"Apparel\", \"material\": \"Fabric\", \"functions\": {\"main_function\": \"Moisture-wicking\", \"additional_function_1\": \"UV-protective\", \"additional_function_2\": \"Breathable\"}, \"compatibility\": \"Youth Sizes\", \"price\": 40, \"other_details\": \"Solid\"}"}
{"docid":44,"title":"SHARP 24 in 1.2 cu. ft. Sharp IoT + Easy Wave Open, Stainless Steel Convection Microwave Drawer","text":"Product Description - First-in-its-Class Convection Microwave Drawer Oven - Dual Convection Fans for Turntable-Free Baking, Roasting, Grilling, and Air Frying - Smart-Home Ready with Alexa Compatibility and Sharp Kitchen App - Easy Wave Open for Quick, Touchless Opening of the Convection Microwave Drawer Oven - Built-In Airflow Control for Flush Mounting - 120V Standard U.S. Household Outlet - Concealed, Touch Glass Controls are Easy-to-See and Operate at a Convenient 45 Angle Product Description - First-in-its-Class Convection Microwave Drawer Oven - Dual Convection Fans for Turntable-Free Baking, Roasting, Grilling, and Air Frying - Smart-Home Ready with Alexa Compatibility and Sharp Kitchen App - Easy Wave Open for Quick, Touchless Opening of the Convection Microwave Drawer Oven - Built-In Airflow Control for Flush Mounting - 120V Standard U.S. Household Outlet - Concealed, Touch Glass Controls are Easy-to-See and Operate at a Convenient 45 Angle","features":"{\"product_summary\": \"Sharp Microwave\", \"category\": \"kitchen\", \"material\": \"stainless\", \"functions\": {\"main_function\": \"convection\", \"additional_function_1\": \"grilling\", \"additional_function_2\": \"air frying\"}, \"compatibility\": \"Alexa\", \"price\": 600, \"other_details\": \"smart-home\"}"}
{"docid":46,"title":"2 Pack Adjustable Bib Apron 2 Pockets Cooking Kitchen Bar Chef Apron","text":"Product Description HOMSOLVER brings high-quality adjustable bib apron with pockets To the common folk with top-notch service & support. The classic black design of the Homsolver Adjustable Bib Apron immediately identifies you as the master chef of your home or deck. The Adjustable Bib Apron is machine-washable, fade-proof, and resists wrinkles and shrinkage. Made from a long-wearing poly-cotton blend, this commercial-grade yarn dyed fabric has been treated with a soil release finish to keep it looking crisp and professional. DURABLE DESIGN - Designed for a timeless feel, our product's stylish details are as carefully considered as the rugged materials we construct them from. We believe in products that are built to last. ALL DAY COMFORT - Built for quality and comfort. This isn't your average kitchen apron. Durable, breathable, soft and machine washable. Prevent neck pain and irritation with cross-back straps. Easy to use adjustable release buckle on strap makes putting it on, adjusting, and removal a cinch. VERSATILE SIZE & POCKETS - Whether \"Big & tall\" , this apron offers broad coverage & a custom fit. 2 large tool pockets(5.2\"L x 7\"W each). Bib dimensions measures 26\" W x 30\" L. Long tie straps accommodate up to 40 inch waist(Each). Chef Hat maximum size is 11\"L x 8.7\"W. Chef Hat minimum head circumference of the chef cap is 22\", can be stretched to up to 25.4\". WASHING DETAILS Machine-wash cold. Do not bleach. Clasp strap clips to prevent tangling. Wash separately initially to avoid color bleeding. Click the “Add to Cart” button at the top of this page, and outfit your kitchen with the Homsolver Adjustable Bib Apron. Product Description HOMSOLVER brings high-quality adjustable bib apron with pockets To the common folk with top-notch service & support. The classic black design of the Homsolver Adjustable Bib Apron immediately identifies you as the master chef of your home or deck. The Adjustable Bib Apron is machine-washable, fade-proof, and resists wrinkles and shrinkage. Made from a long-wearing poly-cotton blend, this commercial-grade yarn dyed fabric has been treated with a soil release finish to keep it looking crisp and professional. DURABLE DESIGN - Designed for a timeless feel, our product's stylish details are as carefully considered as the rugged materials we construct them from. We believe in products that are built to last. ALL DAY COMFORT - Built for quality and comfort. This isn't your average kitchen apron. Durable, breathable, soft and machine washable. Prevent neck pain and irritation with cross-back straps. Easy to use adjustable release buckle on strap makes putting it on, adjusting, and removal a cinch. VERSATILE SIZE & POCKETS - Whether \"Big & tall\" , this apron offers broad coverage & a custom fit. 2 large tool pockets(5.2\"L x 7\"W each). Bib dimensions measures 26\" W x 30\" L. Long tie straps accommodate up to 40 inch waist(Each). Chef Hat maximum size is 11\"L x 8.7\"W. Chef Hat minimum head circumference of the chef cap is 22\", can be stretched to up to 25.4\". WASHING DETAILS Machine-wash cold. Do not bleach. Clasp strap clips to prevent tangling. Wash separately initially to avoid color bleeding. Click the “Add to Cart” button at the top of this page, and outfit your kitchen with the Homsolver Adjustable Bib Apron.Product Description HOMSOLVER brings high-quality Pinstripe adjustable bib apron with pockets To the common folk with top-notch service & support. The classic black-and-white pinstripe design of the Homsolver Adjustable Bib Apron immediately identifies you as the master chef of your home or deck. The Adjustable Bib Apron is machine-washable, fade-proof, and resists wrinkles and shrinkage. Made from a long-wearing poly-cotton blend, this commercial-grade yarn dyed fabric has been treated with a soil release finish to keep it looking crisp and professional. BUILT TO LAST: Build quality that the cheap chef aprons can't match! Machine washable. Constructed with gun-metal grommets and rivets. Soft to touch, belongs to uniform cloth, this apron is machine-washable, fade-proof, resists wrinkles and shrinkage. Machine wash with like colors, tumble try low. Safe for you & your family. THREE BIG USEFUL POCKETS: 2 large pockets in the middle of apron for easy holding meat thermometer, grill slips, recipe cards, etc, Perfect to put cooking gadget and coordinate with your kitchen for baking, cooking, serving, crafting and more. SUPER PROTECTION & BROAD USE: Large bib apron that covers from chest to knee provides great coverage and protection from kitchen grease, spills and food stains.For professional and commercial use. Grill apron, barbecue apron, bbq apron, kitchen apron, cook apron, chef apron for men, professional apron, grilling apron, restaurant apron, bakers apron, barista apron, butcher apron, artist apron, man apron, men's apron, manly apron for the grill master, artist apron, aprons for men, and more. Hpmsolver 2 Pack Apron About Homsolver Homsolver is the sole authorized seller of authentic Homsolver products (other than Amazon) on the Amazon platform. Offers from other sellers are scamming attempts, counterfeit products or unauthorized reselling. To ensure your complete safety and the excellent service we strive to give our customers, please avoid purchasing from other sellers. Comfort Cooking for your Familly Great Protection for your Love Homsolver focks on home kitchen for a long years, Providing better protection to both waist and the chest portion. Homsolver is the sole authorized seller of authentic Homsolver products (other than Amazon) on the Amazon platform. To ensure your complete safety and the excellent service we strive to give our customers, please avoid purchasing from other sellers. Polyester Material Adjustable necklace Two big pockets Long tie fit most people Read more PREMIUM CHIEF APRONS High quality 65\/35-Poly\/cotton yarn dyed fabric, this apron is machine-washable, fade-proof, durable, string adjustable, anti-wrinkle, resistant washable and resistant wearable. ADJUSTABLE NECKLACE & TIE Each apron measures 31\"L x 26\"W Adjustable neck strap for better wearing feeling(minimum head circumference of 22\", can be stretched to up to 25.4\"). EXQUISITE SEWING Comes with an exquisite sewing, this unisex black apron is absolutely a great gift for your father, mother, wife\/husband,friends. Read more Why Should You Choose Homsolver Chef Apron? BROAD USE For professional and commercial use. Grill apron, barbecue apron, bbq apron, kitchen apron, cook apron, chef apron, professional apron, server apron, grilling apron, restaurant apron, bakers apron, barista apron, butcher apron, artist apron Cook All Day In Comfort & Style Apron fits most sizes and is suitable for both men and women. It comes with additional long ties that can be wrapped and tied in front or back ensuring comfortably. 40\" Long Ties Comes with 40\" long ties, this chef apron can be easily altered to fit most sizes.All waist ties are professionally reinforced for longevity. Tearing from stitches or broken straps are a worry of the past. Read more Homsolver apron Homsolver apron Homsolver apron Waterproof apron Homsolver chef apron Necklace Adjust Adjust Adjust Adjust Adjust Material Polyester Cotton Demin Canvas Nylon Polyester Pockets Two big pockets Two big pockets Two big pockets None Two big pockets Tie long Two big pockets long long long Great For For professional and commercial use. Grill apron, barbecue apron, bbq apron, kitchen apron, cook apron, chef apron, professional apron, server apron, grilling apron, restaurant apron, bakers apron, barista apron, butcher apron, artist apron For professional and commercial use. Grill apron, barbecue apron, bbq apron, kitchen apron, cook apron, chef apron, professional apron, server apron, grilling apron, restaurant apron, bakers apron, barista apron, butcher apron, artist apron For professional and commercial use. Grill apron, barbecue apron, bbq apron, kitchen apron, cook apron, chef apron, professional apron, server apron, grilling apron, restaurant apron, bakers apron, barista apron, butcher apron, artist apron For professional and commercial use. Grill apron, barbecue apron, bbq apron, kitchen apron, cook apron, chef apron, professional apron, server apron, grilling apron, restaurant apron, bakers apron, barista apron, butcher apron, artist apron For professional and commercial use. Grill apron, barbecue apron, bbq apron, kitchen apron, cook apron, chef apron, professional apron, server apron, grilling apron, restaurant apron, bakers apron, barista apron, butcher apron, artist apron ","features":"{\"product_summary\": \"Adjustable Apron\", \"category\": \"kitchen\", \"material\": \"polyester\", \"functions\": {\"main_function\": \"protection\", \"additional_function_1\": \"storage\", \"additional_function_2\": \"comfort\"}, \"compatibility\": \"universal\", \"price\": 20, \"other_details\": \"durable\"}"}
{"docid":48,"title":"16 Pack Adjustable Mask Lanyard For Adults\/Kids - Handy & Convenient Safety Mask Holder & Hanger - Comfortable Around The Neck Facemask Rest & Ear Saver - No More Lost\/Dropped Masks 8 colours Red+blue","text":"Product Description packing: Each bag contains 16 face mask lanyards, 8 coloursit include:Red,rose, yellow, fluorescent green, blue, gray, orange, wine red. characteristic: ➤1. The rope is very light. You can hardly feel it when you wear it. ➤2. The movable buckle can freely adjust the length of the rope, so that adults and children and people of any age can adapt. Function Description: ✔1. The face mask lanyard can protect your mask from losing. ✔2. When you wear a mask conveniently at work and in normal social intercourse, when you don't need to wear a mask, you don't need to worry about folding it into your pocket or still on the table. ✔3. It is suitable for use with disposable mask or reusable mask, just clamp the elastic band of the mask with the clip at both ends of the rope. ✔4. When you consider the shortage of mask, this kind of face mask lanyard brings you perfect solution. Product Description packing: Each bag contains 16 face mask lanyards, 8 coloursit include:Red,rose, yellow, fluorescent green, blue, gray, orange, wine red. characteristic: ➤1. The rope is very light. You can hardly feel it when you wear it. ➤2. The movable buckle can freely adjust the length of the rope, so that adults and children and people of any age can adapt. Function Description: ✔1. The face mask lanyard can protect your mask from losing. ✔2. When you wear a mask conveniently at work and in normal social intercourse, when you don't need to wear a mask, you don't need to worry about folding it into your pocket or still on the table. ✔3. It is suitable for use with disposable mask or reusable mask, just clamp the elastic band of the mask with the clip at both ends of the rope. ✔4. When you consider the shortage of mask, this kind of face mask lanyard brings you perfect solution.","features":"{\"product_summary\": \"Adjustable Mask Lanyard\", \"category\": \"accessory\", \"material\": \"rope\", \"functions\": {\"main_function\": \"holder\", \"additional_function_1\": \"convenient\", \"additional_function_2\": \"ear saver\"}, \"compatibility\": \"adults\/kids\", \"price\": 15, \"other_details\": \"16 pack, 8 colours\"}"}
{"docid":49,"title":"ZORRI Sports Water Bottle, 400\/500\/700ml\/1L, BPA Free Leak Proof Tritan Lightweight Bottles for Outdoors,Camping,Cycling,Fitness,Gym,Yoga- Kids\/ Adults Drink Bottles with Filter, Lockable Pop Open Lid","text":"From the brand JOIN ZORRI ! Perfect Gift for the precious person in your life! Stay hydrated, Stylish & Healthy! Previous page 32OZ WATER BOTTLES & BRUSH Welcome to Zorri, home of the reusable water bottle that gives you an extra loving push to drink more water throughout the day. Whether you need Monday morning motivation or a mid-week Wednesday wind-down, you can count on your Zorri water bottle to get you to where you need to be hydrated and ready to rock\/jump! Fashionable multiple colors - sizes to choose for you and your family! 14oz \/ 17oz \/ 20oz \/ 24oz \/ 28oz \/ 32oz \/ 42oz Reusable Tritan & BPA Free 28OZ 32OZ 42OZ WATER BOTTLES Gift With Heart！ Hydrate in Style!! 32 oz Water Bottles Visit the Store GIFT FOR KIDS - 20OZ\/ 600ML Visit the Store Perfect Gift Idea! Each Zorri Water Bottles Come with a Cleaning Brush, Removable strainer, and Zorri Packaging Box！ 17OZ 24OZ 32OZ WATER BOTTLES Visit the Store KEEP HYDRATED OUTDOOR GEAR Visit the Store Keep Stylish On-the-Go! Next page Product Description ZORRI water bottle was Built for comfort, Healthy Human Curve and Sleek design gives you the look and style of glass\/steel while it maintains the feature of durability and lightweight, that makes holding and carrying your favorite beverages a pleasure go anywhere. The best gift for boys, girls, women and men. Colorful Frosted Popular Look & Perfect Sizes Designed for Kids 400ml-500ml-700ml-1000ml Dimenssion : Translucent Frosted Matte Colorful : Mint Green（light blue）\/ Blue\/ Navy\/ Moss Green\/ Pulple\/ Pink\/ Orange\/ Grey ( Translucent black）\/ Black （Opaque black ）\/ Green Capacity: 14oz-400ml, 17oz-500ml, 24oz-700ml, 32oz-1000ml Narrow Mouth Width: 20mm \/ 0.8 \" Mouth Width: 400ml & 500ml - 53mm\/2.1 \"； 700ml & 1000ml - 60mm\/2.36 \" Bottle Diameter: 400ml & 500ml - 68mm\/2.7 \"； 700ml & 1000ml - 80mm\/3.15 \" Bottle Height: 400ml-186mm; 500ml -223mm ;700ml - 229mm;1000ml- 288mm Product Weight: 400ml-120g; 500ml-167g; 700ml-212g; 1000ml-256gO Perating Temperature: -10 ℃ ~ 110 ℃ Each BPA-free water bottle from ZORRI is made to enhance your drink experience. That’s why our food-grade, safe plastic water bottles don’t impact taste, are made with shatter-resistant Tritan plastic, feature a leakproof lid with fast-flowing water drink spout, and boast a built-in lanyard strap so you can take it running, jogging, or up that next hill ！ 100% Leak Proof Secure Lock for the Lid & Leak and Dust Proof Design - to ensure better viability when taking them to work or the gym in your car or gym bag, respectively. This means a cleaner sip free of dirt and grime even if your adventure means getting a little dirty Superior Durability & Safe Material 100% BPA Free, BPS Free, Tritan Co-polyester plastic, Food Grade PP material lid, Food Grade Silicone seal ring. No more worrying about harmful chemicals such as BPA affecting your health, which are present in many water bottles.It mades of durable, resistant material is suitable for hot and cold drinks from -10 °C - 110 °C One-Touch Button Easy To Use Single Click Push Button Lid & Fast Flow Drinking Spout. The quick access, flip-top lid makes it simple to enjoy water from the fast-flowing drink spout with a single hand. Using sports bottle has never been as effortless. Simply click the button, the lid pops open, and enjoy. When you’re done, just snap it shut and carry on Comfortable Hand Feeling Silicone sleeve can be removed, provent your hand from heat (110℃) and cold (-10℃), to provide a more comfortable feel in your hand. And it is Anti-slip from any cup holder and,no worries about falling, perfect on the way or while playing sports Read more 400ml ZORRI 500ml ZORRI 700ml ZORRI 1000ml ZORRI 1000ml ZORRI 1200ml ZORRI Bottle Base (in) 2.70 \" 2.70'' 3.15 \" 3.15 \" 3.00'' 3.54‘’ Bottle Height (in) 7.32'' 8.78'' 9.01'' 10.34'' 11.00'' 11.26‘’ Fits Cupholders ✓ ✓ ✓ ✓ ✓ ✓ Spout Mouth (in） 0.8'' 0.8'' 0.8'' 0.8'' 0.98\" 0.98\" Bottle LightWeight ( oz) 4.23oz 5.89oz 7.48oz 9.03oz 6.63oz 6.27oz Available colors 10 10 10 10 9 6 Accessories Strainer, Bottle Box, Another Pair of Seal Rubber Plugs Strainer, Bottle Box, Sponge Bottle Brush, Another Pair of Seal Rubber Plugs Strainer, Bottle Box, Sponge Bottle Brush, Another Pair of Seal Rubber Plugs Strainer, Bottle Box, Sponge Bottle Brush,Another Pair of Seal Rubber Plugs Strainer, Bottle Box, Sponge Bottle Brush Strainer, Bottle Box, Sponge Bottle Brush Volume Measurements （Milliliter & Ounce） 380ml &14oz 500ml & 17oz 700ml & 24oz 1000ml & 36oz 600ml & 20oz 1200 & 42oz Material Tritan Co-polyester, PP 05, Food-grade Silicone, Dishwasher Safe Tritan Co-polyester, PP 05, Food-grade Silicone, Dishwasher Safe Tritan Co-polyester, PP 05, Food-grade Silicone, Dishwasher Safe Tritan Co-polyester, PP 05, Food-grade Silicone, Dishwasher Safe Tritan Co-polyester, PP 05, Food-grade Silicone, Dishwasher Safe Tritan Co-polyester, PP 05, Food-grade Silicone, Dishwasher Safe Cold & Hot Drinks ✓ ✓ ✓ ✓ ✓ ✓ Drinking has never been easier! It doesn’t matter if you’re hitting the mountain trails, tackling your daily Crossfit WOD or playing disc golf with friends at the park; staying hydrated can mean the difference between feeling great and accomplishing your goals and losing ground quickly. That’s why the ZORRI Sports Water Bottle holds the right amount of pure, crisp water to keep you going through even the most demanding parts of the day. Quick Access & One-Hand Operation 10 Available Colors Of 14oz\/ 17oz\/ 24oz\/ 32oz at ZORRI Convenient. only 1-click for easy access to your water. And the unique lock design prevent to unexpectedly leak. Distinctive patented design avoid your bottle same with other general product. Cleaner Drinking.Protective spout cover helps keep out gross dirt and germs. Its practical measure markings will remind you how much you drink up. (NOTE:except black colour because it is special colour) 100% BPA Free, Food grade silicone seal parts. (add alternative) Durable Lanyard for Easy Carrying Fast Water Flowing Spout No Peculiar Smell Read more ","features":"{\"product_summary\": \"ZORRI Water Bottle\", \"category\": \"outdoors\", \"material\": \"Tritan\", \"functions\": {\"main_function\": \"hydration\", \"additional_function_1\": \"leak-proof\", \"additional_function_2\": \"portable\"}, \"compatibility\": \"adults\", \"price\": 20, \"other_details\": \"BPA-free\"}"}
{"docid":51,"title":"YETI Rambler 20 oz Stainless Steel Vacuum Insulated Tumbler w\/MagSlider Lid","text":"Product Description RAMBLER 20 OZ TUMBLER WITH MAGSLIDER LID With the Rambler 20 oz. Tumbler, your beverages will stay ice cold or piping hot longer. We over-engineered these double-wall insulated tumblers with an 18\/8 stainless steel body, which means your drink still keeps its temperature no matter how much of a beating this cup takes. They’re BPA-free (obviously), have a No Sweat Design to make sure your hands stay dry, and are dishwasher-safe. Plus its crystal-clear lid lets you check your drink status in a flash. Refill, anyone? The YETI 20 oz Rambler Tumbler stands 6 7\/8 in high and has a lip diameter of 3 1\/2 in. All YETI Tumblers are sized to fit in standard sized cup holders. 18\/8 STAINLESS STEEL Made with kitchen-grade stainless steel, so they’re puncture- and rust-resistant. DOUBLE-WALL VACUUM INSULATION Keeps cold drinks cold and hot drinks hot until the last sip. NO SWEAT DESIGN Keeps fingers dry and unfrostbitten. MAGSLIDER LID The MagSlider Lid means enjoying a hot drink from our Rambler Tumblers without worrying about splashes on the go. Unlike other closeable drink lids, ours harness the power of magnets (yep, real magnets) for smooth opening and closing, and has a crystal clear lid so you can always see if you’re in need of a top off. Our magnet technology also makes for easy cleaning — you can pop the MagSlider off, rinse, dry, and return it to the YETI Slider Lid. And the MagSlider Lid is spill- and shatter-resistant, just like the rest of our Rambler accessories. Dishwasher-safe. Product Description RAMBLER 20 OZ TUMBLER WITH MAGSLIDER LID With the Rambler 20 oz. Tumbler, your beverages will stay ice cold or piping hot longer. We over-engineered these double-wall insulated tumblers with an 18\/8 stainless steel body, which means your drink still keeps its temperature no matter how much of a beating this cup takes. They’re BPA-free (obviously), have a No Sweat Design to make sure your hands stay dry, and are dishwasher-safe. Plus its crystal-clear lid lets you check your drink status in a flash. Refill, anyone? The YETI 20 oz Rambler Tumbler stands 6 7\/8 in high and has a lip diameter of 3 1\/2 in. All YETI Tumblers are sized to fit in standard sized cup holders. 18\/8 STAINLESS STEEL Made with kitchen-grade stainless steel, so they’re puncture- and rust-resistant. DOUBLE-WALL VACUUM INSULATION Keeps cold drinks cold and hot drinks hot until the last sip. NO SWEAT DESIGN Keeps fingers dry and unfrostbitten. MAGSLIDER LID The MagSlider Lid means enjoying a hot drink from our Rambler Tumblers without worrying about splashes on the go. Unlike other closeable drink lids, ours harness the power of magnets (yep, real magnets) for smooth opening and closing, and has a crystal clear lid so you can always see if you’re in need of a top off. Our magnet technology also makes for easy cleaning — you can pop the MagSlider off, rinse, dry, and return it to the YETI Slider Lid. And the MagSlider Lid is spill- and shatter-resistant, just like the rest of our Rambler accessories. Dishwasher-safe.From the brand Previous page Shop Nordic Purple Specials Visit the Store YETI Charcoal Collection Visit the Store In 2006, YETI Coolers was founded with a simple mission: build a cooler that you could use every day if it existed. One that was built for the serious outdoor enthusiast rather than for the mass-discount retailers. One that simply wouldn’t break. Today, YETI products perform when it matters most - whether that be an excursion into the Alaskan wilderness, chasing redfish on the Gulf coast, or just getting together with friends in the backyard. The YETI Crossroads Collection Visit the Store YETI Drinkware Best sellers Visit the Store YETI Cooler Best Sellers Visit the Store YETI Bottle Best Sellers Visit the Store YETI Gear Best Sellers Visit the Store YETI Pet Gear Visit the Store Next page Product Description DRINKWARE The YETI Rambler family is tough as hell, and will keep your drinks as cold (or hot) as science allows. With stainless steel construction, double-wall vacuum insulation, and No Sweat Design, they’re perfect for on-the-move adventures in the backcountry and long days on the water alike. Plus they’re dishwasher safe. From insulated Bottles and Tumblers to Mugs and Jugs, get the Rambler Drinkware that suits your next day out. DURACOAT COLORS Aptly named DuraCoat, the YETI powder coating is designed similarly to the products that these nature-inspired colors live on—undeniably rugged and able to withstand nearly everything you throw it in or at it. Not to mention, dishwasher safe so you can spend less time cleaning and more time chasing adventure outdoors. RAMBLER JR. 12 OZ KIDS BOTTLE Rambler Jr. is a small-and-mighty kids bottle over-engineered for your little wild ones. This 12 oz. powerhouse inherited double-wall vacuum insulation from its Rambler predecessors, carrying on the family legacy by locking in ice-cold water through backyard campouts and breaks between tag. HEAVY-DUTY HYDRATION Whenever you're spending time in the wild, having the right hydration on hand will help keep you at your best. The YETI Jugs and Bottles are built tough to keep cool in triple-digit heat and take a beating in the back of a truck, or whatever your day demands. Read more In 2006, we founded YETI Coolers with a simple mission: build the hard cooler we’d use every day. We've since expanded into other outdoor product categories, yet never given up on our mission to build products to improve your time in the wild. Product innovation and firsthand experience in the field continue to be our basis of expansion into designing ultra-durable and portable soft coolers, insulated drinkware, waterproof and everyday bags and backpacks, dog bowls and beds, and other outdoor gear, each with its own line of accessories. Every YETI product performs when it matters most—whether that be a trip into the remote Alaskan wilderness, chasing tarpon on the Florida coast, even just in the backyard with friends. ","features":"{\"product_summary\": \"YETI Rambler Tumbler\", \"category\": \"drinkware\", \"material\": \"stainless steel\", \"functions\": {\"main_function\": \"insulation\", \"additional_function_1\": \"durable\", \"additional_function_2\": \"leak-proof\"}, \"compatibility\": \"standard cup holders\", \"price\": 30, \"other_details\": \"dishwasher-safe\"}"}
{"docid":53,"title":"PUR CR1100CV Classic Water Filter Pitcher Filtration System, 11 Cup","text":"Product Description The PUR 11 Cup Water Filter Pitcher offers refreshing water quickly and easily. Each PUR water filter is certified to reduce mercury and certain industrial pollutants, as well as reducing chlorine (taste and odor) and more.ƚ The filter lasts up to 2 months and gives you 40 gallons (or 640 8oz cups) of great-tasting water. PUR’s superior filter technology uses activated carbon and ion exchange media and is certified to reduce 2x more contaminants than Brita’s leading water pitcher filter.*ƚ The PUR filtered water pitcher has a space-saving design that fits easily in the fridge, while the comfort-grip handle and easy-fill lid make it easy to use. A water filtration system is important because tap water may look clean but can contain potentially harmful contaminants from pipes. Compatible water filter replacements are not certified to offer the same water quality – genuine PUR Filters are the only filters certified for use in PUR systems. Using a PUR water filter system can save up to $1,000 per year on average compared with the cost of bottled water** and help keep plastic bottle waste out of landfills. Each replacement water filter provides 40 gallons of filtered water or up to 2 months of typical use. PUR has been developing innovative technologies for superior water filtration for over 30 years. We believe life deserves PUR water. Product Description The PUR 11 Cup Water Filter Pitcher offers refreshing water quickly and easily. Each PUR water filter is certified to reduce mercury and certain industrial pollutants, as well as reducing chlorine (taste and odor) and more.ƚ The filter lasts up to 2 months and gives you 40 gallons (or 640 8oz cups) of great-tasting water. PUR’s superior filter technology uses activated carbon and ion exchange media and is certified to reduce 2x more contaminants than Brita’s leading water pitcher filter.*ƚ The PUR filtered water pitcher has a space-saving design that fits easily in the fridge, while the comfort-grip handle and easy-fill lid make it easy to use. A water filtration system is important because tap water may look clean but can contain potentially harmful contaminants from pipes. Compatible water filter replacements are not certified to offer the same water quality – genuine PUR Filters are the only filters certified for use in PUR systems. Using a PUR water filter system can save up to $1,000 per year on average compared with the cost of bottled water** and help keep plastic bottle waste out of landfills. Each replacement water filter provides 40 gallons of filtered water or up to 2 months of typical use. PUR has been developing innovative technologies for superior water filtration for over 30 years. We believe life deserves PUR water.From the manufacturer A single PUR filter provides up to 40 gallons of filtered water – the equivalent of 303 single use plastic water bottles. Help keep plastic out of our oceans and the environment. Pair your PUR pitcher with your favorite reusable water bottle to ensure you have great-tasting water at the gym, in the office, or anywhere on the go! Using a PUR Pitcher is far more affordable than bottled water and can save up to one thousand dollars annually, while providing cleaner, great-tasting filtered water. *Based on comparing a year’s worth of bottled water (16.9 oz) to a PUR system and a year’s worth of refills. Based on Nielsen US Scantrack sales. Read more PUR Genuine Filter FM3700 PPT711BA PPT111WAMA PPF951K PPF951K3 ✓ ✓ ✓ ✓ ✓ ✓ ","features":"{\"product_summary\": \"Water Filter Pitcher\", \"category\": \"kitchen\", \"material\": \"plastic\", \"functions\": {\"main_function\": \"filtration\", \"additional_function_1\": \"refreshing\", \"additional_function_2\": \"space-saving\"}, \"compatibility\": \"PUR systems\", \"price\": 25, \"other_details\": \"certified\"}"}
{"docid":54,"title":"GKOLED 12 Inch LED Hardscape Lighting, Low Voltage Retaining Wall Lights, LED Paver Step Light, 4W 12V AC\/DC, 22pcs LED Chips, 2700K Warm White (4-Pack)","text":"From the brand Previous page Providing High Quality LED Lighting Solutions Since 2017. Our residential LED products come in classic styles that are aim to enhance the atmosphere and appeal of your home and garden, letting your important moments more wonderful. We strive to make every lighting project smooth and successful, and hope that you will love the quality of our lights. Check out our other products here! Deck Light Visit the Store Step Light Visit the Store Path Light Visit the Store Hardscape Light Visit the Store Next page Product Description Product Information Featuring 22 2700K LED chips that ensure even and comfortable light distribution, GKOLED Hardscape Lights can be used to provide subtle entrance and perimeter lighting and are suitable for both commercial and residential applications. These fixtures feature a low-profile design with a die-cast aluminum housing and a durable powder-coat finish that prevents weathering and corrosion. A stainless steel mounting bracket and mounting hardware are included with the light. Please note that these are low-voltage lights, a low voltage transformer (not included) is required. These lights may not be used with 120V or higher line voltage, and doing so will damage the lights. Quality You Can Count On We stand behind the quality of our lights – just check out our reviews and shop with confidence. Our products are stocked in the US. We look forward to making your next outdoor lighting project a success! Read more Product Specifications Size (Without Bracket) 12.00\"L x 0.79\"W x 0.77\"H Size (With Bracket) 12.00\"L x 3.07\"W x 0.77\"H Materials Die-cast aluminum (housing), stainless steel (mounting bracket) Finish Powder-coated dark bronze Accessories 1 stainless steel mounting bracket, 36\" pre-wired SPT-2 18AWG leads, 2 screws, 2 expansion anchors Power 4W Input Voltage 12V AC\/DC Output 300lm Color Temperature 2700K Color Rendering Index >80 GKOLED Low Voltage LED Square Deck Lights (2-Pack) GKOLED Low Voltage LED Oval Riser Step Lights (2-Pack) GKOLED App Control RGBW Flood Light (2 Pack) GKOLED Low Voltage Rectangle LED Deck Lights（6-Pack) GKOLED Black Low Voltage LED GKOLED Deck Light (6-Pack) GKOLED Aluminum LED Low Voltage Step Light (2-Pack) Lumen Output 100 Lm 40 Lm Max. 2000 Lm, Dimmable 30 Lm 30 Lm 80 Lm Voltage 9-15V AC\/DC 9-15V AC\/DC 120V AC 12V AC\/DC 12V AC\/DC 12-24V AC\/DC Color Temperature 3000 K 2700 K 3000 K & 6000 K & RGB 2700 K 2700 K 2700 K Power 3 W 2 W 20 W 2 W 2 W 3 W GKOLED Solar Flag Pole Light with Remote Control GKOLED Mini Brass Spot Light MR8 GKOLED Brass Low Voltage Landscape Spotlight with MR16 Bulb GKOLED 6.8 Inches LED Hardscape Lights (20-Pack) GKOLED 4 Inches LED Hardscape Lights (4-Pack) GKOLED 120W Low Voltage Tranformer Power Solar 3 W 5 W 4 W 2 W 120 W Lumen Output 300 Lm 180 Lm 400 Lm 300 Lm 120 Lm \/ Color Temperature 3000 K 2700 K 2700 K 2700 K 2700 K \/ Input Voltage \/ 12V AC\/DC 12V AC\/DC 12V AC\/DC 12V AC\/DC 120V AC Main Material Plastic Brass Brass Die-cast Aluminum Die-cast Aluminum Steel GKOLED 6.8 Inches LED Hardscape Lights, Gray (1-Pack) GKOLED 6.8 Inches LED Hardscape Lights with Frosted Lens, Gray (1-Pack) GKOLED 6.8 Inches LED Hardscape Lights, Gray (10-Pack) GKOLED 6.8 Inches LED Hardscape Lights with Frosted Lens, Gray (20-Pack) GKOLED 6.8 Inches LED Hardscape Lights, Gray (20-Pack) GKOLED 300W Low Voltage Tranformer Quantity of LED Chips 22 22 22 22 22 \/ Lumen Output 300 Lm 300 Lm 300 Lm 300 Lm 300 Lm \/ Power 4 W 4 W 4 W 4 W 4 W 300 W Color Temperature 2700 K 2700 K 2700 K 2700 K 2700 K \/ Input Voltage 12V AC\/DC 12V AC\/DC 12V AC\/DC 12V AC\/DC 12V AC\/DC 120V AC ","features":"{\"product_summary\": \"LED Hardscape Light\", \"category\": \"lighting\", \"material\": \"aluminum\", \"functions\": {\"main_function\": \"illumination\", \"additional_function_1\": \"enhancement\", \"additional_function_2\": \"weatherproof\"}, \"compatibility\": \"residential\/commercial\", \"price\": 100, \"other_details\": \"low-voltage\"}"}
{"docid":55,"title":"Paper Clever Party Unicorn Diaper Raffle Tickets - Baby Shower Games Girls – Star and Moon Invitation Insert Cards Pink - Guests Fill-In to Win Prize Drawings (25 Pack) Size 2x4","text":"Product Description Announcing the upcoming baby shower game drawing is simple with this pack of Unicorn diaper raffle insert cards. Our Unicorn diaper raffle inserts will get the baby shower started. Perfectly pair with your favorite 4x6, 5x7 or any size baby shower invitations and envelopes. Help mommy and daddy feel extra special and loved as they receive those much-needed diapers for baby shower. Guests will love the chance to win a baby shower game prize during the raffle drawing. A win, win. ABOUT THE PRODUCT Unicorn Baby Shower Diaper Raffle Tickets 25 Invitation Insert Card Pack 2x4 Size Baby Shower Games for Drawing Prizes Unicorn baby shower game design is printed on thick, premium 120lb. cardstock paper, unlike the flimsy 80lb or 90lb. card stock diaper raffle cards. HOSTESS TIP: be sure to save some diaper raffle tickets to hand out at the baby shower for guests who forgot their cards or brought multiple packs of diapers for the baby shower raffle game. Easy, simple, and done! Diaper raffle game for baby shower is perfect to help your guests have the best time. Paper Clever Party diaper raffle cards are designed and printed in the USA. Be sure to look for other matching items in our Unicorn baby shower collection to make girls baby shower party extra special. Product Description Announcing the upcoming baby shower game drawing is simple with this pack of Unicorn diaper raffle insert cards. Our Unicorn diaper raffle inserts will get the baby shower started. Perfectly pair with your favorite 4x6, 5x7 or any size baby shower invitations and envelopes. Help mommy and daddy feel extra special and loved as they receive those much-needed diapers for baby shower. Guests will love the chance to win a baby shower game prize during the raffle drawing. A win, win. ABOUT THE PRODUCT Unicorn Baby Shower Diaper Raffle Tickets 25 Invitation Insert Card Pack 2x4 Size Baby Shower Games for Drawing Prizes Unicorn baby shower game design is printed on thick, premium 120lb. cardstock paper, unlike the flimsy 80lb or 90lb. card stock diaper raffle cards. HOSTESS TIP: be sure to save some diaper raffle tickets to hand out at the baby shower for guests who forgot their cards or brought multiple packs of diapers for the baby shower raffle game. Easy, simple, and done! Diaper raffle game for baby shower is perfect to help your guests have the best time. Paper Clever Party diaper raffle cards are designed and printed in the USA. Be sure to look for other matching items in our Unicorn baby shower collection to make girls baby shower party extra special.","features":"{\"product_summary\": \"Unicorn Diaper Raffle Tickets\", \"category\": \"party\", \"material\": \"paper\", \"functions\": {\"main_function\": \"raffle\", \"additional_function_1\": \"game\", \"additional_function_2\": \"insert\"}, \"compatibility\": \"baby shower invitations\", \"price\": 15, \"other_details\": \"USA printed\"}"}
{"docid":56,"title":"SHEKINI Women Floral Lace Bra Padded Breathable Bralette Halter Bra Wire Free Racerback Bra","text":"From the brand Floral Lace Bralette SHEKINI always cares your comfort and focuses on digging out your beauty. Previous page Lace Bralette Front Closure Visit the Store Cami Lace Bralette Visit the Store More Style Bralette Visit the Store SHEKINI'S Best Sellers Front clasp lightweight bralette with the ability of perfectly beautifying your back. Next page Product Description SHEKINI FASHIONABLE Wirefree Floral Lace Bra Tank Top Pullover Style This top bra of women's lace underwear is perfect for t-shirts, tanks and suitable for any occasion. Extra lace hem help keep a secure and snug fit for you. Criss cross on back design obviously beautify your back, and show your charming shoulder blade. Previous page Deep V-neck and lace longline design gives beautiful outlook. Show more seductive. Easy to take out or put in when have a washing or replacing. Widen straps for finding a secure fit and providing a moderate of support. Next page 1 Exquisite Lace Design 2 Lacy Trim 3 Removable Inner Pads 4 Stretchy Shoulder Straps DETAILS SHOW BUYERS' SHOW Size Recommendation: S : 32B 32C 34A M : 34B 34C 36A L : 36B 36C 38A XL :38B 38C 40A XXL : 40B 40C 42A LEARN MORE BRALETTE BRALETTE BRALETTE BRALETTE BRALETTE BRALETTE BRALETTE FEATURE PULL-ON HOOK&EYES CLOSURE HOOK&EYES CLOSURE FRONT CLASP BACK CLASP FRONT CLASP HOOK&EYES CLOSURE WIREFREE ✔ ✔ ✔ ✔ ✔ ✔ ✔ MULTIPLE COLORS OPTIONAL ✔ ✔ ✔ ✔ ✔ ✔ ✔ SIZE RANGE S-M-L-XL-XXL S-M-L-XL S-M-L-XL S-M-L-XL-XXL S-M-L-XL S-M-L-XL S-M-L-XL ADJUSTABLE STRAPS ✘ ✘ ✔ ✔ ✘ ✔ ✔ ","features":"{\"product_summary\": \"Lace Bra\", \"category\": \"lingerie\", \"material\": \"lace\", \"functions\": {\"main_function\": \"support\", \"additional_function_1\": \"breathable\", \"additional_function_2\": \"padded\"}, \"compatibility\": \"women\", \"price\": 25, \"other_details\": \"wire-free\"}"}
{"docid":58,"title":"Universal Hard Saddle Bags Detachable Mounting Brackets Compatible with 8mm Mounting Holes Quick Release","text":"Product Description Read more Read more Adaption Fits most bike like Harley Yamaha Honda Suzuki Kawasaki that Fender bolts range from 3\"-8.5\" with 8mm mounting holes. Read more Feature This Detachable Mounting Bracket (A Pair) Allows You Easy To Detach The Bags For The Clean Looks Flexible Mounting Pattern That Allows You Positions The Bags The Way You Wanted. Install By Removing Two Bolts From Your Fender And Replacing The Two Bolts With The Detachable Docking Kit That We Provide With The Item. Completely Adjustable System Allows You To Place Your Bags Exactly Where You Want Them On The Bike. Fast Installation And Removal, No Tools Required To Remove Your Saddlebags. Your Bike Keeps A Show Room Look While The Bags Are Off. Docking Receivers For Attaching To The Fender Rails. Rubber Grommets To Prevent Stress Top Quality Design And Fabricaton With Attention To Every Detail For A Superior Product. Secure Lockable To Keep Your Luggage Safe. Read more Read more ","features":"{\"product_summary\": \"Saddlebags\", \"category\": \"accessories\", \"material\": \"metal\", \"functions\": {\"main_function\": \"detachable\", \"additional_function_1\": \"adjustable\", \"additional_function_2\": \"lockable\"}, \"compatibility\": \"universal\", \"price\": 150, \"other_details\": \"quick-release\"}"}
{"docid":60,"title":"Simple Joys by Carter's Toddlers and Baby Girls' Snug-Fit Footless Cotton Pajamas, Pack of 3","text":"Product Description These footless 1-piece pajamas take them from nap time to play time in no time! includes 3. Product Description These footless 1-piece pajamas take them from nap time to play time in no time! includes 3.From the brand easy looks for endless fun Everyday styles for busy little bodies simplified. From adventurous playdates to cozy days indoors, shop effortless outfits and basics. Previous page stock up on cute basics Visit the Store holiday pjs for sweet dreams Visit the Store snuggle up in warm winter gear Visit the Store ready, set, play in easy sets Visit the Store Next page From the manufacturer ","features":"{\"product_summary\": \"Footless Pajamas\", \"category\": \"clothing\", \"material\": \"cotton\", \"functions\": {\"main_function\": \"comfort\", \"additional_function_1\": \"play\", \"additional_function_2\": \"nap\"}, \"compatibility\": \"toddlers, baby girls\", \"price\": 25, \"other_details\": \"pack of 3\"}"}
{"docid":61,"title":"STEP 1 Shoe Stretchers, 1 Pair, Relieve Callus, Corn, Hammertoe, & Bunion Discomfort","text":"Product Description STEP 1 offers a wide array of shoe \"hacks\" to help you walk, run, dance or srtut in your favorite shoes without pain. Find a wide array of products that provide unique solutions to any shoe issue. Find comfort & pain relief for your feet with Step 1. Product Description STEP 1 offers a wide array of shoe \"hacks\" to help you walk, run, dance or srtut in your favorite shoes without pain. Find a wide array of products that provide unique solutions to any shoe issue. Find comfort & pain relief for your feet with Step 1.","features":"{\"product_summary\": \"Shoe Stretchers\", \"category\": \"footwear\", \"material\": \"plastic\", \"functions\": {\"main_function\": \"stretching\", \"additional_function_1\": \"relieve\", \"additional_function_2\": \"comfort\"}, \"compatibility\": \"shoes\", \"price\": 20, \"other_details\": \"pair\"}"}
{"docid":62,"title":"Bloccs Waterproof Cast Protector for Shower Arm - #CFA73-XS - Child Full Arm - (Extra Small)","text":"Product Description Child Short Arm Adult Short Arm Adult Full Arm Adult Elbow Cover Child Elbow Cover Category Suitable for below the elbow casts and dressings Suitable for below the elbow casts and dressings Suitable for above the elbow casts and dressings Suitable for PICC lines and elbow dressings Suitable for PICC lines and elbow dressings Size Available in sizes S, M and L One size One size Available in sizes S, M and L Available in sizes XS, S, M and L ","features":"{\"product_summary\": \"Waterproof Cast Protector\", \"category\": \"medical\", \"material\": \"plastic\", \"functions\": {\"main_function\": \"protect\", \"additional_function_1\": \"waterproof\", \"additional_function_2\": \"cover\"}, \"compatibility\": \"arm\", \"price\": 20, \"other_details\": \"sizes\"}"}
{"docid":68,"title":"PinkSheep Little Girl Jewel Rings in Box, Adjustable, No Duplication, Girl Pretend Play and Dress Up Rings (24 Surface Ring)","text":"Product Description Read more Read more ","features":"{\"product_summary\": \"Jewel Rings\", \"category\": \"toys\", \"material\": \"plastic\", \"functions\": {\"main_function\": \"pretend\", \"additional_function_1\": \"dress-up\"}, \"compatibility\": \"girls\", \"price\": 15, \"other_details\": \"adjustable\"}"}
{"docid":69,"title":"Makeup Cosmetic Bags - Stars Can't Shine Without Darkness - Funny Cotton Zipper Pouch Travel Bag Toiletry Make-Up Case for Women Stoner Friend Sister Bestie Valentine's Day Birthday Gifts","text":"Product Description Cokosoxo Portable Travel Makeup Cosmetic Bag - It’s a wonderful gift for your daily use or travel!! Features: Professional Design Each cosmetic bag is designed by a professional designer. Interesting and lovely patterns that highlight your personal character and taste. A variety of patterns and themes, I believe there is always a suitable for you or your friends. It's really a special and attractive gift! Easy to pack and carry Whenever you go out, you will bring a lot of things, this lightweight cosmetic bags will help you solve this problem. It’s easy to store and organize your cosmetics and small daily items such as keys, cards, mobile phones and so on. Practical and useful. Widely Use, Great gift Ideal for travel, vacation, business trip, gym, camping, bathroom organization and outdoor activity, not only it is a simple zipper bag, also it is a functional makeup bag, cosmetic bag, travel organizer bag. Specification: Name: Cokosoxo makeup cosmetic bag Color: As the pictures shown. Material: 100% cotton burlap Size: 19 * 25cm Package Including: Travel Makeup Bag *1 If you like this unique cosmetic bag, click the shopping cart immediately. Believe me, you will definitely be deeply attracted by him! Product Description Cokosoxo Portable Travel Makeup Cosmetic Bag - It’s a wonderful gift for your daily use or travel!! Features: Professional Design Each cosmetic bag is designed by a professional designer. Interesting and lovely patterns that highlight your personal character and taste. A variety of patterns and themes, I believe there is always a suitable for you or your friends. It's really a special and attractive gift! Easy to pack and carry Whenever you go out, you will bring a lot of things, this lightweight cosmetic bags will help you solve this problem. It’s easy to store and organize your cosmetics and small daily items such as keys, cards, mobile phones and so on. Practical and useful. Widely Use, Great gift Ideal for travel, vacation, business trip, gym, camping, bathroom organization and outdoor activity, not only it is a simple zipper bag, also it is a functional makeup bag, cosmetic bag, travel organizer bag. Specification: Name: Cokosoxo makeup cosmetic bag Color: As the pictures shown. Material: 100% cotton burlap Size: 19 * 25cm Package Including: Travel Makeup Bag *1 If you like this unique cosmetic bag, click the shopping cart immediately. Believe me, you will definitely be deeply attracted by him!","features":"{\"product_summary\": \"Makeup Bag\", \"category\": \"travel\", \"material\": \"cotton\", \"functions\": {\"main_function\": \"organize\", \"additional_function_1\": \"store\", \"additional_function_2\": \"carry\"}, \"compatibility\": \"cosmetics\", \"price\": 15, \"other_details\": \"portable\"}"}
{"docid":72,"title":"Five Star Advance Spiral Notebooks, 3-Subject, College Ruled Paper, 11\" x 8-1\/2\", 150 Sheets, With Spiral Guard and Movable Dividers, Red (73134)","text":"Product Description LASTS ALL YEAR. GUARANTEED!* Take your notes to the next level of organization and durability with Five Star Advance. Compatible with the Five Star study app, you can easily scan, study and organize notes on your phone! Create instant digital flashcards and sync notes to Google Drive and access them anywhere from any device. Rearrange the movable plastic dividers anywhere in your notebook to organize notes. Dividers with expanding pockets hold 8-1\/2\" x 11\" handouts. Visible tabs from front cover make it easy to flip to any section. 3 subject notebook has 150 double-sided, college ruled sheets that are perforated so edges stay clean. Sheets measure 8-1\/2\" x 11\" when torn out. Spiral Guard covers the wire to help prevent coil snags on clothes and backpacks. Label your notebook on the writable spine, and keep your favorite pen or pencil handy in the pen loop. Available in Fire Red. *Guarantee is valid for one year from purchase date. Does not cover misuse. Product Description LASTS ALL YEAR. GUARANTEED!* Take your notes to the next level of organization and durability with Five Star Advance. Compatible with the Five Star study app, you can easily scan, study and organize notes on your phone! Create instant digital flashcards and sync notes to Google Drive and access them anywhere from any device. Rearrange the movable plastic dividers anywhere in your notebook to organize notes. Dividers with expanding pockets hold 8-1\/2\" x 11\" handouts. Visible tabs from front cover make it easy to flip to any section. 3 subject notebook has 150 double-sided, college ruled sheets that are perforated so edges stay clean. Sheets measure 8-1\/2\" x 11\" when torn out. Spiral Guard covers the wire to help prevent coil snags on clothes and backpacks. Label your notebook on the writable spine, and keep your favorite pen or pencil handy in the pen loop. Available in Fire Red. *Guarantee is valid for one year from purchase date. Does not cover misuse.From the manufacturer Built Strong to Last Long Gear up for a strong year with Five Star notebooks, folders, binders and more. We strive to provide high-quality, durable products to empower students to succeed throughout the school year. While school can be challenging and stressful at times, with the right tools, you can take on anything. Five Star Advance Spiral Notebook The Five Star Advance Notebook is all you’ll need to organize your busy day. Movable, tabbed dividers are color-coded so you can organize by subject or topic and quickly flip to the section you created. Instead of having to carry a separate folder, each plastic divider has expanding pockets to hold all your hand-outs. There’s even a pen loop built right in to the cover and a writable label so it’s easy to label your notebook. All these features make the Five Star Advance Notebook truly advanced. Movable plastic dividers with expanding pockets Plastic front and back covers Color-coded tabs on each divider Fabric Spiral Guard covers the wire Writable spine label and pen loop on cover Read more Color-Coded Tabs on Dividers It’s easy to color-code by subject with the colored tabs on each divider. The tabs are always visible from the front cover of the notebook so you can quickly flip to the section you’re looking for. Writable Spine Label. Pen Loop. Label your notebook on the spine’s writable label so you can quickly find it in your locker. And there’s no need to shuffle through your backpack to find a writing utensil. The convenient pen loop on the cover keeps your favorite pen or pencil handy. Movable Dividers. Expanding Pockets. The movable dividers let you separate work by subject or topic to organize the notebook your way. Each of the 5 dividers has 2 expanding pockets to hold plenty of hand-outs. That’s 10 pockets! Durable Plastic Covers Five Star Advance Notebook features plastic front and back covers that provide security and durability all year long. Write easily with the notebook fully opened or folded back on itself. Read more  ","features":"{\"product_summary\": \"Notebook\", \"category\": \"Stationery\", \"material\": \"Plastic\", \"functions\": {\"main_function\": \"Organize\", \"additional_function_1\": \"Scan\", \"additional_function_2\": \"Sync\"}, \"compatibility\": \"Five Star study app\", \"price\": 15, \"other_details\": \"Durable\"}"}
{"docid":73,"title":"SOLOYEE Newborn Baby Girl Clothes Infant Girls Romper Ruffled Solid Long Sleeve Jumpsuit 0-18M Baby Outfits","text":"Product Description ","features":"{\"product_summary\": \"Baby Romper\", \"category\": \"clothing\", \"material\": \"cotton\", \"functions\": {\"main_function\": \"clothing\", \"additional_function_1\": \"comfort\", \"additional_function_2\": \"style\"}, \"compatibility\": \"Newborn to 18 months\", \"price\": 20, \"other_details\": \"Ruffled design\"}"}
{"docid":74,"title":"sublue WhiteShark Mix Underwater Scooter Dual Propellers with Camera Mount for Scuba Diving Snorkeling (US Version)","text":"From the brand Previous page PADDLE BOARD POWER KIT Visit the Store Sublue Bundle Visit the Store battery Visit the Store Sublue , We are determined to create a new lifestyle of exploring the underwater worlds. Sublue redefine enjoyment with over 190 technical patents supported for life adventures, travelers and environmentalists. Next page Product Description Previous page Next page 1 Enjoy it In The Pool 2 Fun for Entire Family 3 30mins Battery Life The Dual-Motor Underwater Scooter Whiteshark Mix, Level up your underwater experience and glide through the water with the world's smallest Sublue WhiteShark Mix Underwater scooter. This revolutionary lightweight, hand-held propulsion device consists of two evenly equipped propellers on both sides that provide up to a total of 17.6 lbs of thrust. Simply grab the handles, squeeze the triggers, and off you go! Previous page Next page ","features":"{\"product_summary\": \"Underwater Scooter\", \"category\": \"Water\", \"material\": \"Plastic\", \"functions\": {\"main_function\": \"Propulsion\", \"additional_function_1\": \"Exploration\", \"additional_function_2\": \"Photography\"}, \"compatibility\": \"Scuba Diving, Snorkeling\", \"price\": 800, \"other_details\": \"Portable\"}"}
{"docid":75,"title":"EARTHALL Grey and White Striped Rug Outdoor 3'x5', Cotton Hand-Woven Gray Striped Door Mat, Reversible Foldable Washable Gray Outdoor Rug Stripe for Layered Door Mats Porch\/Front Door (35.4''x59'')","text":"From the brand Previous page Home Storage Boho Tribal Area Rug Laundry Room Rug Absorbent Bath Rug Kitchen Mat Cushioned Upgraded Doormat Rug Boho Diamond Area Rug Upgraded Boho Rug Buffalo Plaid Rug Black and White Striped Rug EARTHALL Bathroom Rug Next page Product Description EARTHALL is your best choice for Home Décor & Kitchen Products on Marketplace. We are specialized in home & kitchen products for many years, your life will be different since we met. CLASSIC DESIGN The area rug designed with classic pattern, multicolor easy matched with your other home décor MULTI-SIZE The buffalo plaid multisize rugs are great for your home, offer you a farmhouse style COTTON MATERIAL Cotton rugs offer a great feel and warmth. Absorbs water efficiently and is very soft EASY TO CLEAN Jut put it in a mesh laundry bag, then toss into the washer, cold water, gentle cycle, and tumble dry low heat Read more Perfect For Different Occasion You Want! Bathroom Rug (2'x3') Keep your feet from cold and hard floor. A non slip rug pad is needed Frontdoor Rug (2.3'x3.6') Make your home more inviting with this bold striped cotton rug Frontdoor Rug (2.3'x3.6') Put under doormat. Stylish layering. An easy update to the front porch Bedroom Rug (2'x4.3') Keep your feet from cold and hard floor. Look more cozy in bedroom Read more Laundry Room (2'x4.3') Colors are vibrant and it is well made. A non slip rug pad is needed when use on hard floor Hallway Runner (2'x6') Protect your floors from wear and tear at hallway area which receives plenty of traffic Kitchen Floor Rug (3'x5') Keep your floor from dripping waters and stains, make your kitchen floor clean and dry Read more Living Room Rug (4'x6') Protect your living room wood floor and babies or pets can playing in it Dining Room Rug (5'x7') Absorb dirt and water, keep your floor clean and dry Patio Rug (5.5'x7.5') Fit for your patio, hot style. You can enjoy the sunshine at any time Read more Buffalo Plaid Rug Laundry Room Rug Plaid Kitchen Mat Geometric Runner Rug Elegant Woven Rug Modern Bath Mat Material Cotton Nylon, Rubber Polypropylene Cotton Cotton Microfibre Non-slip ✓ ✓ ✓ Machine Washable ✓ ✓ ✓ ✓ Versatile Usage Scenarios Front Door\/ Kitchen\/ Patio\/ Porch Laundry Room \/Kitchen \/Bathroom Front Door\/ Kitchen\/ Garage\/ Patio\/ Porch Front Door\/ Kitchen\/ Garage\/ Patio\/ Porch Front Door\/ Kitchen\/ Garage\/ Patio\/ Porch Front Door\/ Kitchen\/ Garage\/ Patio\/ Porch ","features":"{\"product_summary\": \"Gray Striped Rug\", \"category\": \"rug\", \"material\": \"cotton\", \"functions\": {\"main_function\": \"decor\", \"additional_function_1\": \"absorbent\", \"additional_function_2\": \"reversible\"}, \"compatibility\": \"indoor\/outdoor\", \"price\": 50, \"other_details\": \"washable\"}"}
{"docid":79,"title":"LEE Women's Sculpting Slim Fit Slim Leg Pull-On Pant","text":"Product Description Just like our founder, H.D. Lee, our passion is helping can-do people do more. We are committed to designing clothing that conforms to your body, allowing you to move through life freely. We help you chase the things that bring you joy and laughter. The things that make you fearless and hopefully because your passion is what makes you unique. And what moves you, moves us. Move your Lee. Closure Type: Faux-Fly Product Description Just like our founder, H.D. Lee, our passion is helping can-do people do more. We are committed to designing clothing that conforms to your body, allowing you to move through life freely. We help you chase the things that bring you joy and laughter. The things that make you fearless and hopefully because your passion is what makes you unique. And what moves you, moves us. Move your Lee. Closure Type: Faux-FlyFrom the manufacturer Read more Read more LEE Women's Sculpting Slim Fit Skinny Leg Pull on Jean LEE Women's Sculpting Slim Fit Skinny Leg Jean LEE Women's Instantly Slims Classic Relaxed Fit Monroe Straight Leg Jean LEE Women's Flex Motion Regular Fit Bootcut Jean LEE Women's Relaxed Fit Straight Leg Jean Description Ultra-slim cut hugs your body close from hips to ankles. Guaranteed to turn a few heads. Sleek and slim lines smooth your body from waist to ankle. The haters are definitely gonna hate these. Flattering, clean lines fit close from hips through thighs and finish with a straight leg. A true, class act. Curve hugging from hips through thighs with a slight flare at the bottom to make room for those fabulous new boots. This classic, comfortable look gives a little extra room without being baggy, perfect for your most chill days. ","features":"{\"product_summary\": \"LEE Sculpting Pant\", \"category\": \"clothing\", \"material\": \"cotton\", \"functions\": {\"main_function\": \"slim\", \"additional_function_1\": \"comfortable\", \"additional_function_2\": \"flattering\"}, \"compatibility\": \"women\", \"price\": 40, \"other_details\": \"pull-on design\"}"}
{"docid":80,"title":"amFilm Glass Screen Protector for LG G7 ThinQ, Dot Matrix, 2 Pack (Black)","text":"Product Description Introducing amFilm Bye-Bye Bubble Tempered GLASS Screen Protectors for your LG G7 ThinQ. NOTE ：This screen protector is designed to offer full coverage of LG G7 ThinQ. We have designed this protector to be compatible with most phone cases; however, if your case reaches far onto the display, there may be some compatibility issues resulting in breakage of the protector, or sensitivity loss. Due to curved edges of LG G7 ThinQ, traditional full screen glass screen protectors will generate huge halo effects on the edges. We have developed a Dot Matrix glass screen for LG G7 ThinQ, which offers full screen protection without any bubbles or halo effects. This is accomplished with state of the art technology by placing hundreds of microscopic transparent dots on the screen protector to mimic the contact of your finger on the screen. Highly durable and scratch resistant\/chip resistant, this strong 9H (hardness level) protector will guarantee your cell phone the best protection against drops, bumps, scratches and normal wear and tear. Features Full Screen Coverage Bubble Free Guaranteed No Halo Effect on the Edges Case Friendly Works with: LG G7 ThinQ Kit Contains: 2x GLASS Screen Protector, Wet\/Dry Wipe, Cleaning Cloth, Dust Removal Stickers, Installation Use Guide Color: Black Easy Application: GLASS Screen Protectors are comprised of 2 layers - one protective film layer and the actual GLASS screen protector. Please use the sticker (tab) as a handle to grasp and fully remove this protective, plastic film layer before application. Warranty: 30-Day Money Back Guarantee Lifetime Warranty Warranty applies to the purchased product. Restrictions may apply. Product Description Introducing amFilm Bye-Bye Bubble Tempered GLASS Screen Protectors for your LG G7 ThinQ. NOTE ：This screen protector is designed to offer full coverage of LG G7 ThinQ. We have designed this protector to be compatible with most phone cases; however, if your case reaches far onto the display, there may be some compatibility issues resulting in breakage of the protector, or sensitivity loss. Due to curved edges of LG G7 ThinQ, traditional full screen glass screen protectors will generate huge halo effects on the edges. We have developed a Dot Matrix glass screen for LG G7 ThinQ, which offers full screen protection without any bubbles or halo effects. This is accomplished with state of the art technology by placing hundreds of microscopic transparent dots on the screen protector to mimic the contact of your finger on the screen. Highly durable and scratch resistant\/chip resistant, this strong 9H (hardness level) protector will guarantee your cell phone the best protection against drops, bumps, scratches and normal wear and tear. Features Full Screen Coverage Bubble Free Guaranteed No Halo Effect on the Edges Case Friendly Works with: LG G7 ThinQ Kit Contains: 2x GLASS Screen Protector, Wet\/Dry Wipe, Cleaning Cloth, Dust Removal Stickers, Installation Use Guide Color: Black Easy Application: GLASS Screen Protectors are comprised of 2 layers - one protective film layer and the actual GLASS screen protector. Please use the sticker (tab) as a handle to grasp and fully remove this protective, plastic film layer before application. Warranty: 30-Day Money Back Guarantee Lifetime Warranty Warranty applies to the purchased product. Restrictions may apply.From the brand Previous page amFilm was established in 2012, and through a decade of continual development and unparalleled customer support, we have earned the trust of over 10 Million customers. Released for iPhone 14 Series iPhone 14 with Lens Protector iPhone 14 Privacy Protection Why choose us? Quality products are not just a slogan but a belief. Every product amFilm releases has undergone rigorous quality testing to provide the end user with a top quality experience. Customer first Your satisfaction is our primary goal. Our professional service team will provide you with the best service and solutions within 24 hours to any problems that may ever arise. Your satisfaction is our ONLY pursuit! Next page   ","features":"{\"product_summary\": \"Screen Protector\", \"category\": \"mobile\", \"material\": \"glass\", \"functions\": {\"main_function\": \"protection\", \"additional_function_1\": \"bubble-free\", \"additional_function_2\": \"case-friendly\"}, \"compatibility\": \"LG G7 ThinQ\", \"price\": 20, \"other_details\": \"Dot Matrix, 2 Pack (Black)\"}"}
{"docid":82,"title":"Condor Tool & Knife, Otzi Knife","text":"Product Description 5.5\" overall. 2.25\" hand forged 1095HC steel blade. American Hickory handle with recessed wire wrapping. Brown leather belt sheath. Boxed. Product Description 5.5\" overall. 2.25\" hand forged 1095HC steel blade. American Hickory handle with recessed wire wrapping. Brown leather belt sheath. Boxed.","features":"{\"product_summary\": \"Condor Otzi Knife\", \"category\": \"outdoor\", \"material\": \"steel\", \"functions\": {\"main_function\": \"cutting\", \"additional_function_1\": \"carrying\", \"additional_function_2\": \"protecting\"}, \"compatibility\": \"universal\", \"price\": 80, \"other_details\": \"hand-forged\"}"}
{"docid":83,"title":"Champion Traps and Targets, Police Silhouette Target, 24x45 Green (100 Pack) (40732)","text":"Product Description LE B27FSA Silhouette Target Size 24\" x 45\" Green, 100-Pack Whether its qualification for law enforcement officers or personal home defense practice, these new police silhouette targets bring tactical precision to your shooting. Available in either standard paper or with cardboard backing, these new targets feature a high contrast green silhouette, scoring area and LE approved scoring rings. Repair centers are also available to maximize the life of the target. Features & Benefits - High contrast green for instant shot placement recognition - Scoring table for keeping track of performance and rounds Product Description LE B27FSA Silhouette Target Size 24\" x 45\" Green, 100-Pack Whether its qualification for law enforcement officers or personal home defense practice, these new police silhouette targets bring tactical precision to your shooting. Available in either standard paper or with cardboard backing, these new targets feature a high contrast green silhouette, scoring area and LE approved scoring rings. Repair centers are also available to maximize the life of the target. Features & Benefits - High contrast green for instant shot placement recognition - Scoring table for keeping track of performance and rounds","features":"{\"product_summary\": \"Police Target\", \"category\": \"shooting\", \"material\": \"paper\", \"functions\": {\"main_function\": \"shooting\", \"additional_function_1\": \"scoring\", \"additional_function_2\": \"training\"}, \"compatibility\": \"law enforcement\", \"price\": 50, \"other_details\": \"green\"}"}
{"docid":84,"title":"Hallmark 1st Mothers Day Card to Grandma (Promoted)","text":"Product Description Wish a super sweet grandmother a happy Mother's Day with a lovely Mother's Day card featuring an adorable bear cub and grandma bear scene. With a thoughtful sentiment and sweet design, there's plenty of room to write a personalized message inside to one of your favorite people. There's nothing like a note from the heart to let a special woman know how much she's loved and appreciated on Mother's Day and all year long. The Hallmark brand is widely recognized as the very best for greeting cards, gift wrap, and more. For more than 100 years, Hallmark has been helping its customers make everyday moments more beautiful and celebrations more joyful. Product Description Wish a super sweet grandmother a happy Mother's Day with a lovely Mother's Day card featuring an adorable bear cub and grandma bear scene. With a thoughtful sentiment and sweet design, there's plenty of room to write a personalized message inside to one of your favorite people. There's nothing like a note from the heart to let a special woman know how much she's loved and appreciated on Mother's Day and all year long. The Hallmark brand is widely recognized as the very best for greeting cards, gift wrap, and more. For more than 100 years, Hallmark has been helping its customers make everyday moments more beautiful and celebrations more joyful.From the manufacturer Make Mom smile. Celebrate everything she is and everything she does with a Mother's Day card she'll love. Read more Read more Read more  ","features":"{\"product_summary\": \"Mother's Day Card\", \"category\": \"gift\", \"material\": \"paper\", \"functions\": {\"main_function\": \"celebrate\", \"additional_function_1\": \"personalize\", \"additional_function_2\": \"express\"}, \"compatibility\": \"grandmother\", \"price\": 5, \"other_details\": \"adorable\"}"}
{"docid":85,"title":"Duo-R. Strauss: Ein Heldenleben Alpensinfonie","text":"Editorial Reviews Duo-R. Strauss: Ein Heldenleben Alpensinfonie Editorial Reviews Duo-R. Strauss: Ein Heldenleben Alpensinfonie","features":"{\"product_summary\": \"Duo-R. Strauss\", \"category\": \"musical\", \"material\": \"aluminum\", \"functions\": {\"main_function\": \"performance\", \"additional_function_1\": \"orchestral\", \"additional_function_2\": \"classical\"}, \"compatibility\": \"universal\", \"price\": 50, \"other_details\": \"collection\"}"}
{"docid":89,"title":"Hair Dryer Brush, YaFex Hot Air Brush Dryer & Volumizer with 2 Styling Heads","text":"Product Description Entangling-Free Bristles Flexible free bristles with massaging ball tips help to eliminates frizz and enhances shine for silky smooth hair. 3 Modes Temperature Setting HIGH ：High temperature & High speed; MIDDLE : Middle temperature & Low speed; LOW : Low temperature & High speed. A fantastic choice for your hair care in health & personal care which is suitable for virious types of hair. 360°Airflow Vents 360° vents can generate millions of negative ions and heat evenly, smooth your hair and faster drying, get the dreamy and tamed hair you have always wanted. Read more ","features":"{\"product_summary\": \"Hair Dryer Brush\", \"category\": \"haircare\", \"material\": \"plastic\", \"functions\": {\"main_function\": \"drying\", \"additional_function_1\": \"volumizing\", \"additional_function_2\": \"smoothing\"}, \"compatibility\": \"various_hair_types\", \"price\": 50, \"other_details\": \"negative_ions\"}"}
{"docid":91,"title":"Large Baby Tall Laundry Baskets, White Blankets Basket for Living Room, Woven Baskets for Storage, Rope Basket with Handle, Decorative Round Basket Use for Pillow, Towel, Toy or Nursery 15x18\"","text":"Product Description Got a handful of rugrats running around, tired of pet toys littered all over thefloor or need a quick convenient way to hide the mess when surprise houseguests come knocking? You’ll love how much stuff you can fit inside our stunning woven storage baskets! Who says you have to settle for loudly colored toy baskets that don’t matcha single piece of furniture in the house? OLLVIA Chic Large Wicker Basket, Get One For Every Room in the House SPECIFICATIONS: BRAND: OLLVIA SIZE: 15\" x 18\" MATERIAL: 100% Fabric PACKAGE QUANTITY: 1 piece White Laundry Basket YOU WILL GET WHAT YOU PAY FOR SAFE FOR KIDS - natural eco-friendly cotton material and unique round shape without sharp edges make this big basket safe for kids to play with it or even hide in it. It’s quite soft and pleasant to touch. DISTINCT SHAPE & HANDLES - STYLISH YET PRACTICAL – This woven floor basket with its distinct shape & handles will elevate your home decor whether it is Boho, Farmhouse, Modern or Rustic these will be perfect for you. LARGE TO STORAGE - our extra large laundry basket features 15 x 18 inches, so there’s enough space inside to serve as a pillow and blankets holder, large wicker basket for laundry storage, baby nursery basket for diaper storage, toys organizer, etc.· GIVE THE GIFT OF ELEGANCE, COMFORT &HAPPINESS - Everyone will adore their new attractive and versatile decorativebasket. Perfect for birthdays, holidays, baby showers, and housewarming events.And with no sharp edges like other toy boxes, that means kids are safer andwon’t get hurt. It will not tear and is impossible to pull apart. 🛒 CLICK ‘ADD TO CART' NOW get OLLVIA basket absolutely risk free Product Description Got a handful of rugrats running around, tired of pet toys littered all over thefloor or need a quick convenient way to hide the mess when surprise houseguests come knocking? You’ll love how much stuff you can fit inside our stunning woven storage baskets! Who says you have to settle for loudly colored toy baskets that don’t matcha single piece of furniture in the house? OLLVIA Chic Large Wicker Basket, Get One For Every Room in the House SPECIFICATIONS: BRAND: OLLVIA SIZE: 15\" x 18\" MATERIAL: 100% Fabric PACKAGE QUANTITY: 1 piece White Laundry Basket YOU WILL GET WHAT YOU PAY FOR SAFE FOR KIDS - natural eco-friendly cotton material and unique round shape without sharp edges make this big basket safe for kids to play with it or even hide in it. It’s quite soft and pleasant to touch. DISTINCT SHAPE & HANDLES - STYLISH YET PRACTICAL – This woven floor basket with its distinct shape & handles will elevate your home decor whether it is Boho, Farmhouse, Modern or Rustic these will be perfect for you. LARGE TO STORAGE - our extra large laundry basket features 15 x 18 inches, so there’s enough space inside to serve as a pillow and blankets holder, large wicker basket for laundry storage, baby nursery basket for diaper storage, toys organizer, etc.· GIVE THE GIFT OF ELEGANCE, COMFORT &HAPPINESS - Everyone will adore their new attractive and versatile decorativebasket. Perfect for birthdays, holidays, baby showers, and housewarming events.And with no sharp edges like other toy boxes, that means kids are safer andwon’t get hurt. It will not tear and is impossible to pull apart. 🛒 CLICK ‘ADD TO CART' NOW get OLLVIA basket absolutely risk free","features":"{\"product_summary\": \"Large Basket\", \"category\": \"storage\", \"material\": \"fabric\", \"functions\": {\"main_function\": \"storage\", \"additional_function_1\": \"decorative\", \"additional_function_2\": \"organizer\"}, \"compatibility\": \"multi-purpose\", \"price\": 30, \"other_details\": \"versatile\"}"}
{"docid":93,"title":"Krylon K01375000 Gallery Series UV Archival Varnish Aerosol Spray, Gloss, 11 Ounce","text":"Product Description Krylon K01375000 Gallery Series UV Archival Varnish Aerosol Spray, Gloss, 11 Ounce Product Description Krylon K01375000 Gallery Series UV Archival Varnish Aerosol Spray, Gloss, 11 Ounce","features":"{\"product_summary\": \"Krylon Gallery Varnish Spray\", \"category\": \"art\", \"material\": \"UV\", \"functions\": {\"main_function\": \"protect\", \"additional_function_1\": \"enhance\", \"additional_function_2\": \"preserve\"}, \"compatibility\": \"universal\", \"price\": 15, \"other_details\": \"archival\"}"}
{"docid":94,"title":"Merrill MFG PUMP125 Original Pitcher Pump, 1-1\/4\" FIP Base Tap, 17-1\/2\" Height, 17.5\"","text":"Product Description Merrill Manufacturing PUMP125 - Original Pitcher Pump, Cast Iron Body, Indent Spout for Pail Handle, Cap adjustable for handle positions, Shallow Well Application, Max Lift 25-30 feet. Product Description Merrill Manufacturing PUMP125 - Original Pitcher Pump, Cast Iron Body, Indent Spout for Pail Handle, Cap adjustable for handle positions, Shallow Well Application, Max Lift 25-30 feet.","features":"{\"product_summary\": \"Merrill Pump\", \"category\": \"pump\", \"material\": \"iron\", \"functions\": {\"main_function\": \"pumping\", \"additional_function_1\": \"adjustable\", \"additional_function_2\": \"shallow\"}, \"compatibility\": \"well\", \"price\": 150, \"other_details\": \"original\"}"}
{"docid":95,"title":"Kirkland Signature Organic Hemp Hearts","text":"Product Description Kirkland Signature was born and has remained a pillar of the products you can find at Costco ever since. The signature brand was created to offer quality and value and the company has worked hard to maintain that promise with each Kirkland Signature product they introduce. Product Description Kirkland Signature was born and has remained a pillar of the products you can find at Costco ever since. The signature brand was created to offer quality and value and the company has worked hard to maintain that promise with each Kirkland Signature product they introduce.","features":"{\"product_summary\": \"Hemp Hearts\", \"category\": \"food\", \"material\": \"organic\", \"functions\": {\"main_function\": \"nutrition\", \"additional_function_1\": \"health\", \"additional_function_2\": \"energy\"}, \"compatibility\": \"diet\", \"price\": 15, \"other_details\": \"organic\"}"}
{"docid":96,"title":"TPCK ToppCock Silver Leave-On Hygiene Gel for Man Parts, 90ml Odor Neutralizer, Male Care Moisturizing Body Hygiene","text":"Product Description New look. Improved Formula. ToppCock Silver gets an update! The new TPCK ToppCock Silver now sports a cleaner and more modern packaging and an improved formulation that gives superior protection against odor. What makes TPCK ToppCock Silver Hygiene for Man Parts Leave-On Gel perfect for you? Give your man parts the care they deserve! Whether you’re on your long morning commute, training in the gym, playing a game of footie with your friends, or going for a run, keep your man parts clean and fresh with our amazing deodorant gel! Easy to apply, simply rub the leave-on gel after showering and drying, and say goodbye to chafing, sticky discomfort and foul odor! What makes TPCK ToppCock Silver Hygiene for Man Parts Leave-On Gel perfect for you? Made of natural tea tree oil, aloe vera, and other natural ingredients, the unique formula helps eliminate the sources of nasty odors completely, leaving your manly area clean and fresh all day long! Furthermore, tea tree oil is known for its natural detoxifying properties and can help eliminate and prevent the causes irritation while aloe vera promotes skin healing and moisturization. Some more of the amazing features of our man parts deodorant: Easy-to-use, the leave-on gel dries to a smooth powder finish and is quickly absorbed by the skin; Mess-free, unlike talc powder, our hygiene gel leaves no sticky residue, and doesn’t stain clothes; Long-lasting effect, the deodorant will keep you clean and fresh through the day; Great for manscaping, the gel helps hydrate and soothe your skin after shaving, relieving razor burns, itchiness, and rashes; 90 ml, easy-to-carry, a must-have in every man's grooming kit. Contains Natural and Effective Ingredients Silver Nanoparticles Silver, as you may know, is a precious metal found naturally in the earth. It has been used for everything from jewelry to photographic film to electronics. What you probably did not know is that it is also known for its natural cleansing properties. As far back as Roman times silver coins were placed on sores and wounds then wrapped with cloth to aid in healing. Fast forward to just 30 years ago when modern science found a way to break silver down into small “Nano” particles and increase its effectiveness by over 1,000%. It is this same Nano-Silver Technology that you find in ToppCock Silver. Tea Tree Oil eliminates odor by preventing the growth of germs. Tea Tree Oil is known for its detoxifying properties and has been used to treat cuts, wounds, burns, boils and other skin disorders for centuries. It contains Terpenoids such as terpinen-4-ol, eucalyptol, cineole, nerolidol and viridiflorol which are all effective in preventing odor and infections. Aloe Vera helps in healing and works as a natural moisturizer. Aloe vera has been used for centuries for its medicinal and healing properties. It contains polyphenols which are powerful antioxidants that help inhibit germs that cause infections and inflammation. It also works as a natural moisturizer and helps soothe itch and rash. ","features":"{\"product_summary\": \"ToppCock Gel\", \"category\": \"hygiene\", \"material\": \"silver\", \"functions\": {\"main_function\": \"odor-neutralizer\", \"additional_function_1\": \"moisturizing\", \"additional_function_2\": \"cleansing\"}, \"compatibility\": \"men\", \"price\": 15, \"other_details\": \"long-lasting\"}"}
{"docid":100,"title":"Unisex Full Length Hooded Robe Cloak Long Velvet Cape Cosplay Costume 59 inch","text":"Product Description Ideal for any gothic,vampire,witch,sorceress or any halloween themed party or adult fancy dress costume. This versatile fancy dress accessory would look great either with a vampire, pirate, witch or grim reaper costume. Easy to complete your make up of Halloween Party ,Masquerade balls,Pagan celebrations or hand fasting. Features: 1.Material: velvet 2.Color: Black,Purple,Red,Green,Blue,Brown,Wine Red,White 3.Black(Lace) ,Purple(Lace) ,Red(Lace) ,Green(Lace) ,Wine Red(Lace) 4.Adult Size: Fit for 5'4\"~6'8\" tall * Length:150cm \/59 inches (from collar to hem);Hat Length:48cm\/18.90 inch Package Included: 1 x cloak Read more Read more Unisex Full Length Hooded Robe Cloak Long Velvet Cape Cosplay Costume 59\" The green is a nice dark green with lace on the hooded . Unisex Full Length Hooded Robe Cloak Long Velvet Cape Cosplay Costume 59\" Ties at the neck ,black cape is good for any gothic,witch . Unisex Full Length Hooded Robe Cloak Long Velvet Cape Cosplay Costume 59\" The wine red is the best choice for Little Red Riding Hood costume Unisex Full Length Hooded Robe Cloak Long Velvet Cape Cosplay Costume 59\" The purple one for a hocus pocus pub crawl, and was perfect ! Read more Kids Velvet Cape Hooded Cloak Halloween Costume Black and Red Reversible Party Cape Hooded Halloween Christmas Adult Cloak Girls High School Cheerleader Uniform Fancy Dress Women's Cheerleader Musical Uniform Fancy Dress Ladies Colored Sequins Goddess Cape Cloak Size 39.4inch 35inch, 47inch,55inch 39.4inch ,59 inch US2-4,US6-8, US10-12,US14-16 one size one size Style Hooded Hooded , Stand collar Hooded Suit Dress Stand collar ","features":"{\"product_summary\": \"Velvet Cape\", \"category\": \"Costume\", \"material\": \"Velvet\", \"functions\": {\"main_function\": \"Cosplay\", \"additional_function_1\": \"Halloween\", \"additional_function_2\": \"Party\"}, \"compatibility\": \"Unisex\", \"price\": 40, \"other_details\": \"Hooded\"}"}
{"docid":101,"title":"96 Pack Sticky Traps Gnat Trap Indoor, Plant Fruit Fly Trap and Fungus Gnat Sticky Trap, Fruit Fly Killer Indoor and Outdoor Plant Bug Trap","text":"Product Description Is there a way to protect your beloved plant without using any pesticides? -yes!there is. -Do you remember when you were walking by the lake in light colors,are there a lot of flying insects following you or sticking to your clothes? -This is because most flying insects are phototropic. They like bright colors and tend to these colors. -Take advantage of the phototaxis of flying insects can effectively attract and control flying insects, protect your plants and reduce damage. Fruit fly trap specifications : 12 Pack Size:13x8cm Bright yellow and odorless, made of high quality adhesive and no harmful drugs,natural pest control. Great for capturing and attracts fungus gnats, whiteflies, blackflies, thrips, fruit flies, midges and other flying insects. Apply to outdoor or indoor plant.Sun and flower shapes can make your pot plants look special. Advantages : Fungus gnat trap made of paper and high quality adhesive,by bright yellow color and the glue will draw in flying insects, trap them, control infestation and break the breeding cycle. Waterproof and uv proof, long service cycle. Your experience with this gnat fly trap is our top priority . If you shall have any concerns, send us an e-mail and we will get back to you within 24 hours May you a happy shopping ! Product Description Is there a way to protect your beloved plant without using any pesticides? -yes!there is. -Do you remember when you were walking by the lake in light colors,are there a lot of flying insects following you or sticking to your clothes? -This is because most flying insects are phototropic. They like bright colors and tend to these colors. -Take advantage of the phototaxis of flying insects can effectively attract and control flying insects, protect your plants and reduce damage. Fruit fly trap specifications : 12 Pack Size:13x8cm Bright yellow and odorless, made of high quality adhesive and no harmful drugs,natural pest control. Great for capturing and attracts fungus gnats, whiteflies, blackflies, thrips, fruit flies, midges and other flying insects. Apply to outdoor or indoor plant.Sun and flower shapes can make your pot plants look special. Advantages : Fungus gnat trap made of paper and high quality adhesive,by bright yellow color and the glue will draw in flying insects, trap them, control infestation and break the breeding cycle. Waterproof and uv proof, long service cycle. Your experience with this gnat fly trap is our top priority . If you shall have any concerns, send us an e-mail and we will get back to you within 24 hours May you a happy shopping !From the brand Stingmon Help more people to solve the problem of flying insects. Previous page Sticky Trap for Your Plants 7 cute shapes for you to choose from Safe and non-toxic, no harm to pets and children strong stickiness What problem are we solving? Stingmon is a team dedicated to solving the problem of flying insects at home. What makes our products unique? Our products are efficient, safe, suitable for all kinds of weather,and plus cute styling. All of our products have been tested before they are officially launched, and we have received satisfactory feedback from most of our customers. Why do we love what we do? We start from interest, with professional technology, hope to help more people to solve the problem of flying insects, bring a more comfortable life. Take Better Care of Your Plant Take Better Care of Your Plant Next page From the manufacturer Is there a way to protect your beloved plant without using any pesticides? -yes! there is. -Do you remember when you were walking by the lake in light colors, are there a lot of flying insects following you or sticking to your clothes? -This is because most flying insects are phototropic. They like bright colors and tend to these colors. -Take advantage of the phototaxis of flying insects can effectively attract and control flying insects, protect your plants and reduce damage. About Stingmon Stingmon focus on the development of a variety of quality non-toxic household trap products, dedicated to pest control. It is our team tenet to provide every customer with excellent service. We listen carefully to every customer's sincere Suggestions. Stingmon Fruit Fly Trap Styles The flower, tree, butterfly, bird, cat, explosion of star shapes, etc. We always try our best to satisfy your love and taste! Double-sided long-lasting adhesive, catch small insects effectively and fun. √ Safe and Non-toxic √ Odorless and No Chemicals √ high and low temperature resistant and waterproof Read more Our gnat killer for indoor is a good ideal for indoor plants, especially potted plants Those fruit fly trap can also be seen in the kitchen next to fruit and food, rejecting food contamination No pesticides are used, they can easily become an best insect killer in your garden Get away from the annoying buzz, your trash can needs their close attention, too Read more The fruit fly traps indoor great for capturing and attracts fungus gnats, whiteflies, blackflies, thrips, midges and other flying insects. Apply to outdoor or indoor plant. Read more ","features":"{\"product_summary\": \"Sticky Trap\", \"category\": \"Garden\", \"material\": \"Paper\", \"functions\": {\"main_function\": \"Trap\", \"additional_function_1\": \"Control\", \"additional_function_2\": \"Attract\"}, \"compatibility\": \"Indoor\/Outdoor\", \"price\": 15, \"other_details\": \"Non-toxic\"}"}
{"docid":104,"title":"Design Toscano Arthurian Knight Medieval Decor Bookend Statues, 8 Inch, Set of Two, Grey Stone","text":"Product Description From the romantic pages of the Arthurian legends come These exquisitely sculpted Sentinels who will valiantly guard your treasured literature or the photo albums of your world travels just as they guarded the ivory towers of Camelot. Sculpted in full battle armor, our Toscana exclusives are cast in quality designer resin with a two-tone metallic finish. (Set of two) each: 5\"Wx3½ \"Dx8\"H. 2 lbs. Product Description From the romantic pages of the Arthurian legends come These exquisitely sculpted Sentinels who will valiantly guard your treasured literature or the photo albums of your world travels just as they guarded the ivory towers of Camelot. Sculpted in full battle armor, our Toscana exclusives are cast in quality designer resin with a two-tone metallic finish. (Set of two) each: 5\"Wx3½ \"Dx8\"H. 2 lbs.From the manufacturer Our bookend collection gives you home decor products to match your own decorating style. Expect The Unexpected Our bookends of historical, artistic, mystical and animal figurines will protect your prized literary collection. These Toscano-exclusive creations are cast in quality designer resign or foundry iron and individually hand-finished. Great Selection. Durable Construction. Guaranteed Quality. Elegant and Stylish. Design Toscano Decorative Bookend Collection By Design Toscano One-of-a-kind artistic accents to grace your bookshelves. Imaginiately created with one-of-a-kind details, our sculptural bookends are cast in quality designer resin or sand-cast iron and hand-finished by skilled Toscano artisans. Our collection features animal, Gothic, mystical and historical home decor bookends to coordinate with any room in your home. Read more How Are Products Are Crafted Historical Collection Sculptural bookends of great historical figures, from King Arthur’s knights to Notre Dame’s towers, still command attention in home, office or library. Mystical Collection Inspired by fantastic creatures, our mystical collection of fierce dragons, Steampunk gears and heraldic gargoyles will be crowning jewel of your collection. Animal Collection From exotic lands to your own backyard, show your love of animals with our collection of loyal hounds, charging stallions and triumphant elephants. Artistic Collection Bookend statues from these famous artistic periods, from the Renaissance to Art Deco, will inspire you to create your own literary masterpiece. Read more About Design Toscano At Design Toscano, the country’s premier source for historical replicas, we pride ourselves on attention to detail by traveling directly to the source. Over 90% of our offerings are exclusive to the Design Toscano brand, allowing us to present distinctive decorative items unavailable elsewhere. Our attention to detail extends throughout the company, especially in the areas of service and shipping. Design Toscano offers specialty home and garden décor, fountains, reproduction furniture and accessories, indoor and outdoor statuary, and one-of-a-kind home and garden accents. For more than 25 years, Design Toscano has introduced exclusive sculptures, furniture, statues, wall art, and decorative furnishings to passionate consumers eager to surround themselves with unique and extraordinary objects. We have over 6,000 items available so you can expect the unexpected! Read more ","features":"{\"product_summary\": \"Knight Bookends\", \"category\": \"decor\", \"material\": \"resin\", \"functions\": {\"main_function\": \"guard\", \"additional_function_1\": \"decorate\", \"additional_function_2\": \"display\"}, \"compatibility\": \"books\", \"price\": 50, \"other_details\": \"historical\"}"}
{"docid":105,"title":"Koneseve Dog Shirt, Pet Plaid Clothes Shirt T-Shirt, Sweater Bottoming Shirt for Small Dog Cat Puppy Grid Adorable Wearing Stylish Cozy Halloween,Christmas Costumes {Red;M\/Medium}","text":"Product Description About Koneseve: Koneseve is a Pet Lover Specialized in the Design and Production, You can Find Much More Distinctive Selection at Our store Concentrate on Creating a More Comfortable and Unique Life for your Baby Pet, and Make your Baby Fashionable. Pet Clothes Benefits: *Weatherization* In cold weather, pet clothes can protect against cold especially protect cats and dogs with weak constitution and small body. *Cleaning Needs* Pets Needn’t always taken bath,Always bathing may cause their skin problems. So avoiding outside dirty,Dress allows them to stay cleaner and longer.Clothes also make a skin surface protection. !Attention!: *1. How to measure your dog? Please refer to our Size Chart to measure. *2. Your pet usually wears size S doesn't mean all size S will fit him\/her. Don't buy a particular size because of the different design on different shirt. Refer to the Size Chart on neck,chest,length,confirm the size before you want to buy. *3. If any of the measurements are between two sizes, choose the larger size. If your measurements are toward the upper end of the range given for a particular size, You may also need choose the larger size. *4. Take each measurement a bit loosely. Take each measurement a bit loosely, But not too loose and too tight. Size & Weight Attention: Please Refer to Our Size Chart before Shopping, and Thanks for accepting the Measure Error between 1-2 CM. Weight Data is for a Reference, Please Actually Measure your pet's Neck, Chest, and Back Length for Choosing the Suitable Size. Product Description About Koneseve: Koneseve is a Pet Lover Specialized in the Design and Production, You can Find Much More Distinctive Selection at Our store Concentrate on Creating a More Comfortable and Unique Life for your Baby Pet, and Make your Baby Fashionable. Pet Clothes Benefits: *Weatherization* In cold weather, pet clothes can protect against cold especially protect cats and dogs with weak constitution and small body. *Cleaning Needs* Pets Needn’t always taken bath,Always bathing may cause their skin problems. So avoiding outside dirty,Dress allows them to stay cleaner and longer.Clothes also make a skin surface protection. !Attention!: *1. How to measure your dog? Please refer to our Size Chart to measure. *2. Your pet usually wears size S doesn't mean all size S will fit him\/her. Don't buy a particular size because of the different design on different shirt. Refer to the Size Chart on neck,chest,length,confirm the size before you want to buy. *3. If any of the measurements are between two sizes, choose the larger size. If your measurements are toward the upper end of the range given for a particular size, You may also need choose the larger size. *4. Take each measurement a bit loosely. Take each measurement a bit loosely, But not too loose and too tight. Size & Weight Attention: Please Refer to Our Size Chart before Shopping, and Thanks for accepting the Measure Error between 1-2 CM. Weight Data is for a Reference, Please Actually Measure your pet's Neck, Chest, and Back Length for Choosing the Suitable Size.From the brand Koneseve Give your furry friend a different care. Previous page Koneseve Began in 2016 We are committed to using premium fabrics to our pet clothes. High quality fabrics bring the best comfort for pets. Design more suitable products according to the body shape of more pets. Our products are suitable for small to large pets. Create more stylish and trendy fashion clothes for more pets, Give pets different care throughout all seasons. Fashion Plaid Dog Shirt Visit the Store Dog Cotton Elastic Shirt Vests Dog Warm Fleece Hoodie More Style Get and Coming What makes our company unique? We are committed to designing different styles from the market. Adhering to the use of premium fabric for our furry friends best wear feeling, and accumulating more lovers who like us. Are our products of high quality? Yes, We always believe that high-quality fabrics can be trusted and liked by more pet owners, and prolong the wearing time of pets to the greatest extent. We hope to provide pet owners with more cost-effective pet clothing. Next page From the manufacturer Read more Model Show Model in Red Size:3XL Chest: 63CM ( 25\" ) Back Length: 55CM ( 22\" ) Neck:43CM ( 17\" ) Weight:38 lbs Model in Blue Size:3XL Chest: 63CM ( 25\" ) Back Length: 53CM ( 21\" ) Neck:45CM ( 17.7\" ) Weight:35lbs Model in Green Size:XL Chest: 51CM ( 20\" ) Back Length:43CM ( 17\" ) Neck:37CM ( 14.5\" ) Weight:24lbs Read more Details Show Clothing Material Safe; Made from Natural and Comfortable Cotton Cloth Fabric,Bringing Warmth and Comfort to your Baby Pet. Cuff Design Makes the Whole Pet Clothes Look More Gentle and Simple! Fine & Professional Workmanship Neat & Exquisite Sewing Workmanship Guarantees the Integrity and Fashion Design of Each Pet Clothes. Quality Assurance, Fine Workmanship,Ensuring that Every Pet Clothes Can Meet Expectations of Each Customer. Shirt Collar Design Fashionable and Durable; Shirt Collar Button Design,Prevent the Dog Clothes Worn for a Long Time Caused by Sliding Clothes Deformation! Read more Measurement Tips Tips 1: Measure Your Pet Correctly with a band tape. Tips 2: Chest Measure is the Most Important, be Sure the Chest of Clothes can be Fit. Recommended Loose Fit is Better Tips 3: Refer to Size Chart and Choose Size. If Any of the Measurements are 'Between' Two Sizes, Choose the Larger Size. If Your Measurements are Toward the upper end of the Range Given for a Particular Size, You May Want to Choose the Larger Size, as It's also Accommodated all fur. Size Guide Please Refer to Size Chart before Purchasing! Your Carefully Choice will Avoid Plenty of Inconvenience of Returns. Usually Choosing the Size by Measuring in Chest ,Back Length and Neck,Not Weight or Breeds Merely. Please Refer to Size Chart before Shopping. If Your Pet is under One Year Old and Still Growing up,Please Consider this when Choosing. Chest: Measure Chest Around at its Widest after Forelegs. Back length: Measure Length of Pet's Back from the Base of the Neck to the Base of the Tail.(Excluding the Tail) Neck: Neck Circumference.(Recommend to Measure the Start Point of the Back Length) Read more Buyer Show Every Furbabys' Lovely Smile is a Comfort in Our Heart! Read more ","features":"{\"product_summary\": \"Dog Shirt\", \"category\": \"Pet\", \"material\": \"Cotton\", \"functions\": {\"main_function\": \"Protection\", \"additional_function_1\": \"Fashionable\", \"additional_function_2\": \"Comfortable\"}, \"compatibility\": \"Small Dogs, Cats, Puppies\", \"price\": 15, \"other_details\": \"Plaid Design\"}"}
{"docid":107,"title":"Kotobukiya Fate\/Grand Order: Berserker\/Musashi Miyamoto PVC Statue, Multicolor","text":"Product Description COLLECTIBLE STATUE Product Description COLLECTIBLE STATUE","features":"{\"product_summary\": \"Musashi Miyamoto Statue\", \"category\": \"collectible\", \"material\": \"PVC\", \"functions\": {\"main_function\": \"display\", \"additional_function_1\": \"decoration\", \"additional_function_2\": \"collection\"}, \"compatibility\": \"N\/A\", \"price\": 120, \"other_details\": \"Multicolor\"}"}
{"docid":108,"title":"Eat Sleep Destiny Repeat T-Shirt","text":"From the manufacturer ","features":"{\"product_summary\": \"Destiny T-Shirt\", \"category\": \"clothing\", \"material\": \"cotton\", \"functions\": {\"main_function\": \"wearable\", \"additional_function_1\": \"casual\", \"additional_function_2\": \"stylish\"}, \"compatibility\": \"unisex\", \"price\": 20, \"other_details\": \"gaming\"}"}
{"docid":111,"title":"The Children's Place Baby Toddler Boys Basic Skinny Jeans","text":"From the manufacturer Read more EASY TO SHOP! MADE WITH EXTRA STRETCH THE SLIM FIT THE GO-TO CLASSIC WHEN COOL MEETS COMFORT Multipacks Ready to shop in packs of 2 or 3! Singles only 2 & 4 packs 2 & 3 packs 2 pack Fit Skinny, Bootcut or Straight! Skinny & Straight Classic fit hip & thigh, skinny opening Classic fit hip & thigh, straight opening Classic fit hip & thigh, bootcut opening Fabric Styles with stretch for extra comfort Super soft stretch=All day comfort Basic and super soft, comfy stretch options Basic and super soft, comfy stretch options Basic only Washes Variety of washes for everyday wear 10 washes! 10 washes! 6 washes 2 washes Pull-on EZ-fit with adjustable waist ✓ ✓ ✓ ✓ ✓ Read more ","features":"{\"product_summary\": \"Baby Jeans\", \"category\": \"clothing\", \"material\": \"stretch\", \"functions\": {\"main_function\": \"comfort\", \"additional_function_1\": \"style\", \"additional_function_2\": \"adjustable\"}, \"compatibility\": \"toddlers\", \"price\": 20, \"other_details\": \"multipacks\"}"}
{"docid":112,"title":"Stargazer Oriental Lilies (12 Bulbs) - Freshly Dug Bulbs","text":"Product Description Who could forget one of the best loved Lilies, the Stargazer? These jumbo bulbs will produce beautiful blooms which can sometimes reach 8\" across. They emit a wonderfully sweet fragrance which is sure to stop you in your tracks! Each petal starts with deep fushia in the middle fading to light pink, trimmed in white including pink speckles. It is also a wonderful cut flower, making gorgeous cutflower arrangements! Perennial in Zones 3 - 8. Lilium. Size 14\/16 cm. This item will Bloom\/Grow Mid Summer Product Description Who could forget one of the best loved Lilies, the Stargazer? These jumbo bulbs will produce beautiful blooms which can sometimes reach 8\" across. They emit a wonderfully sweet fragrance which is sure to stop you in your tracks! Each petal starts with deep fushia in the middle fading to light pink, trimmed in white including pink speckles. It is also a wonderful cut flower, making gorgeous cutflower arrangements! Perennial in Zones 3 - 8. Lilium. Size 14\/16 cm. This item will Bloom\/Grow Mid Summer","features":"{\"product_summary\": \"Stargazer Lilies\", \"category\": \"garden\", \"material\": \"bulbs\", \"functions\": {\"main_function\": \"blooming\", \"additional_function_1\": \"fragrance\", \"additional_function_2\": \"cutting\"}, \"compatibility\": \"perennial\", \"price\": 20, \"other_details\": \"jumbo\"}"}
{"docid":115,"title":"TheraCran One Cranberry Supplement | 36mg PACs Per Capsule | 90 Day Supply | Cranberry Extract, Supports Urinary Tract Health","text":"Product Description Read more TheraCran One Cranberry Capsule Supplement TheraCran One Cranberry capsules contain a high-potency whole cranberry extract. Each capsule is formulated with 36 mg of PACs (proanthocyanidins). This is the optimal dose shown to promote urinary tract health.* TheraCran One is the only cranberry supplement independently tested and certified for purity and PAC content in the USA. Premium Product Benefits Optimal Dosing Whole Cranberry Extract NSF Certified† Vegan. Dye-Free. Gluten-Free. Read more Whole Cranberry Extract Each capsule is made from cranberry skins, juice, seeds, and flesh, providing a balanced spectrum of PACs and other active cranberry phytochemicals for optimal effectiveness. Research-Based One capsule, taken daily, provides 36 mg of PACs, the recommended dose to support urinary tract health.* Optimal Dosing 36 mg of PACs per capsule is the amount shown in scientific studies to promote urinary tract health.* Independently Tested NSF International Content-Certified† Read more Why Theralogix? High-Quality Our products contain the highest-quality ingredients, meeting the sourcing and testing requirements of the NSF International Certification program.† Medical Advisory Board (MAB) The Theralogix MAB is comprised of physicians, faculty members, and scientists. Each product is reviewed and approved by the MAB.‡ Transparency Theralogix products are gluten-free, artificial dye-free, and contain no proprietary blends or undisclosed ingredients. Research-Based Our promise: Theralogix will never sell a product that is not backed by solid scientific evidence. Read more * These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease. † TheraCran One was last tested and certified by NSF International in 2022. ‡ The Theralogix Medical Advisory Board (MAB) is a group within Theralogix which approves all formulations; the MAB is not an external organization and there are no certifications given out by the MAB. TheraCran One Cranberry Extract Capsules 90 Day Supply | 36 mg PACs per capsule Theravir Immune Support Supplement | 90 Day Supply New Canabrex Palmitoylethanolamide (PEA) Supplement Theratonin Melatonin Supplement NeoQ10 - Enhanced Absorption Coenzyme Q10 (CoQ10) Supplement Ovasitol Inositol Powder Intended Use Formulated to support urinary tract health.* Formulated to support a healthy immune system.* Promotes healthy immune, nerve and joint function* Formulated to support optimal sleep.* CoQ10 supplement used to support heart health and healthy blood pressure levels.* Promotes menstrual regularity and normal ovarian function* Made in the USA ✓ ✓ ✓ ✓ ✓ ✓ 100% Vegan ✓ ✓ ✓ Dye-free, Gluten Free ✓ ✓ ✓ ✓ ✓ ✓ NSF Certified ✓ ✓ ✓ ✓ ✓ ","features":"{\"product_summary\": \"TheraCran One Cranberry Supplement\", \"category\": \"supplement\", \"material\": \"cranberry\", \"functions\": {\"main_function\": \"support\", \"additional_function_1\": \"promote\", \"additional_function_2\": \"certified\"}, \"compatibility\": \"urinary\", \"price\": 30, \"other_details\": \"NSF\"}"}
{"docid":116,"title":"Therapeutic Personal Back Massager - Handheld Cordless and Powerful Wand - 8 Speeds 20 Vibrating Patterns - USB Rechargeable - Magic Recovery Effect for Women & Men, Body, Neck & Shoulders","text":"Product Description SENSUAL-U PREMIUM 2020, YOUR WAND MASSAGER FOR TREATING MUSCLE ACHES OR SPORTS INJURIES! The Sensual-U Premium offers the latest in massage technology. Made from durable materials and with a powerful motor it offers the quality of a premium massager but for a fraction of the money. Whether you are working an office job and sitting all day, an athlete or you just want to enjoy a relaxing massage at the end of the day, the Sensual-U Premium is the wand massager for you! When you order the Sensual-U Premium massage kit you will receive: -The Sensual-U Premium wand massager 2020 model -USB charger - extensive user manual Sensual-U is a trusted and leading company for all kinds of massage products. Innovation is our aim and we will always strive to bring you the latest in massage technology so you can relax! Multiple vibration patterns With 8 speeds , from soothing to intense and 20 vibration patterns the Sensual-U Premium is made to fit every one of your needs: - The powerful battery can keep on going for over 3 hours on one charge - It is portable and cordless so you will not be limited using it in any position you'd like. - It has a bendable head to get to those hard to reach places. . Read more Therapeutic benefits H elpful characteristics of the Sensual-U Premium: · improves blood circulation and relaxes sore muscles · prevents calcification in the joints · reduces tension and helps you relax so you can get a good nights sleep · alleviates dragging pain and arthritis Read more The Sensual-U 2020 wand massager is w ater resistant and can be used with essential oils for an even better experience. Also it can be cleaned easily with water and a bit of soap Read more Personal Massager Curved Sensual-U Massage Oil & Lubricant Original Sensual-U Products ✓ ✓ ","features":"{\"product_summary\": \"Back Massager\", \"category\": \"Personal Care\", \"material\": \"Durable\", \"functions\": {\"main_function\": \"Massage\", \"additional_function_1\": \"Relaxation\", \"additional_function_2\": \"Pain Relief\"}, \"compatibility\": \"Body, Neck & Shoulders\", \"price\": 50, \"other_details\": \"USB Rechargeable\"}"}
{"docid":118,"title":"BOUNTECH Inflatable Bounce House, 5 in 1 Kids Jumper Bouncer with Slides, Jumping Area, Climbing Wall, Basketball Rim, Bouncy House for Kids, Including Carry Bag, Stakes, Repair (Without Air Blower)","text":"Product Description Description: Are you looking for a charming palace that can offer extraordinary enjoyment for your kids? Our inflatable bounce house with perfect configuration will be your ideal choice! With 2 slides, a climbing wall, a large jumping area and a basketball rim, our bouncing house allows children to enjoy extra fun of various games at the same time. It is good for your child to develop motor skills, potential and increase their interests. Oxford surface makes it safe, durable and easy to clean, ensuring long service life. And the bounce castle uses mesh wall stakes, durable straps to achieve additional security. The long air outlet tube brings a lot of convenience in rapid inflation and deflation. What's more, the carrying bag lets you take the bounce house anywhere without too much effort. Give children a happy childhood with this attractive inflatable bounce house! Features: Includes 2 slides, a climbing wall, a large jumping area and a basketball rim Safe and friendly oxford cloth material to ensure the safety of children Mesh netting wall design for optimal ventilation and extra safety Large playing area to accommodate 3 children under total 200lbs Storage bag with high quality straps for easy carrying and moving 5 bouncer stakes to help you fix the inflatable bounce house firmly 12 repair patches makes it easy and portable to maintain and care 2 arched doors and multiple entrances for easy access and more convenience Instant inflation or deflate in a few minutes with the long air outlet tube Specification: Material: Oxford Cloth, PVC Overall Size: 164’' x 138’' x 79’' (L x W x H) Size of Long Slide: 20'' x 45'' (W x H) Maximum Weight Capacity: 200 lbs Net Weight: 31 lbs Package Includes: 1× Storage Bag 1× Carrying Bag 5 × Bouncer Stakes 12 × Repair Patches Product Description Description: Are you looking for a charming palace that can offer extraordinary enjoyment for your kids? Our inflatable bounce house with perfect configuration will be your ideal choice! With 2 slides, a climbing wall, a large jumping area and a basketball rim, our bouncing house allows children to enjoy extra fun of various games at the same time. It is good for your child to develop motor skills, potential and increase their interests. Oxford surface makes it safe, durable and easy to clean, ensuring long service life. And the bounce castle uses mesh wall stakes, durable straps to achieve additional security. The long air outlet tube brings a lot of convenience in rapid inflation and deflation. What's more, the carrying bag lets you take the bounce house anywhere without too much effort. Give children a happy childhood with this attractive inflatable bounce house! Features: Includes 2 slides, a climbing wall, a large jumping area and a basketball rim Safe and friendly oxford cloth material to ensure the safety of children Mesh netting wall design for optimal ventilation and extra safety Large playing area to accommodate 3 children under total 200lbs Storage bag with high quality straps for easy carrying and moving 5 bouncer stakes to help you fix the inflatable bounce house firmly 12 repair patches makes it easy and portable to maintain and care 2 arched doors and multiple entrances for easy access and more convenience Instant inflation or deflate in a few minutes with the long air outlet tube Specification: Material: Oxford Cloth, PVC Overall Size: 164’' x 138’' x 79’' (L x W x H) Size of Long Slide: 20'' x 45'' (W x H) Maximum Weight Capacity: 200 lbs Net Weight: 31 lbs Package Includes: 1× Storage Bag 1× Carrying Bag 5 × Bouncer Stakes 12 × Repair PatchesFrom the brand Inflatable Kids Bounce House Suitable for Backyards, Parks, Birthday Parties, Summer BBQs etc. Previous page As BOUNTECH, we know it’s important for kids to stay active. We are dedicated to research and design a variety of styles bouncy castles. We make products that burn off energy, stimulate curiosity, let children share the happiness with their friends. There is no barrier to seasonal restriction, BOUNTECH bounce house is suitable for use both indoors or outdoors, it equals big fun. Gifts First Visit the Store Summer Fun with Water Slides Visit the Store Diverse Styles Visit the Store Standard Size Visit the Store Upgrade Style Visit the Store Best Gift Visit the Store Integrated Climbing Wall Children will have endless fun with this inflatable water slide. Backyard Fun! From birthday parties to outdoor carnivals, give kids a happy childhood! Best Gift for Kids Visit the Store Rich and Diverse Styles Visit the Store Enjoy Water Fun ! A desired water slide for your children to beat the heat in the summer! Water Slide Bounce House Visit the Store Wet & Dry Home Playground Just connect the hose the bounce house can be used as a multifunctional inflatable water slides. Animal Themed Water Park Visit the Store BOUNTECH Inflatable Water Park Family Hours of Entertainment with Giant Waterslides Water Slide with Jumper Area Visit the Store Football Gate\/Ball Shooting Facilitate kids' body and brain development. Blowers of Different Power Visit the Store Next page  ","features":"{\"product_summary\": \"Inflatable Bounce House\", \"category\": \"outdoor\", \"material\": \"Oxford\", \"functions\": {\"main_function\": \"entertainment\", \"additional_function_1\": \"exercise\", \"additional_function_2\": \"convenience\"}, \"compatibility\": \"kids\", \"price\": 300, \"other_details\": \"portable\"}"}
{"docid":119,"title":"Amazon Essentials Women's 2-Pack Classic-Fit 100% Cotton Sleeveless Tank","text":"Product Description Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort. Product Description Amazon Essentials is focused on creating affordable, high-quality, and long-lasting everyday clothing you can rely on. Our line of women's apparel includes cashmere sweaters, fleece and down jackets, and more, including plus-size options. Our consistent sizing takes the guesswork out of shopping, and each piece is put to the test to maintain the highest standards in quality and comfort.From the manufacturer Previous page Outfit Your Superfan Disney designs Make everyday a Disney day with designs for the whole family - exclusive to Amazon Outfit Your Occasions Women's looks Dresses and more, in fresh styles to match all your moments. Outfit Your Vibe New styles for him Easygoing or buttoned up, find the tops and bottoms you need for all that you do. Outfit Your Little One The baby scene Keep them in cuteness. Shop new styles, available in adorable. Next page 1 DISNEY X AE 2 WOMEN 3 MEN 4 KIDS\/BABY ","features":"{\"product_summary\": \"Tank\", \"category\": \"apparel\", \"material\": \"cotton\", \"functions\": {\"main_function\": \"wear\", \"additional_function_1\": \"comfort\", \"additional_function_2\": \"style\"}, \"compatibility\": \"women\", \"price\": 20, \"other_details\": \"sleeveless\"}"}
{"docid":120,"title":"Simplicity Winter Fingerless Gloves With or Without Mitten Flap Cover","text":"Product Description These convertible mitten fingerless gloves help protect your hands fromthe cold weather. They're great for all outdoor fall and\/or winter activities such as skiing,snowboarding, sledding, hiking and just about anything else! These fingerless mittens come with or without a convertible flip back cap toexpose your fingers. Perfect winter gloves when using touchscreen electronic devices such as yoursmart phone or tablet. Shipping discounts on combined purchases are applicable! Order your glovestoday! Materials: Polyester\/ Acrylic Size: Adult Color: As Shown in Pictures Package Includes: 1 x Pair of Gloves Product Description These convertible mitten fingerless gloves help protect your hands fromthe cold weather. They're great for all outdoor fall and\/or winter activities such as skiing,snowboarding, sledding, hiking and just about anything else! These fingerless mittens come with or without a convertible flip back cap toexpose your fingers. Perfect winter gloves when using touchscreen electronic devices such as yoursmart phone or tablet. Shipping discounts on combined purchases are applicable! Order your glovestoday! Materials: Polyester\/ Acrylic Size: Adult Color: As Shown in Pictures Package Includes: 1 x Pair of GlovesFrom the brand Previous page Populars from Simplicity Populars from Simplicity We believe that it's really the simple things in life that provide the most joy. Whether you're lounging around the home with family, or going out with friends, Simplicity's line of comfy and fun lifestyle pieces help you feel good while also looking good. It’s just that simple! Next page  ","features":"{\"product_summary\": \"Winter Gloves\", \"category\": \"accessory\", \"material\": \"Polyester\", \"functions\": {\"main_function\": \"Protect\", \"additional_function_1\": \"Convertible\", \"additional_function_2\": \"Touchscreen\"}, \"compatibility\": \"Adult\", \"price\": 20, \"other_details\": \"Fingerless\"}"}
{"docid":121,"title":"Black Cool Deck of Cards, 1 Playing Cards, High Definition Waterproof Poker Cards - Flexible Magic Tricks Tool for Family Party and Table Game","text":"Product Description Weensmeil Black Foil Waterproof Poker Give You More Fun Are you struggling with normal paper poker as they are easy to be old and broken? If yes, you can find that it is replacing common paper playing cards gradually. The poker playing card would be an awesome addition to your collection. Features: High-grade Black foil and features a deep emboss surface, refraction texture shining like diamond. Highly flexible, durable, scratch less, won't fade and waterproof-perfect to take to the beach, pool, or camping. Great materials and gives the cards highly durable feature. Clear three-dimensional patterns, all sorts of grain, refraction texture shining. Suitable for all card games, these awesome playing cards will deliver hours of fun with family and friends during game time. Great for all card games including Poker, Canasta, Rummy, Pinochle, Euchre, Hearts, Blackjack, Go Fish, Baccarat and many more! Hand-washable, and easy to shuffle. Specifications: Size of card(L x W): 2.2 x 3.4 inch Each deck contains 52 suited play cards and 2 jokers. Color: Black Read more Highly flexible, durable, scratch less, won't fade and waterproof-perfect to take to the beach, pool, or camping. Made of superb paper, covered well to ensure these cards work incredible for you, the edges are smooth, difficult to part, easy to shuffle. Good flexibility make them be easy to shuffle, with the size of 2.2 x 3.4 inch, you can feel free to play them by your left and right hand. Read more Perfect choice to spice up your family and friends’ gatherings or for your summer pool and beach parties. Read more ","features":"{\"product_summary\": \"Black Poker Cards\", \"category\": \"game\", \"material\": \"foil\", \"functions\": {\"main_function\": \"play\", \"additional_function_1\": \"waterproof\", \"additional_function_2\": \"flexible\"}, \"compatibility\": \"family\", \"price\": 15, \"other_details\": \"durable\"}"}
{"docid":122,"title":"Tropical Oasis Liquid Calcium & Magnesium - Natural formula w\/ support for strong bones - Liquid vitamins w\/ calcium, - 16oz, 32 Serv.","text":"Product Description Read more Kids Liquid Multivitamin Joint Complete Premium Sleep-A-Weigh Plus Women's Liquid Multivitamin Liquid Calcium and Magnesium Glucosamine Chondroitin & MSM Liquid ✓ ✓ ✓ ✓ ✓ ✓ Flavors Unflavored Unflavored Pineapple Tropical Orange Tropical Tropical Oasis Promise ✓ ✓ ✓ ✓ ✓ ✓ ","features":"{\"product_summary\": \"Liquid Calcium Magnesium\", \"category\": \"supplement\", \"material\": \"liquid\", \"functions\": {\"main_function\": \"bones\", \"additional_function_1\": \"vitamins\", \"additional_function_2\": \"support\"}, \"compatibility\": \"universal\", \"price\": 20, \"other_details\": \"natural\"}"}
{"docid":123,"title":"Seektop 20 Inches Archery Targets for Backyard, 3 Layers Traditional Hand-Made Straw Archery Target for Youth Outdoor Hunting Shooting Practice, Arrow Target for Recurve Bow Longbow or Compound Bow","text":"Product Description [About Target]: Diameter:20\" Thickness: 2.36\" Material:Three Layer Solid Straw Weigh:6.2lbs Suitable Sports: Outdoor Archery, Indoor Archery, Outdoor Darts. Suitable For Archery beginners, Advanced archery practitioners, Archery enthusiasts. [Notice]: To extend the life of the target, Please do not use the bladed or too sharp arrow to shoot. Because our target is made from fresh forage, it is recommended to put it in a ventilated place, avoid placing it in a damp place, so as to prevent the target from becoming moldy. Product Description [About Target]: Diameter:20\" Thickness: 2.36\" Material:Three Layer Solid Straw Weigh:6.2lbs Suitable Sports: Outdoor Archery, Indoor Archery, Outdoor Darts. Suitable For Archery beginners, Advanced archery practitioners, Archery enthusiasts. [Notice]: To extend the life of the target, Please do not use the bladed or too sharp arrow to shoot. Because our target is made from fresh forage, it is recommended to put it in a ventilated place, avoid placing it in a damp place, so as to prevent the target from becoming moldy.","features":"{\"product_summary\": \"Archery Target\", \"category\": \"sports\", \"material\": \"straw\", \"functions\": {\"main_function\": \"shooting\", \"additional_function_1\": \"practice\", \"additional_function_2\": \"hunting\"}, \"compatibility\": \"various bows\", \"price\": 50, \"other_details\": \"hand-made\"}"}
{"docid":124,"title":"Dancing Doves Cape Primrose Plant - Streptocarpella- Indoors\/Out - Shade - 6\" HB","text":"Product Description Streptocarpella (Cape Primrose). A relative of African Violets, Streptocarpella prefers the same growing conditions of bright, indirect light. Avoid hot sun, which can burn the leaves and fade the flowers. Day and night temperatures of 60-75°F are fine year round. WATERING: Water only when the top inch of the potting mix is dry to the touch. To avoid causing spots on the leaves, use tepid water or water from the bottom of the pot. Providing water too frequently will cause the roots, leaves, and base of the plant to rot. If the leaves look wilted even when the soil is moist, you may be overwatering. Let the top inch of the potting mix dry out before watering again. Plants require less water during the winter months (November through February). FERTILIZER: From spring through fall, apply a water-soluble fertilizer that is high in phosphorus (such as 15-30-15) every 3 weeks. Withhold fertilizer during the winter months, when your plant will stop growing actively and rest. CONTINUING CARE: Use scissors to cut off the stalks of faded flowers. Repot your plant into a slightly larger pot in spring. Product Description Streptocarpella (Cape Primrose). A relative of African Violets, Streptocarpella prefers the same growing conditions of bright, indirect light. Avoid hot sun, which can burn the leaves and fade the flowers. Day and night temperatures of 60-75°F are fine year round. WATERING: Water only when the top inch of the potting mix is dry to the touch. To avoid causing spots on the leaves, use tepid water or water from the bottom of the pot. Providing water too frequently will cause the roots, leaves, and base of the plant to rot. If the leaves look wilted even when the soil is moist, you may be overwatering. Let the top inch of the potting mix dry out before watering again. Plants require less water during the winter months (November through February). FERTILIZER: From spring through fall, apply a water-soluble fertilizer that is high in phosphorus (such as 15-30-15) every 3 weeks. Withhold fertilizer during the winter months, when your plant will stop growing actively and rest. CONTINUING CARE: Use scissors to cut off the stalks of faded flowers. Repot your plant into a slightly larger pot in spring.","features":"{\"product_summary\": \"Cape Primrose Plant\", \"category\": \"plant\", \"material\": \"n\/a\", \"functions\": {\"main_function\": \"decor\", \"additional_function_1\": \"care\", \"additional_function_2\": \"fertilize\"}, \"compatibility\": \"indoors\/outdoors\", \"price\": 15, \"other_details\": \"low maintenance\"}"}
{"docid":125,"title":"MPD Digital 50 feet of LMR-400 Ultra Low Loss Coax Cable with N Male Connector Ends, Black","text":"Product Description Ultra Low Loss Cable is designed to transmit the maximum signal to your antennas. 1\/2 inch LMR-400 cable by MPD Digital USA meets Military Specifications with silver foil and silver coated copper conductors for less signal loss in runs up to 200 feet.. In this high quality cable, the dimensions and spacing of the conductors are uniform. Any abrupt change in the spacing of the two conductors along the cable tends to reflect radio frequency power back toward the source, causing a condition called standing waves, reducing the amount and quality of the transmitted power. To hold the shield at a uniform distance from the central conductor, the space between the two is filled with a dielectric designed to maintain the proper spacing between conductor and shielding to assure maximum signal transmission and lowest loss. You should allow three inches of cable to make a 90 degree turn in your runs without causing signal loss. The connectors used with the coax must also hold the correct spacing through the body of the connector to avoid signal loss. The transmission of energy in the line occurs totally through the dielectric inside the cable between the conductors. This shielded cable can be bent and moderately twisted without negative effects, and can be strapped to conductive supports without inducing signal interference. Product Description Ultra Low Loss Cable is designed to transmit the maximum signal to your antennas. 1\/2 inch LMR-400 cable by MPD Digital USA meets Military Specifications with silver foil and silver coated copper conductors for less signal loss in runs up to 200 feet.. In this high quality cable, the dimensions and spacing of the conductors are uniform. Any abrupt change in the spacing of the two conductors along the cable tends to reflect radio frequency power back toward the source, causing a condition called standing waves, reducing the amount and quality of the transmitted power. To hold the shield at a uniform distance from the central conductor, the space between the two is filled with a dielectric designed to maintain the proper spacing between conductor and shielding to assure maximum signal transmission and lowest loss. You should allow three inches of cable to make a 90 degree turn in your runs without causing signal loss. The connectors used with the coax must also hold the correct spacing through the body of the connector to avoid signal loss. The transmission of energy in the line occurs totally through the dielectric inside the cable between the conductors. This shielded cable can be bent and moderately twisted without negative effects, and can be strapped to conductive supports without inducing signal interference.From the manufacturer Ultra Low Loss Times Microwave Cable Assemblies for Critical Mission Requirements Tech Specs Ultra Low Loss 90 degree bends in one inch or less without loss. LMR-400 minimum coiling diameter is only 4 inches. LMR-195 has 1\/2 the signal loss of RG-58 and is the same size coax. LMR-240 (1\/4 inch coax) has less loss at many frequencies than RG-213. Made in the U.S.A. LMR COAX is proudly made by Times in Wallingford Connecticut. Times Microwave Systems Cable Assemblies by MPD Digital The Choice of First Responders, NASA and the US Military All Times cable assemblies come with a 20 Year UV exposure rating - A 10 Year Factory Warranty - A 1 Year exchange policy and 60 day return policy with No Restocking Fees. Manufactured by MPD Digital Times cable assemblies are manufactured in Albany, GA, USA. to the Highest Quality Standards. MPD Digital cable technicians are FCC Licensed Amateur (Ham) Radio Operators and cable assemblies are tested using Bird SiteHawks. Read more Specification Sheets LMR-195 LMR-195 Coax is the same size as RG-58 & RG-316. Constructed for use up to 10 GHz, LMR195 makes a great cable for short runs at WiFi and Cellular frequencies and is equally suited for runs up to 100 feet for HF and VHF use. For CB, HF, and VHF antennas LMR-195 is Far Superior to RG-58. The PE jacket used on LMR-159 makes it much tougher and able to stand abrasion and take a beating. It also makes it a bit less flexible than RG-58. LMR-240 LMR-240 Coax is the same size as RG-8x or Mini-8 cable, about 1\/4 inch in diameter. Although it is just a bit larger than LMR-195, LMR240 offers a significantly larger center conductor and supports better signal retention for longer cable runs and higher frequency use. LMR-240 is an excellent cable for runs up to 25-30 feet in WiFi and Cellular use, and provides superior performance for HF\/UHF\/VHF installation up to 150 feet. The PE jacket used on LMR-240 makes it much tougher and able to stand abrasion and take a beating. It also makes it a bit less flexible than similar sized RG Type coax. LMR-400 The First and still the Best! LMR-400 Coax is the same size as RG-8U or RG-213 cable, .405 inches in diameter. A larger cable means a much larger center conductor and supports better signal retention for HF\/VHF\/UHF and higher frequency use. Like all LMR cables the PE Jacket and Dual Shield eliminates the need for conduit and avoiding electrical sources. LMR-400 is an excellent cable for runs up to 50-70 feet in WiFi and Cellular use, and provides superior performance for HF\/UHF\/VHF installation up to 250 feet. The PE jacket used on LMR-400 makes it much tougher and able to stand abrasion and take a beating. It also makes it a bit less flexible. Read more Ham - Cellular - CD - EMC - Sat Phone - MPD Digital Helps Maximize Your Signal! When You Just Need It to Work Coax is deceptively simple! In reality the tolerances and purity of the Conductor, Dielectric, and Shield are critical in making a cable last. MPD Digital cables are Warrantied for 10 years for simple reason. They Work and Last! Indoor, Outdoor, and Specialty Applications are all supported. When Communication is Critical The right cable and manufacturing techniques are Critical when you expect a communications cable to function at 100% of it's Rated Capacity. MPD Digital Cables are one of the choice for critical communications. Current customers include the US Coast Guard, NOAA, NASA, Police and Fire Departments and the US Army and Marine Corps. When You Need to Make Contact Whether you are operating at high power for DX or enjoy the challenge of QRP operation, MPD Digital manufactures a cable assembly to meet your needs. We have cable assemblies and jumpers that will assure the lowest signal loss at 5 Watts and others that will support power levels up to 15 Kw. When You Need to Comunicate from Off-Grid Cable assemblies designed for Maximum Signal, Direct Exposure and Portability are a specialty. Cables are built Tough to handle abrasion and the strain of frequent movement. MPD Digital manufactures cables for Outdoor, Marine, and portable use. Jumpers and Antenna cables are available for All types of remote communication needs. Read more The MPD Digital Brand - Albany GA A small business supplying RF communications solutions to Commercial and Government customers. Kimberly Distribution dba MPD Digital also manufactures thousands of cable assemblies each month. We stand behind each cable or antennas quality and conditionally warranty each cable for 10 years and UV exposure for 20 years. Since we built it, if you break it, we can fix it! For Federal purchasing credit MPD Digital is Veteran Owned, Woman Owned, Small Business and operates in the Albany Hub Zone. MPD Digital cable assemblies meet all requirements of the Buy USA Act. Read more When Not to Use Times Microwave LMR Cables Made by MPD Digital Sometimes MPD Digitals US Made RG Coax Works Better LMR Coax is made for Efficiency and Signal Retention We had a customer run 10,000 Watts of Power at 800 MHz. The cable failed. While we have coax cable made for up to 20 Kw, its not LMR. Avoid Repeated Flexing and Bending LMR comes in different versions, standard LMR is the most used, but has a solid center conductor. If you need a cable for a rotor, or installation where the cable will be bending up to 90 degrees often during use we build cables using LMR Ultra Flex. LMR UltraFlex coax or PVC jacketed braided RG Coax is the go to cable for ultimate flexibility! Read more ","features":"{\"product_summary\": \"Coax Cable\", \"category\": \"electronics\", \"material\": \"copper\", \"functions\": {\"main_function\": \"transmit\", \"additional_function_1\": \"shielding\", \"additional_function_2\": \"bend\"}, \"compatibility\": \"antennas\", \"price\": 50, \"other_details\": \"low loss\"}"}
{"docid":127,"title":"Aroma Housewares 6-Cup (Cooked) (3-Cup Uncooked) Pot Style Rice Cooker and Food Steamer (ARC-743-1NG), White","text":"Product Description Enjoy easy home cooking with the aroma 6-cup (cooked) pot style rice cooker and food steamer. Restaurant-quality rice. Healthy steamed meals. Delicious one-pot dishes. Prepare all this and more at the flip of a switch! Aroma takes the \"cook\" out of home cooking - turning kitchen time into your time! Help the kids with homework, get creative at play time or pick up that novel you've been waiting to dive into. All while delivering hot, hearty and healthy meals the entire family will love. This convenient cooker's compact capacity perfectly cooks 2 to 6 cups of any variety of rice. Once the rice has finished, it will automatically switch to keep-warm so there's no need for monitoring or stirring. The steam tray allows for healthy steaming of meats and vegetables, even as rice cooks below. It's also perfect for oatmeal, chili, jambalaya, soups and so much more! And when the cooking is done, the inner cooking pot and all accessories remove for easy cleanup in the dishwasher. Steam tray, rice measuring cup and serving spatula included. Product Description Enjoy easy home cooking with the aroma 6-cup (cooked) pot style rice cooker and food steamer. Restaurant-quality rice. Healthy steamed meals. Delicious one-pot dishes. Prepare all this and more at the flip of a switch! Aroma takes the \"cook\" out of home cooking - turning kitchen time into your time! Help the kids with homework, get creative at play time or pick up that novel you've been waiting to dive into. All while delivering hot, hearty and healthy meals the entire family will love. This convenient cooker's compact capacity perfectly cooks 2 to 6 cups of any variety of rice. Once the rice has finished, it will automatically switch to keep-warm so there's no need for monitoring or stirring. The steam tray allows for healthy steaming of meats and vegetables, even as rice cooks below. It's also perfect for oatmeal, chili, jambalaya, soups and so much more! And when the cooking is done, the inner cooking pot and all accessories remove for easy cleanup in the dishwasher. Steam tray, rice measuring cup and serving spatula included.From the manufacturer Read more Our Mission: Striving to design and distribute a line of products that enhance and enrich lives. 6-Cup (Cooked) Pot-Style Rice Cooker & Food Steamer Enjoy easy home cooking with the Aroma 6-Cup (Cooked) Pot Style Rice Cooker and Food Steamer. Restaurant-quality rice. Healthy steamed meals. Delicious one-pot dishes. Prepare all this and more at the flip of a switch! Aroma takes the 'cook' out of home cooking turning kitchen time into your time. Help the kids with homework, get creative at play time or pick up that novel you've been waiting to dive into. All while delivering hot, hearty and healthy meals the entire family will love. Read more Simple One-Touch Design Cooking has never been easier. With the simple press of a button, you can cook incredibly fluffy rice in no time. We love this 'set it and forget it' concept and we know you will too! Steam Technology The unique steam tray accessory allows for perfectly cooked veggies, poultry, fish, and more in one, compact cooker. Have a delicious meal without sacrificing quality any night of the week! Meal Versatility Whether you are in the mood for a hearty jambalaya, steamed veggies and rice, or even a fluffy cake (yes, cake!) you can accomplish it all with your ARC-743-1NG cooker. The possibilities are as endless as your creativity. Everything You Could Need This pot-style rice cooker includes a non-stick inner pot, an aluminum steam tray, rice measuring cup, and a plastic rice spatula. Read more Our Vision and Values Listening to our customers is how we’re able to provide products that are convenient, innovative, and valuable. Ultimately, it’s how we provide products that offer life enriching experiences for our customers and their families-fostering greater harmony in the world we all share. Aroma’s core values stem from an unrelenting desire to create products that make your life easier, a whole-hearted dedication to the community and a focus on fostering meaningful and lasting relationships with others. Read more ","features":"{\"product_summary\": \"Aroma Rice Cooker\", \"category\": \"kitchen\", \"material\": \"aluminum\", \"functions\": {\"main_function\": \"cooking\", \"additional_function_1\": \"steaming\", \"additional_function_2\": \"warming\"}, \"compatibility\": \"all\", \"price\": 30, \"other_details\": \"compact\"}"}
{"docid":128,"title":"The Children's Place Baby Boys' and Toddler Short Sleeve Pique Polo","text":"From the manufacturer Read more Read more Read more ","features":"{\"product_summary\": \"Baby Polo\", \"category\": \"clothing\", \"material\": \"pique\", \"functions\": {\"main_function\": \"comfort\", \"additional_function_1\": \"style\", \"additional_function_2\": \"breathable\"}, \"compatibility\": \"baby boys, toddler\", \"price\": 15, \"other_details\": \"short sleeve\"}"}
{"docid":131,"title":"Victorinox Swiss Army Cutlery Fibrox Pro Knife Set, 4-Piece","text":"Product Description A TRUSTED FAVORITE Preferred by both home chefs and culinary professionals, the 4-Piece Victorinox Fibrox Chef's Knife Set can handle nearly every kitchen task imaginable. Crafted with comfortable handles, superior weight and balance, and razor sharp edges that rarely require re-sharpening, these knives are essential tools for every kitchen. KEY FEATURES High-quality, lightweight European steel. Handle design reduces hand and wrist fatigue. Fit for dicing, mincing, chopping, slicing, and shredding. Long, sloping curved blade that “rocks” for effortless mincing and chopping. Flat spine for extra power to slice through hard-skinned items. Textured handle for a secure and comfortable grip no matter the hand size. National Sanitary Foundation (NSF) approved and dishwasher safe. CARE AND USE Be good to your knives and they’ll be good to you. Following these simple guidelines will ensure that you get the longest life out of your knife! CLEANING Victorinox Swiss Army recommends washing all knives by hand. For best results, hand wash your knives with a soapy cloth and dry immediately. While Fibrox knives are dishwasher safe, we recommend hand washing as dishwashers are designed to spray water at a relatively high pressure, which can jostle the silverware and cause the knives to collide, dulling the edge. SHARPENING For optimum performance, knives should be honed after every couple of uses. Proper and frequent use of a honing steel will keep your knives sharper and performing at their best. FORMERLY FORSCHNER In 1937 Victorinox began selling cutlery in America through a Connecticut distributor called R.H. Forschner & Co. A well-known manufacturer of butcher scales, Forschner soon became the exclusive U.S. distributor for Victorinox knives, and was the name by which Victorinox knives were known. Product Description A TRUSTED FAVORITE Preferred by both home chefs and culinary professionals, the 4-Piece Victorinox Fibrox Chef's Knife Set can handle nearly every kitchen task imaginable. Crafted with comfortable handles, superior weight and balance, and razor sharp edges that rarely require re-sharpening, these knives are essential tools for every kitchen. KEY FEATURES High-quality, lightweight European steel. Handle design reduces hand and wrist fatigue. Fit for dicing, mincing, chopping, slicing, and shredding. Long, sloping curved blade that “rocks” for effortless mincing and chopping. Flat spine for extra power to slice through hard-skinned items. Textured handle for a secure and comfortable grip no matter the hand size. National Sanitary Foundation (NSF) approved and dishwasher safe. CARE AND USE Be good to your knives and they’ll be good to you. Following these simple guidelines will ensure that you get the longest life out of your knife! CLEANING Victorinox Swiss Army recommends washing all knives by hand. For best results, hand wash your knives with a soapy cloth and dry immediately. While Fibrox knives are dishwasher safe, we recommend hand washing as dishwashers are designed to spray water at a relatively high pressure, which can jostle the silverware and cause the knives to collide, dulling the edge. SHARPENING For optimum performance, knives should be honed after every couple of uses. Proper and frequent use of a honing steel will keep your knives sharper and performing at their best. FORMERLY FORSCHNER In 1937 Victorinox began selling cutlery in America through a Connecticut distributor called R.H. Forschner & Co. A well-known manufacturer of butcher scales, Forschner soon became the exclusive U.S. distributor for Victorinox knives, and was the name by which Victorinox knives were known.From the manufacturer Read more Product Details Length of Blade: Various Sizes Type of Edge: Straight and Wavy Edge Weight: Various Dishwasher Safe: Yes Swiss Made: Yes Collection: Fibrox About Victorinox Here at Victorinox, everything is about extraordinary products: reliable, clever companion for your everyday adventures at home, travelling and in the great outdoors. Since our founding in 1897 and the introduction of the \"Original Army Knife\" by Karl Elsener, we have developed into an international brand that combines functionality, innovation, iconic design and uncompromising quality. With our technical and design-oriented know-how, we design products with which you can travel, work smartly and master the challenges of life in a variety of areas. Fibrox Pro 4-Piece Knife Set Ergonomically Designed Preferred by both home chefs and culinary professionals, the 4-Piece Victorinox Fibrox Chef's Knife Set can handle nearly every kitchen task imaginable. Crafted with comfortable handles, superior weight and balance, and razor sharp edges that rarely require re-sharpening, these knives are essential tools for every kitchen. Care Tips To ensure that your knives have a long service life and always stay in optimal condition, clean them immediately after use. This prevents salt and acid residues from damaging the blade. Clean the product with mild detergent and rinse it under running water. Then dry well and store safely. Read more Ergonomic Handles Nonslip handles ensure you keep a secure grip and work safely as you prepare anything from soft fruits to large cuts of meat. Durable Materials Exceptional edge retention means the high-carbon stainless steel blade has an extended life span and stays sharp for longer. Highest Quality Offers precision sharpness and maximum stability for safe, comfortable cutting, slicing and chopping. Read more Fibrox Pro Slicing Knife Fibrox Pro Pastry Knife Fibrox Pro Breaking Knife Fibrox Pro Carving Knife Fibrox Pro Butcher Knife Number of Knives 1 1 1 1 1 Length of Blade 7.9 in 10.2 in 8 in 10 in 8 in Type of Edge Straight Edge Wavy Edge Curved Edge Straight Edge Granton Edge Weight 6.1 oz 4.8 oz 5.6 oz 5.6 oz 7 oz Dishwasher safe ✓ ✓ ✓ ✓ ✓ Swiss made ✓ ✓ ✓ ✓ ✓ Collection Fibrox Pro Fibrox Pro Fibrox Pro Fibrox Pro Fibrox Pro Article number 5.4233.25-X3 5.2933.26-X10 5.7203.20-X2 5.4503.25-X1 5.7423.20-X1 Read more ","features":"{\"product_summary\": \"Knife Set\", \"category\": \"kitchen\", \"material\": \"steel\", \"functions\": {\"main_function\": \"cutting\", \"additional_function_1\": \"slicing\", \"additional_function_2\": \"chopping\"}, \"compatibility\": \"universal\", \"price\": 100, \"other_details\": \"durable\"}"}
{"docid":132,"title":"Acelitt Women Comfy Drawstring Casual Elastic Waist Pocketed Shorts Pants (S-XXL)","text":"From the brand Previous page Acelitt Hot Style Visit the Store Acelitt Hot Style Visit the Store The mission of the Acelitt company, as a designing type brand, is to represent the international pulse of fashion trend in design style, market and delivery of a perfect lifestyle system to global customer. The requirement of innovation capability, righteousness and the quality of service are put into use their products and philosophy. Acelitt highlights the real demand of customers everywhere, from leisure time to work time, young to ladies. How we got our start? Acelitt was created with a clear purpose in mind. That is to empower women by letting them feel good about themselves. What makes our product unique? Our products are based on the theme of sexy fashion, including sweaters, coats, jumpsuits, shirts and other full women's series. We have an independent research and development team, we are fast on new products, and try our best to lead the trend of women's clothing. Why we love what we do? Acelitt adheres to the business philosophy of \"making it easy to buy fashionable clothing\".We always believe that giving you confidence, beauty and comfort is our greatest success! Next page Product Description Acelitt Womens Summer Drawstring Shorts Pants You are looking for a casual companion for Summer fashion styles: Then this shorts are exactly the right ones, because they bring sun into your outfit! Combine the shorts with basic t-shirt, blouse, tunic and flats and sandals - you will become a fashion queen in this way. Acelitt Women Ladies Casual Elastic Waist Linen Shorts with Pockets Clothing Type: Women’s Shorts Pattern: Solid Color Length: Short Pant Length Waist: Mid Rise Women Ladies Casual Summer Elastic Waist Beach Linen Sweat Shorts with Pockets They always fit perfectly, because there is moderate stretchable wide waistband, comfortable to wear; besides, the drawstring integrated into the waistband provides support and conjures up a great figure , you can adjust it according to your needs. Summer Casual Loose Drawstring Elastic Waist Pocketed Shorts Pants for Women The Hem Of The Trousers Is Fashionably Turned Over. Loose cut, these casual pants follow every movement. Side pockets further underline the casual touch of these shorts. Their soft flowing and skin-friendly material ensures real comfort and a great silhouette. Beach Linen Sweat Shorts Adjustable elastic drawstring Cozy and soft shorts for summer This comfy short with two pocket and drawing design Wide Leg Shorts Features: Mid\/High-rise elastic waistband for stretchy fit, Pockets both sides and back, Basic Solid, Adjustable waist drawstring Side pocket design It is perfect to match with various blouses Wide and comfortable shorts legs can bring you the perfect wearing experience Two back pockets It looks casual chic and loose cozy to wear Casual and skin-friendly fabric with distressed style Acelitt Womens Summer Fashion Collection Womens Summer Jumpsuits Womens Cutout Dress Womens Short Rompers Womens Bodycon Dress Zipper Striped Hoodies Drawstring Elastic Shorts Womens Halter Tank Tops Category Women's Short Rompers Womens Dress Women's Short Rompers Womens Dress Sweatshirt Womens Shorts Womens Tops Highlights Tie Waist Romper Sexy Bodycon Dress One Piece Romper Printed 3 Color Block Drawstring Elastic Waist High Neck Halter Season Spring\/Fall\/Summer Spring\/Fall\/Summer Spring\/Fall\/Summer Spring\/Fall\/Summer Spring\/Fall\/Winter Spring\/Fall\/Summer Spring\/Fall\/Summer Soft ✔ ✔ ✔ ✔ ✔ ✔ ✔ Skin-friendly ✔ ✔ ✔ ✔ ✔ ✔ ✔ Acelitt Womens Summer Fashion Collection Womens Midi Tank Dresses Womens Halter Tops Womens V Neck Jumpsuit Womens Cutout Dress Womens T-Shirts Dresses Womens Sweat Shorts Womens A-Line Dresses Category Womens Short Dress Womens Tops Women's Rompers Womens Dress Womens Short Dress Womens Summer Shorts Womens Dress Highlights T-Shirt Dresses Sleeveless Halter Wide Leg Jumpsuit Bodycon Dress A-line Tank Dress Solid Shorts Button Down Dress Season Spring\/Fall\/Summer Spring\/Fall\/Summer Spring\/Fall\/Summer Spring\/Fall\/Summer Spring\/Fall\/Summer Spring\/Fall\/Summer Spring\/Fall\/Summer Soft ✔ ✔ ✔ ✔ ✔ ✔ ✔ Skin-friendly ✔ ✔ ✔ ✔ ✔ ✔ ✔ ","features":"{\"product_summary\": \"Drawstring Shorts\", \"category\": \"bottoms\", \"material\": \"linen\", \"functions\": {\"main_function\": \"comfort\", \"additional_function_1\": \"casual\", \"additional_function_2\": \"elastic\"}, \"compatibility\": \"women\", \"price\": 25, \"other_details\": \"pocketed\"}"}
{"docid":133,"title":"Caddis Men's Green Neoprene Stocking Foot Wader","text":"Product Description The Caddis brand has stood for quality for many years. All of our products are on the cutting edge of available technology and every wader is water tested before the brand ever goes on the product. All Caddis waders, wading shoes, Jackets, vests and accessory products come with a one year manufacturers warranty. Please refer size chart above Product Description The Caddis brand has stood for quality for many years. All of our products are on the cutting edge of available technology and every wader is water tested before the brand ever goes on the product. All Caddis waders, wading shoes, Jackets, vests and accessory products come with a one year manufacturers warranty. Please refer size chart aboveFrom the manufacturer Read more About us When you live or work around water as much as we do, you develop the deepest understanding of comfort and warmth. Caddis designers are more than “designers.” They’re anglers, hunters, sportsmen and women that spend as much time in the field as they do the office. They realize the true value triplelayer CaddisDry fabric brings to our 100% waterproof, breathable waders. They’ve experienced the importance of perfectly sealed and sewn seams first hand. They’ve trudged across Alaskan peat bogs, navigated the slipperiest algae infested boulder fields, and sat in duck blinds all December long. It takes this level of dedication to design the unique innovations you’ll find in every Caddis product – innovations that make life in the outdoors comfortable, enjoyable and productive. When you depend on Caddis, expect your outdoor adventures to last and last and last. ","features":"{\"product_summary\": \"Wader\", \"category\": \"outdoor\", \"material\": \"Neoprene\", \"functions\": {\"main_function\": \"Waterproof\", \"additional_function_1\": \"Breathable\", \"additional_function_2\": \"Durable\"}, \"compatibility\": \"Men's\", \"price\": 150, \"other_details\": \"Quality\"}"}
{"docid":135,"title":"Loungefly Sanrio Hello Kitty Kawaii Faux Leather Wallet","text":"Product Description Loungefly Sanrio Hello Kitty Kawaii Faux Leather Wallet Product Description Loungefly Sanrio Hello Kitty Kawaii Faux Leather Wallet","features":"{\"product_summary\": \"Hello Kitty Wallet\", \"category\": \"accessory\", \"material\": \"faux leather\", \"functions\": {\"main_function\": \"storage\", \"additional_function_1\": \"style\", \"additional_function_2\": \"organization\"}, \"compatibility\": \"N\/A\", \"price\": 30, \"other_details\": \"kawaii\"}"}
{"docid":136,"title":"Oven Mitts, VEHHE Extra Long Silicone Oven Mitt Heat Resistant 500°F, Food Safe Baking Gloves with Soft Inner Lining, Non-Slip Pot Holders for Kitchen Cooking Grilling, 15 Inch Black 2-Pack","text":"From the brand Previous page VEHHE Brand is devoted to providing valuable home, health and electronic products. Our first product is a reusable stainless steel straw. Over time, VEHHE has derived a series of products that suitable kitchen and home. Since 2018, we've provide services and products more than 5 million homes worldwide, and VEHHE have become one of the most popular sellers of home and kitchen on Amazon. Electronic Products Visit the Store Kitchen Accessories Visit the Store Our Mission Because of a lot of inconvenience home accessories, VEHHE want to change this situation and try our best to create a new life for you. Reusable and Durable Idea According the green and recycle regular, VEHHE sell several reusable and silicone product, dedicated to contributing positively to our environment and planet. Customer Priority As VEHHE customers, We want to ensure that everyone 100% satisfied. And we will improve the quality of product continually and give you satisfied solutions. Next page Product Description VEHHE - Devoted to providing valuable home, health, and electronic products. V - Value E - Environment H - Home H - Health E - Electronics VEHHE Oven Mitts Make Your Cooking Time Easy and Safe VEHHE oven mitts adopts food-grade silicone, safe and odorless. thickened quilted liner, can effectively defense against heat, which can provide protection up to 500°F, compared with other oven mits in the market, our silicone gloves are 15 inches, longer wrist protection keeps you protected from fingertip to past your wrist. The unique texture of pattern and silicone particles provide the best grip, perfect for reaching into ovens and moving or holding hot pans, etc. Specifications: Material: food grade silicone Size: 15 x 7.6 inches Package: black silicone oven mitts Application:perfect for griping pots, pans and cookware and reaching into ovens Read more Thickened Quilted Liner: Our oven mitts are made of thickened quilted liner, thickened quilted liner increases heat insulation, can provide protection up to 500°F. Besides, thickened quilted liner make it softer and more comfortable. Non-slip Grip Design: Our silicone pot holders are flexible, and the silicone part has an non-slip texture design, which can improve your grip of control and stability of high temperature, heavy or smooth objects. Longer Wrists Sleeves:Our cooking gloves are made of heat-resistant silicone and heat insulation cotton, which can provide protection up to 500°F. The 15-inch length can completely wrap the arm to prevent burns Read more Heat Resistant Oven Gloves Compared to other oven mitts, our silicone oven gloves are more heat resistant up to 450°F and provides you a much safer using when touch hot foods and tableware. 15 inches extra long mitts protect your whole forearm from boiling water and oils. Read more Read more ","features":"{\"product_summary\": \"Oven Mitts\", \"category\": \"kitchen\", \"material\": \"silicone\", \"functions\": {\"main_function\": \"heat-resistant\", \"additional_function_1\": \"non-slip\", \"additional_function_2\": \"protective\"}, \"compatibility\": \"cooking\", \"price\": 20, \"other_details\": \"extra-long\"}"}
{"docid":138,"title":"Candy Girl","text":"Editorial Reviews No Description Available. Genre: Soul\/R&B Media Format: Compact Disk Rating: Release Date: 6-MAR-1995 Editorial Reviews No Description Available. Genre: Soul\/R&B Media Format: Compact Disk Rating: Release Date: 6-MAR-1995","features":"{\"product_summary\": \"Candy Girl\", \"category\": \"music\", \"material\": \"disk\", \"functions\": {\"main_function\": \"listen\", \"additional_function_1\": \"soul\", \"additional_function_2\": \"R&B\"}, \"compatibility\": \"compact\", \"price\": 15, \"other_details\": \"editorial\"}"}
{"docid":139,"title":"Flow Alpha Snowboard Bindings Mens Sz L (7.5-11.5) Grey","text":"Product Description Designed for beginners to handle the entire mountain comes the Flow Alpha Bindings. Featuring the ExoFit Powerstrap and a molded composite Rockered Baseplate, you'll have reliable ankle support with efficient energy transfer and less fatigue. The reclining molded composite Uniback Highback offers simple and easy entry and exit, and is outfitted with EVA pads for extra comfort and cushion. Combine all of that with the LSR Locking Slap Ratchets and the Flow Alpha Snowboard Binding is a totally-customized, dual-entry binding to suit your riding style. Product Description Designed for beginners to handle the entire mountain comes the Flow Alpha Bindings. Featuring the ExoFit Powerstrap and a molded composite Rockered Baseplate, you'll have reliable ankle support with efficient energy transfer and less fatigue. The reclining molded composite Uniback Highback offers simple and easy entry and exit, and is outfitted with EVA pads for extra comfort and cushion. Combine all of that with the LSR Locking Slap Ratchets and the Flow Alpha Snowboard Binding is a totally-customized, dual-entry binding to suit your riding style.","features":"{\"product_summary\": \"Flow Alpha Bindings\", \"category\": \"snowboard\", \"material\": \"composite\", \"functions\": {\"main_function\": \"support\", \"additional_function_1\": \"entry\", \"additional_function_2\": \"comfort\"}, \"compatibility\": \"beginners\", \"price\": 150, \"other_details\": \"dual-entry\"}"}
{"docid":140,"title":"ECCO Men's Fusion II Tie Oxford","text":"From the manufacturer A Fit Like No Other ECCO designs footwear to meet your needs, whether you're taking the stairs, walking around the city all day, or scrambling over rocky slopes; ECCO delivers superior fit, durability, support and flexibility. Our advanced construction techniques and continuous exploration in materials science add up to comfort you can count on. You'll notice the difference immediately - and at the end of an intense hike or after walking a dozen blocks uptown, you'll continue to appreciate the difference of ECCO. Read more The ECCO Freedom Fit Conventional shoes fit across your feet at the toes, restricting the way your toes spread as you walk. ECCO's Freedom Fit is different; it offers a roomy toe box and fits more narrowly from heel to instep, suitable for most widths. Toes spread naturally to support your weight and foster a more comfortable walking experience. Feet of nearly all widths feel good in ECCO, comfort straight from the box. Read more ECCO Leather ECCO is one of the very few manufacturers to have its own tanneries where it processes its own hides and leathers. This ensures that ECCO has the highest quality control from raw materials to finished shoe. The various highly advanced processes and treatments, to which the hides are subjected, always reflect the look and specific function of the product. This ensures a perfect match of form and function. ECCO Comfort Fibre System This exclusive inlay sole is designed with a vegetable-tanned leather surface. Underneath is a soft layer of unique, moisture-absorbent foam; treated with AGION for long-lasting and effective control. The pumping effect of the foam is activated as you walk- pushing air through tiny holes in the lining to create comfortable air circulation around the foot. Polyurethane Soles Polyurethane (or PU) is a manufactured material that can take the place of rubber. PU is the longest lasting material for outsoles; often lasting 2-3 times longer than traditional materials. In an ECCO shoe, PU is made to be flexible and shock absorbing; requiring little to no break-in period and allowing the wearer to be comfortable longer. PU also retains is shape or 'Memory' longer, allowing the wearer the same support from the first day to the last in their ECCO shoes. These ECCO shoes have a nylon or TPU shank allowing the wearer to breeze through some security checkpoints without removing their shoes. Direct Injection Process Direct inject Production or DIP is a highly specialized process in which ECCO is a world leader. This discipline represents the core competence of ECCO sole technology- and one of the secrets behind the special and famous 'instant fit' of an ECCO shoe. It’s a process where the upper is placed into the mould, and liquid polyurethane (PU) is injected to shape the and anatomically correct midsole and \/ or outsole. Robot precision ensures a consistent quality regardless of the production location. Read more ","features":"{\"product_summary\": \"ECCO Fusion II Oxford\", \"category\": \"footwear\", \"material\": \"leather\", \"functions\": {\"main_function\": \"comfort\", \"additional_function_1\": \"durability\", \"additional_function_2\": \"support\"}, \"compatibility\": \"all widths\", \"price\": 150, \"other_details\": \"flexible\"}"}
{"docid":141,"title":"Women's Smart Watch, Fitness Tracker Smart Watch for Women, Color Touch Screen, Fitness Sleep Monitor Waterproof Call Reminder with Text GPS Auto Wake Screen Smartwatches for iPhone Android","text":"Product Description SKMEI brand Outdoor Sport and Fashion Casual Style. We are committed to providing the best products, the excellent user experience for the buyer. B36 integrates the public's favorite appearance and function, low-key luxury, and personality fashion. Special for you, special for Women! The watch with high precision and elegant appearance reflect the elegance of the lady, which can be a good match for the dress. Multifunction smart bracelet with round colorful screen leads you to sports and fashion. Its sleek design also reveals your good taste in fashion. This is a fashion-forward watch for fashionable women. Physiological function, Know You Better Four states are displayed in the watch with the icon. Every period is well known. Make your life more regular and orderly. Physiological period: Have prepared in advance so be calm Safety period: Good time for Sports and shaping Ovulation period: Pregnancy tool, more intimate Ovulation day: Be your good personal healthy assistant Read more Special for Women, Fashionable and Colorful The anodizing process makes it more colorful and makes you better When you need a present in Mother's Day, Valentine's Day, Christmas, anniversary, occasion, wedding or even business gift, women smartwatch B36 is always a good choice. No matter it's for your girlfriend, wife, female family or friends. Read more Sports Mode, A good slimming helper Simultaneous recording of multiple sports data, making the sports more quantitative. Set goals, and slim without delay Sleep Monitor, Wear it without feeling The watch automatically detects the body state, opens the sleep monitoring mode, and generates sleep time data and sleep quality analysis data on the APP Smart Reminder, Without missing the message When incoming calls from the mobile phone, the watch will vibrate and display the caller's name. Long press to hang up directly; View the message directly on the watch Read more Easy to charge Magnetic contact charging: without the need for cumbersome insertion and removal Support 5V charger and computer interface Battery type: Polymer lithium battery 100mAh Charging type: Magnetic contact charging Comfatable and durable Net weight: 31g Case: 6063 aviation aluminum Thickness of main body: 8.5mm Screen: 240*RGB*198 Memory: 64M flash Easy to replace strap Quick release strap: no need tools, just flip IP68 Waterproof: can wear it when swimming, washing to meet daily needs Strap: silicone, comfortable soft skin-friendly strap Support: Android 4.3+, iOS 8.0+ Read more  ","features":"{\"product_summary\": \"Smartwatch\", \"category\": \"wearable\", \"material\": \"aluminum\", \"functions\": {\"main_function\": \"fitness\", \"additional_function_1\": \"sleep monitor\", \"additional_function_2\": \"call reminder\"}, \"compatibility\": \"iPhone Android\", \"price\": 80, \"other_details\": \"color touch screen, waterproof, GPS, lightweight\"}"}
